[
  {
    "id": "1.1",
    "title": "Tutorial island up to and including Wintertodt",
    "totalTime": "X hours, Y mins",
    "steps": [
      {
        "number": 1,
        "content": "Choose a swag look for your account (older guides will mention that you need to start as a female character \\- **this is no longer required**). Make sure you have two step authenticator enabled. For most of the guide it is assumed you carry your GP stack. All lamps, unless mentioned otherwise, go on Herblore until the end of Chapter 2 (Song Of The Elves completed). Grab a knife, jug and fill it with water, 2 buckets (hop once), cabbage, leather boots. Talk to Duke Horacio to start Rune Mysteries, burn logs to 15 firemaking, bank 5 ashes. Grab 110 logs and bank them.",
        "meta": {
          "gp_stack": "25 gp",
          "items_needed": "none",
          "skillsquests_met": "yes",
          "total_time": "35 minutes"
        }
      },
      {
        "number": 2,
        "content": "Grab coins, a knife, 24 logs, your mind and air runes. Pickpocket men to 235 gp total, suiciding if you die (HCIM can grab cabbages by world hopping in the cellar). Fletch the logs into arrow shafts as you move. Talk with Hans to check your age for the diary step. Talk to Veos in The Sheared Ram pub to start X Marks the Spot. Drop your mind and air runes, talk with the magic tutor to get a set of starter runes, pick up your mind and air runes. Buy a spade, hammer and a chisel in the general store. Talk to father Aereck to start Restless Ghost. Buy a steel axe from Bob. Dig in the tile north of the north-western window of his house for X Marks the Spot. Don’t throw away your bronze axe from Tutorial Island.",
        "meta": {
          "gp_stack": "0 gp",
          "items_needed": "232 gp, knife, logs",
          "skillsquests_met": "yes",
          "total_time": "51 minutes"
        }
      },
      {
        "number": 3,
        "content": "Fletching the logs into arrow shafts as you move, go south and do Misthalin Mystery. Head west to Father Urhney to get a ghostspeak amulet. Grab the leather gloves from his house. Run to Draynor village, grab and wear the forestry kit and buy 26 wines from Fortunato.",
        "meta": {
          "gp_stack": "0 gp",
          "items_needed": "knife, logs",
          "skillsquests_met": "yes",
          "total_time": "1hr 18 minutes"
        }
      },
      {
        "number": 4,
        "content": "Use the clan wars minigame teleport to go to Ferox’ enclave, restore your run energy if you wish (clan portal or northwest) and deposit all your items. Grab 7 iron bars (hop six times) and take the portal to Soul Wars (northeast, in the cave). Bank your items, grab a knife, jug of water, bronze axe, steel axe, tinderbox, leather gloves, 5 wines and 18 logs, then exit the portal to Edgeville. Fletching arrow shafts as you move, head south and grab two nettles, then pull the lever to level 51 wilderness, then again to go to Ardougne, then again for the diary, then again to get back to Ardougne.",
        "meta": {
          "gp_stack": "0 gp",
          "items_needed": "knife, logs, jug of water, bronze axe, steel axe, tinderbox, leather gloves",
          "total_time": "1 hr 23 minutes"
        }
      },
      {
        "number": 5,
        "content": "Fletch all but one logs into arrow shafts as you move south, talk to Ceril Carnillean to start Hazeel Cult. Grab two purple dyes (world hop to speed it up). Enter the cave east of the clocktower and talk to Clivet, side with Hazeel, exit the cave and run to the Monastery. Talk to Brother Omad to start Monk’s Friend.",
        "meta": {
          "gp_stack": "0 gp",
          "items_needed": "knife, logs",
          "skillsquests_met": "yes",
          "total_time": "1 hr 27 minutes"
        }
      },
      {
        "number": 6,
        "content": "_TL;DR: do Clock Tower, Monk’s Friend, Hazeel Cult and get level 35 woodcutting, burning the logs and swapping to oaks at 15. Eat your food if you take damage._ Run to the clocktower, talk to Brother Kojo to start Clock Tower. Go down the ladder and start the steps for the white cog (north-west direction), grabbing a second rat poison along the way. When you exit through the ladder head southwest to the stone circle and go down the ladder, run past the thieves (use prayer here, deplete the point) and grab the child’s blanket. Leave, run North and turn Valve 1 RIGHT, Valve 2 RIGHT, go to the basement of Carnilleans house and use the bottle of poison on the cooking range. Go upstairs and talk to Ceril. Return to Clivet. Turn Valve 3 LEFT, place the white cog in the clocktower (top floor). Return the blanket to Brother Omad, make sure to proceed the Monk’s Friend quest. Head to Valve 5 and turn it RIGHT, then Valve 4 and turn it RIGHT, then go to Brother Cedric, give him the jug of water and logs (if you accidentally fletched all chop some logs here). Grab the nearby bucket, fill it in the well, head down the ladder to the north-east and follow the path to obtain the blue cog. Climb up the ladder, place the blue cog in the clocktower (second floor), obtain the black cog (north-east direction downstairs) and place it (basement), obtain the red cog (south-east direction downstairs) and place it on the correct spindle (first floor). Talk to Brother Kojo to complete Clock Tower. Go to Clivet and board the raft, talk to Alomone. Head to the Ardougne Monastery and talk to Brother Omad to finish Monk’s Friend. Finish the rest of Hazeel Cult (Butler Jones, the chest key in the basement, the chest behind the fake wall to get the scroll, return to Alomone). Bank to gain inventory space, then cut and burn logs to level 35 woodcutting (level 39 firemaking, swapping to oaks at 15).",
        "meta": {
          "gp_stack": "2500 gp",
          "items_needed": "jug of water, 1 normal log, steel axe, tinderbox",
          "skillsquests_met": "yes",
          "total_time": "3 hrs 25 minutes"
        }
      },
      {
        "number": 7,
        "content": "Head to Ardougne general store (Aemad’s Adventuring Supplies), buy 3 ropes, 1 water-filled vial pack, 30 balls of wool, 7 papyrus. Restore your prayer at the East Ardougne church, check your insured pets at Probita, buy two silver bars from the Silver Merchant (hop worlds once). Steal cakes until you have at least 98 cakes and 14 bread _(more cakes optional \\- this will get you to approximately 86 firemaking at wintertodt. If you want to go to level 99 collect approximately 250-300 total instead)_, then steal 84 silk.",
        "meta": {
          "gp_stack": "1719 gp",
          "items_needed": "781 gp, will need to bank while buying from Aemad and while stealing cakes/silk",
          "total_time": "4h30m"
        }
      },
      {
        "number": 8,
        "content": "Do Sheep Herder while fletching more logs, bring a spade to dig up clue hunter gloves and boots ([http://i.imgur.com/sOD5Zhz.png](http://i.imgur.com/sOD5Zhz.png))",
        "meta": {
          "gp_stack": "4719 gp",
          "items_needed": "100 gp, knife, logs, spade",
          "skillsquests_met": "yes",
          "total_time": "5h06m"
        }
      },
      {
        "number": 9,
        "content": "Take your gp, a small fishing net, knife and more logs (if you are running low: make sure to leave 10 in the bank for future quests), fletch as you move and take the boat to Brimhaven, buy a swamp paste, 7 soda ash, 7 buckets of sand, a cake tin and a glassblowing pipe from Trader Stan. Head to Kangai Mau in the Shrimp and Parrot to start Tribal Totem. Return to Witchhaven and do the Sea Slug quest. Fish a shrimp after the quest for Ardy diary. Buy a raw sardine, two fishing rods, a fly fishing rod, a harpoon, 10 fishing bait and a lobster pot from Lovecraft’s Tackle (Witchhaven). Continue Tribal Totem to the point where you collect the totem. Sell 73 silk back to the trader (leave 11 in the bank) for 60gp each and sell your oyster pearls to the general store.",
        "meta": {
          "gp_stack": "9349 gp",
          "items_needed": "290gp, knife, logs, fishing net",
          "skillsquests_met": "yes",
          "total_time": "5h48m"
        }
      },
      {
        "number": 10,
        "content": "Bring your coins, ghostspeak amulet, a spade, 20 balls of wool, the tribal totem and treasure scroll. Head to Brimhaven and complete Tribal Totem. Teleport to Lumbridge (optional: minigame teleport to clan wars first to restore run energy), talk to the restless ghost. Go to the back exit of Lumbridge Castle and dig to progress X Marks the Spot. Run north, and complete Sheep Shearer, grab seven onions. Run to Draynor and progress X Marks the Spot (twice). Buy a Chronicle and three teleport cards from Diango. Go to the Wizards’ Tower with the air talisman, talk to Wizard Sedridor and trade the air talisman for a research package. Grab the ghost’s skull from the altar for Restless Ghost.",
        "meta": {
          "gp_stack": "8629 gp",
          "items_needed": "780 gp, ghostspeak amulet, spade, 20 balls of wool",
          "skillsquests_met": "yes",
          "total_time": "5h53m"
        }
      },
      {
        "number": 11,
        "content": "Go back to Draynor bank. Buy the rainbow scarf from Diango. Read the notice board to start a Porcine of Interest, talk to Morgan to start Vampyre Slayer and take three garlic. Grab coins, a small fishing net and one empty bucket. Walk to Port Sarim and speak to Veos to complete X Marks the Spot (destroy the lamp and reclaim them later to put them on herblore). Start Pirate’s Treasure, and continue the quest. Fish at Musa point for the diary, then continue Pirate’s Treasure until you get the rum from the crate in Port Sarim. Buy a raw chicken, three raw beef, two cheese, eight redberries, one banana and three pots of flour, depositing items (not the raw meat\\!) in the deposit box near the Entrana monks if you need inventory space. Buy 16 feather packs from Gerrant one by one. Open the packs while running north to the range. Use your incredible skill to burn one beef on the range (cook twice if needed), cook one and leave the last one raw. Buy an eye of newt from Betty. Talk to Frank to get the pirate’s key. Deposit all items except the bucket and coins in the deposit box. Head to Entrana and collect 10 planks (near the law altar) and two eggs (bank at deposit box). Speak with Captain Tock to start The Corsair Curse. Go to Sarah to progress A Porcine of Interest, buy 9 sacks, secateurs, seed dibber, rake, trowel, 3 plant pots, 1 watering can, 2 plant cures, then collect a bucket of milk from the dairy cow. Head to Falador, grab your coins, raw sardine and chronicle. Buy 2 woad leaves (offer 20gp to Wyson), start The Knight’s Sword and get told to talk to Reldo, start Black Knights’ Fortress.",
        "meta": {
          "gp_stack": "5288 gp",
          "items_needed": "3445 gp, fishing net, bucket",
          "skillsquests_met": "yes",
          "total_time": "6h27m"
        }
      },
      {
        "number": 12,
        "content": "Use your chronicle to teleport to Varrock (optional: clan wars teleport to restore run energy first). Start Gertrude's cat, pick up some doogle leaves, go to Varrock square. Talk to Aris Maye (formerly Gypsy Aris) to start Demon Slayer, Romeo to start Romeo and Juliet, Shilop and Wilough to progress Gertrude's Cat, Noah to start and complete Children of the Sun, Sir Prysin downstairs to progress Demon Slayer (and again), King Roald to start Priests in Peril, Reldo to progress The Knight's Sword and start Shield of Arrav (then check the book and speak with Reldo again), Captain Rovin to progress Demon Slayer, grab the pie dish in the kitchen, go upstairs and grab a bucket, go back downstairs and fill the bucket with water, use the bucket of water on the drain outside the kitchen to flush the Demon Slayer key, head east down the manhole and collect the key, go back out and north to the estate agent and collect a saw, start Daddy’s Home.",
        "meta": {
          "gp_stack": "5187 gp",
          "items_needed": "101 gp, Chronicle",
          "skillsquests_met": "yes",
          "total_time": "6h52m"
        }
      },
      {
        "number": 13,
        "content": "Go to the Varrock East bank, take the Pirates’ Treasure key, research package, hammer, saw, some runes for casting wind strike and coins. **Note: if you want to join the Phoenix gang, follow the instructions to complete Shield of Arrav in this guide step (yellow, italicized). However, it is recommended to postpone the quest and join the Black Arm Gang later (red, underlined), since that is usually in higher demand.** _Go to the Varrock center, talk to Baraek and pay him 20gp to progress Shield of Arrav (Phoenix clan) make sure to check all dialogue options._ **Make sure you have at least 3704 gp left after the next Aubury shopping trip.** Go to Aubury, give him the research notes and buy 100 mind, 100 air, 50 water, 50 earth, 20 fire runes _(no rune packs)_. Speak with Dimintheis in Varrock East to start Family Crest. Head to Old Man Yarlo for Daddy’s home and progress the miniquest to the point you collect the waxwood logs from the crates in the kitchen. Head _south to the Phoenix hideout and talk to Straven to progress Shield of Arrav then head_ to the Blue Moon Inn, go upstairs and open the chest at the end of the hall, read the message (you can drop it after). _Go back downstairs and kill Johnny the beard (with magic) and pick up the report._ Talk to Dr Harlow to progress Vampyre Slayer, buy him a beer. Buy an extra beer for later. _Go back to Straven, give him the report to get the Weapon store key. Grab half of the Shield of Arrav. From now on every time you are in Varrock you may complete Shield of Arrav with a partner, at your own convenience (sooner is better)._ Use clan chat “osrs soa” to find a partner. If you plan to join the Black Arm Gang: head southwest to Charlie the Tramp, speak with him, then enter the Black Arm Gang hideout to the west, speak with Katrine and progress the quest.",
        "meta": {
          "gp_stack": "3983 gp (assuming Shield of Arrav is not completed)",
          "items_needed": "1204 gp, key, package, hammer, saw, 30 air/mind runes",
          "skillsquests_met": "yes",
          "total_time": "6h58m"
        }
      },
      {
        "number": 14,
        "content": "Go to the Varrock East bank. Grab a bucket of milk, raw sardine, doogle leaves, steel axe, chronicle, 3650 gp, waxwood logs, knife and all but 10 of your logs (if you have more than that remaining). Fletch remaining logs (of the original 100, so 1500 arrow shafts) into arrow shafts as you run to the east and speak with Regulus Cento to take the quetzal to Varlamore. Travel back to Varrock via quetzal and run north to the sawmill. Enter the Lumber Yard, proceed with Gertrude's Cat until the cat goes home. Chop down a dying tree. Make the logs into a plank, buy 5 bolts of cloth and 100 steel nails, turn the waxwood logs into planks. Head east and start Rag and Bone Man I. Teleport using the chronicle, speak to Gertrude and complete the quest. Speak with Juliet. Go to the bank and grab a saw, hammer, 10 planks, 5 bolts of cloth, 3 waxwood logs, Julia’s letter and your steel nails. Give the letter to Romeo. Go to Old Man Yarlo and fix his house. Go to Marlo and complete Daddy’s Home, enter the church and speak with Father Lawrence to progress Romeo & Juliet.",
        "meta": {
          "gp_stack": "333 gp",
          "items_needed": "3650 gp, Chronicle, bucket of milk, raw sardine, doogle leaves, steel axe, wax logs",
          "skillsquests_met": "yes",
          "total_time": "7h21m"
        }
      },
      {
        "number": 15,
        "content": "Bank, grab your hammer, saw, steel nails, one POH tab, GP, burnt meat, eye of newt, onion, 18 planks, 5 noted bolts of cloth and 5 noted planks (so there are 3 planks left in your bank). Break the POH tab and use your planks to train construction (6 wooden chairs, unnote your planks and cloth at Phials, 1 crude wooden chair, 1 brown rug and 1 torn curtains). Talk to Hetty to start Witch’s Potion, kill a rat, then return to Hetty complete Witch’s Potion.",
        "meta": {
          "gp_stack": "333 gp",
          "items_needed": "saw, hammer, 86 steel nails, POH tab, burnt meat, eye of newt, onion, 100 air/mind runes, 5 bolts of cloth, 5 noted planks, 50gp",
          "skillsquests_met": "yes",
          "total_time": "8h07m"
        }
      },
      {
        "number": 16,
        "content": "Minigame teleport to Clan Wars, take the portal to Soul Wars. Chop teak logs on a forestry world and burn them to level 50 firemaking _(note: it would theoretically be faster to 2t, but the birds will actually just kill you at your current stats)._ 1. Alternatively, use 2t oak cutting to train your woodcutting, see e.g. [Getting Rats for 2t Oaks](https://www.youtube.com/watch?v=3ysPgln5qZ4&pp=ygUMb3NycyAydCBvYWtz), though keeping the rats in cycle while burning the logs may prove difficult.",
        "meta": {
          "gp_stack": "333 gp",
          "items_needed": "steel axe, tinderbox, forestry kit",
          "skillsquests_met": "yes",
          "total_time": "10h10m"
        }
      },
      {
        "number": 17,
        "content": "Minigame teleport to Fishing Trawler, grab your leather gloves, spade, hammer, saw, one beer, a house teleport, 1500 arrow shafts and 1501 feathers and head north. Complete the Tower of Life. Adding feathers to arrow shafts as you move, break another POH tab, walk to Port Sarim and talk to Veos to go to Zeah. Do the Client of Kourend quest up to and including the point where you activate the orb at the Dark Altar. While visiting Jennifer, buy shears from her shop, then visit the Shayzien Styles directly west of her general store, buy a chef’s hat, grab an orange dye and a black wizard’s hat. When leaving Shayzien dig up the Clue hunter garb along the way (just north of the bridge heading east, [https://oldschool.runescape.wiki/w/Clue_hunter_garb\\#/media/File:Crack_the_Clue\\!\\_-\\_Week_2_map.png](https://oldschool.runescape.wiki/w/Clue_hunter_garb#/media/File:Crack_the_Clue!_-_Week_2_map.png)). Continue the quest until visiting the Dark Altar, then head to Wintertodt.",
        "meta": {
          "gp_stack": "280 gp",
          "items_needed": "saw, hammer, 1500 arrow shafts, 1501 feathers, POH tab, beer, leather gloves, spade",
          "skillsquests_met": "yes",
          "total_time": "11h56m"
        }
      },
      {
        "number": 18,
        "content": "Do Wintertodt for a long time. If you want to get max stats in the most efficient manner continue until almost 99 firemaking, using the banked cakes for food. Your four warm items are the clue hunter garb, gloves and boots along with the rainbow scarf. If you wish to leave earlier to save some time this is fine. It is most efficient to do ‘hoptodt’ \\- hopping to a game where the wintertodt is around 60-70% energy, then fletching logs to get (just over) 500 points barely in time, getting the crate and xp bonus, then hopping to the next world. This is highest firemaking xp _and_ highest loot rolls/hr, but does require a plugin/stream/scout to find the wintertodt energy percentages on other worlds. **Shortly after this step** it is a goal to get to level 46 fletching, if you do hoptodt (instead of no-fletch single world or multiskilling in the bank between games) you will get most of this fletching xp from todt but if not you will need more gp for fletching supplies. _You may prefer to leave some firemaking gap for using an infernal axe at redwoods later (not efficient, but very low effort). Each infernal axe used this way gives 5.7m woodcutting xp and 875k firemaking xp. Levels 90-99 is 7.7m xp. If you want to take this strategy, stop training FM at level 98\\. Quests, random things, and 1.5 infernal axes at redwoods for 90-99 woodcutting will finish off 99 FM._ We strongly recommend getting as many as possible of the following while at wintertodt: 1. 128k gp \\+ 2.62 gp/xp for fletching (the goal is level 46, so 68k xp). 1. While exactly 128k gp is enough, it is recommended to get a bit extra in case you unexpectedly need more runes or want to deviate. 2. 60 woodcutting (higher is better, you will need 70 later and the rest will be trained with sulliusceps and 2t teaks outside Soul Wars). You can get this elsewhere too. 3. Uncut rubies and emeralds, at least 50 each (more is better, you will have to buy up to \\~120 rubies so if you go lower you need more gp down the line. They cost 1k gp each, and emeralds cost 500 gp each). 4. 8 uncut sapphires (more is better). 5. 16 magic logs (for Desert Treasure, Mourning’s End Part I and Monkey Madness II. If you do not get enough you will need 75 woodcutting instead of 70). _Note that you can only get magic logs by opening crates after level 50 woodcutting, so don’t open any crates before that point\\! Furthermore, the chance of getting them massively increases at level 60 woodcutting. It is therefore recommended to only open crates at level 60 woodcutting or higher. There is one more break point for opening the loot \\- after completing The Digsite quest, step 40 of chapter 1, getting better ores. Other skills and levels are not worth waiting for._ 6. The following logs for bird runs: 13 oak, 24 willow, 52 teak, 44 maple. 7. 10 willow logs and 20 mahogany logs for the Varrock medium diary, 11 yew logs for the Ardougne medium diary, 1 yew log for the Desert hard diary, 1 oak, willow and maple log for Enakhra’s Lament, 1 willow log for Icthlarin’s Little Helper. About 10 regular logs for assorted use. Extra mahoganies and teaks are very welcome for construction. 8. Oak logs to cut into headless arrows, to make arrow shafts for 46 fletching (only as many as needed \\- you will get 190 fletching xp per oak log). 3 more oak logs for Sleeping Giants (do not cut these into shafts) 9. 30 construction (more is better, 30 is essential) 10. 2 iron ore 11. 1 silver ore 12. 1 grimy ranarr weed 13. 3 willow seeds 14. 15 harralander seeds (or more lower tier herb seeds for similar xp) 15. \\~200 pure essence 16. A raw swordfish (you can get this from tempoross later). 17. Some silver and gold ore (\\~50 silver, \\~100 gold is sufficient, more is better. If you don’t get enough you may have to buy some at the blast furnace later). 18. Some fletching levels along the way (the guide will assume level 31, 15,500 xp, after this step, if you are over/under you can adjust your future plans for making steel arrows to 46 fletching accordingly). 19. _Optionally: do a small group kill on a separate world for 3000 or more points in one game for the Combat Achievement._",
        "meta": {
          "gp_stack": "280 gp",
          "items_needed": "2 pieces of warm clothing, steel axe, tinderbox, cakes",
          "skillsquests_met": "yes",
          "total_time": "2 days 10 hours"
        }
      }
    ]
  },
  {
    "id": "1.2",
    "title": "Some fishing and thieving",
    "totalTime": "X hours, Y mins",
    "steps": [
      {
        "number": 19,
        "content": "Grab your pickaxe and a POH tab, break it, mine 10 clay and 4 copper in the Rimmington mine. Run to Draynor, have Aggie make you 3 yellow dyes and 1 blue dye (you can use the ingredients on Aggie to skip the dialogue). Buy 10 chronicle cards. Grab your pie dish, a bucket, three pots of flour and three redberries.",
        "meta": {
          "gp_stack": "126465 gp",
          "items_needed": "1545 gp, bronze pickaxe, POH tab, 3 pots of flour, 3 redberries, 6 onions, 2 woad leaves, pie dish, bucket",
          "skillsquests_met": "yes",
          "total_time": "2d10h"
        }
      },
      {
        "number": 20,
        "content": "Walk to Port Sarim, make 3 pastry doughs in the northern house with the water icon and one by one try to make them into a cooked redberry pie. Buy 16k feathers from Gerrant (for fly fishing later. If you do not have level 46 fletching yet, also buy feathers to get that level. You will gain 6.33 fletching xp per steel arrow made from scratch, or 6 xp per arrow made with the headless arrows already banked). Speak with Thurgo to progress The Knight’s Sword. Run to Betty and buy 1500 mind runes (pack), 500 air runes (pack), 1500 water runes (pack), 500 earth runes (pack), 500 fire runes (pack), 200 body runes (manual), 100 chaos runes (manual, 9396 gp vs 9950 gp), 150 death runes for Desert Treasure (manual)**_._** Talk to Veos to go to Zeah, talk to Veos again and complete the Client of Kourend (destroy the lamps and reclaim them later to put them on herblore), talk to Veos _again_ to travel to Land’s End, grab 1-3 bird snares, five box traps and a butterfly net ([https://imgur.com/a/bdU88Xo](https://imgur.com/a/bdU88Xo)), then speak with Captain Magoro to return to Port Piscarilius. 1. _From here on out, whenever you are walking a lot add feathers to your arrow shafts while moving._",
        "meta": {
          "gp_stack": "35004 gp",
          "items_needed": "95672 gp, 3 pots of flour, bucket, pie dish, 3 redberries",
          "skillsquests_met": "yes",
          "total_time": "2d11h"
        }
      },
      {
        "number": 21,
        "content": "Run to Piscarilius, grab wind strike runes and your stew, start The Queen of Thieves and continue the quest until you are asked to search Councillor Hughes’ home (browse the Warrens General Store in between for the diary). Head south and kill a Giant Rat northeast of Hosidius square for its meat and the giant rat bone, talk to the Estate Agent (this is needed to be able to move your POH to Kourend later). Buy a compost pack from Vannah. Pickpocket from the fruit stalls in the house on the east of Hosidius square to _a bit over_ 42 thieving (46,512 xp\\!). Bank one jangerberry (optionally: bank two as it’s a possible Fairytale pt. 1 item), all the strange fruit and the golovanova tops (you will need at least 2 tops). 1. You can run between the two fruit stalls for higher xp rates, but this depletes run energy. You can eat the papayas you get to restore some of that. 2. Use the strange fruits for energy restoration anywhere you please, they are a budget alternative to energy potions at low level and are not required for anything in particular later.",
        "meta": {
          "gp_stack": "33004 gp",
          "items_needed": "8812 gp, stew, staff of air, mind runes, hammer",
          "skillsquests_met": "yes",
          "total_time": "2d13h"
        }
      },
      {
        "number": 22,
        "content": "Use your chronicle to teleport to Varrock, buy one of each elemental staff from Zaff. Use clan chat “osrs soa” to find a partner. Collect the weapon store key from your Shield of Arrav partner and kill the Weaponsmaster to grab two Phoenix crossbows for Shield of Arrav (this fight may be tough, use magic and bread or cakes), take them to Katrine and collect the half of the Shield of Arrav. Finish the Shield of Arrav at the Varrock Museum (optional: do this earlier so you don’t make your partner wait). Grab your soda ash, sand, spade, leather gloves, strike runes and Falador tab. Take the quetzal to Varlamore, start and continue Ethically Acquired Antiquities until the step where you have to visit Port Sarim. Break your Falador tab, collect the portrait for The Knight’s Sword, speak with Sir Renitee for the diary, turn the soda ash and sand into molten glass. Kill a duck (with magic), complete Pirate’s Treasure. Now bank, grab raw beef, chicken and rat meat, an orange and blue dye (make the orange dye with red \\+ yellow if needed), 2 iron ore, 4 copper ore, 6 clay, 2 cheese, your gp stack and a couple of food (3+ cakes or wines). _Optional: swap one cheese for one cake/wine for Witch’s House._ Run north, do Doric’s Quest. Go back east and start Below Ice Mountain at Wilow, safespot a bear on the trees north of Falador for the meat, fur and ribs. Complete Goblin Diplomacy, Witch’s House (there are safespots for all the forms of the Witch’s experiment\\!) and Druidic Ritual. Start Fishing Contest, buy an eye of newt pack from Jatix. Also buy an empty vial and a pestle and mortar. Minigame teleport to clan wars and restore run energy at Ferox, bank and grab two iron bars, a POH tab, the portrait, and a pickaxe.",
        "meta": {
          "gp_stack": "27748 gp",
          "items_needed": "5856 gp, 7 soda ash, 7 buckets of sand, spade, Falador tab, POH tab, wind staff, 1200 mind runes, raw bear meat, raw beef, raw chicken, rat meat, red dye, yellow dye, blue dye, bronze pickaxe, 2 iron ore, 4 copper ore, 6 clay, 2 cheese, 2 iron bars, leather gloves",
          "skillsquests_met": "yes",
          "total_time": "2d14h"
        }
      },
      {
        "number": 23,
        "content": "Break another POH tab and return to Thurgo. Mine two blurite ore. Go back to Thurgo and make the sword. Run to a trader crewmember in Port Sarim for Ethically Acquired Antiquities, then talk to Betty to progress that quest. Run to Falador east bank. Grab your coins, ghostspeak amulet and skull. Pay to move your house to Pollnivneach at the estate agent. Complete The Knight’s Sword. Smelt the blurite ore into a bar.",
        "meta": {
          "gp_stack": "20248 gp",
          "items_needed": "7500 gp, bronze pickaxe, POH tab, ghostspeak amulet, ghost skull, two iron bars",
          "skillsquests_met": "yes",
          "total_time": "2d15h"
        }
      },
      {
        "number": 24,
        "content": "Ferox teleporting for run energy if necessary, chronicle teleport to Varrock. Speak with Curator Haig Halen in the Varrock Museum and continue Ethically Acquired Antiquities until you have his confession, then take the quetzal to Varlamore and speak with Curator Herminius to complete Ethically Acquired Antiquities. Home teleport to Lumbridge, bank, grab items for the step below. Shear a sheep, complete the Restless Ghost. Cross the gate to Al-Kharid and start The Feud (buy the desert disguise). Run south and buy one of each mould in Dommik’s Crafting Store shop including tiara but not bolt, plus a second necklace mould, along with 3 needles and 100 thread (200 if HCIM), then some mithril platelegs. Go east, start and complete Sleeping Giants. Buy 9 bronze bars in the Shantay Pass, along with two sets of desert clothes (one pair of boots only), 5 Shantay passes, 16 bucket packs, 20 buckets of water, 4 bowls of water and 10 waterskins. Make 4 soft clay while you’re at the bank chest. Make sure to bring 5 buckets for Ugthanki dung and wear leather gloves during the following quests. _Note: the following quests can be multiquested, but for the sake of inventory space and convenience it is fine to do Tourist Trap completely, then do The Feud after._ 1. Do the Tourist Trap up to the step where you have Ana in a barrel **(Oziris has made the following guide for safespotting the Captain fight in that quest: [https://www.youtube.com/watch?v=VFxB4zWqrd8](https://www.youtube.com/watch?v=VFxB4zWqrd8))**. Continue The Feud until the step where Ali the Mayor tells you to return to Ali Morrisane (last step) (pick up extra Ugthanki dung, 3 extra beers and 3 vodkas during the quest). Both the Mercenary Captain and Tough Guy can be safespotted. \\*The Tough Guy fight takes some RNG, if your hits are poor he will despawn and you have to try again. If you have enough poor rng to hit 17 or higher magic you can use bolt spells to improve your chances. **Carry chaos runes for bolt spells here\\!\\*** Complete The Tourist Trap, put both xp rewards on agility. Return to Ali Morrisane and complete The Feud. 2. Take the carpet to Pollnivneach and blackjack to 31k gp (total) and 49 thieving on bearded bandits, whichever comes last (this should be the thieving level). Note: blackjacking has a high fail rate at low level, and this step is unpleasant. It gets much better around level 55-60, so hang in there. [OSRS blackjacking (270k xp/h)](https://www.youtube.com/watch?v=6wuG8IvxHbM)this is the general method, only slown on the higher level bandits here but the setup is the same. At lower thieving level the fail rate is significant, you just have to drink a bunch of wines (bought at the local shop) and power through the early levels.",
        "meta": {
          "gp_stack": "34189 gp",
          "items_needed": "12200 gp, shears, 3 oak logs, 10 steel nails, hammer, chisel, bucket, leather gloves, 50 feathers, Shantay pass, 3 waterskins, bronze pickaxe, knife (to slash cacti), wind strike and bolt runes, chaos runes",
          "skillsquests_met": "yes",
          "total_time": "2d18h"
        }
      },
      {
        "number": 25,
        "content": "Clan wars minigame teleport, take the portal to Castle Wars. Withdraw 3 planks, 1 bronze bar and one molten glass. Run north, grab an inventory of superantipoisons (84 doses \\- 21 pots (4)-dose) by hopping, then start and complete the Observatory quest.",
        "meta": {
          "gp_stack": "34189 gp",
          "items_needed": "3 planks, 1 bronze bar, 1 molten glass",
          "skillsquests_met": "yes",
          "total_time": "2d18h"
        }
      },
      {
        "number": 26,
        "content": "Use the Fishing Trawler minigame to teleport to Port Khazard. Buy 1600 soda ash and 10 buckets of slime (if it is competitive or bought out, charter to Catherby and buy them there). _If you are a HCIM also buy 125 pots and buckets of slime._ Charter a ship to Catherby. Buy steel arrowtips to round out 46 fletching (if you don’t have that level yet). We recommend buying 250/world to save hopping but if you are low on gp you can buy 100/world instead to save some cash here. Take out a knife from the bank and a light source (grab a candle along the way and light it with a tinderbox if you don’t have any). Grab insect repellant, collect two buckets of wax and five flax (diary) and speak with Sherlock (diary). Enter the Temple of Ikov and grab some Boots of Lightness, then leave again. Start Merlin’s Crystal up to the step where you need to visit Arhein. Run to Seers, grab the fishing pass and other items for fishing contest from the bank. Continue Fishing Contest to the step where you get the trophy. Fly fish north of Seers bank to 35 fishing, banking the fish. Complete Murder Mystery while training (start the quest, get all relevant clues in the mansion, fish an inv, bank, do the relevant steps in the village, resume the quest etc.). Home teleport to Lumbridge, cross the gate to Al-Kharid (costs 10gp), run south and speak with Hassan to start Prince Ali Rescue, then Osman to resume the quest. Run south and board Ferryman Sathwood’s ferry. Train fishing at mass world Tempoross to level 56\\. It is most efficient to cook the harpoonfish instead of using them raw. _Make sure to only cash in the reward permits after you have hit level 50 fishing \\- this is a significant boost to your loot\\!_ 1. _From here on add steel arrowtips to your headless arrows as you move, to get level 46 fletching._ 2. You can make a fire underneath yourself to tick manipulate cook-fish fly fish ([https://streamable.com/90mz74](https://streamable.com/90mz74)), but beware that you want to bank some trout for quests and salmon for food for later. **_Note that you need at least 15 cooking for this, so you will need to train some cooking on the side, for example buying raw fish from Gerrant in Port Sarim, to make this work._** 3. If you went all the way to 99 firemaking, and therefore also made at least 99000 gp in excess of the amount you needed at WT, make a detour to Ignatius Vulcan when picking flax and buy the Firemaking cape. This has some uses both as a light source and for defensive stats, but mostly it is just iconic. 4. Tempoross will also give random amounts of planks, nails, raw fish, gold bars, gems and other loot that will be useful later. None of these are required but all of them will help down the line. 5. There are several Combat Achievement tasks for Tempoross. It is recommended (but fine if you don’t) to complete as many of the easy and medium tier as you can during this Tempoross grind. 6. Optionally you can stay for the fish barrel. It is a good item for barbarian fishing and for buying karambwans (Brimhaven POH method [https://www.youtube.com/watch?v=zDkz186YgME](https://www.youtube.com/watch?v=zDkz186YgME)), some people also use it to fish karambwans (lowering the rate in exchange for longer trips, i.e. making it more afk). Staying for a fish barrel is not recommended. 7. Solo methods for Tempoross exist, but they are difficult at low level and not recommended.",
        "meta": {
          "gp_stack": "18579 gp",
          "items_needed": "15600 gp, 2 buckets, knife, light source or tinderbox, fishing rod, fly fishing rod, feathers, empty pot, garlic, spade",
          "skillsquests_met": "yes",
          "total_time": "3d4h"
        }
      },
      {
        "number": 27,
        "content": "Fishing trawler teleport, do the fishing trawler minigame for a complete Angler’s outfit (48 games average, you can use an axe+hammer instead of needing swamp paste, bailing bucket optional for more activity. Chopping at tentacles/repairing railings is usually competitive so stay close to the railing and spam click). Make sure to collect a rusty sword along the way, and have the Tindel Marchant identify it. Also save polished buttons (if you get them). Note that once you hit 50 activity inside the minigame it will not go back down, so you can afk for the rest of the game and you will get the reward rolls. Buy two swamp paste, a hammer and four tinderboxes at the general store. Clan wars minigame teleport to get to Edgeville, speak with Marley for Below Ice Mountain. Cut 8 sapphires. Make a sapphire necklace and a silver sickle. Bring a knife and go to the Mage Arena, buy 200 cosmic runes (you won’t need these until later, so if it is very crowded you can stop at just 20). Enchant the sapphire necklace into a games necklace.",
        "meta": {
          "gp_stack": "8579 gp",
          "items_needed": "10000 gp, steel axe, hammer, chisel, necklace mould, sickle mould, knife, sapphire, gold bar",
          "skillsquests_met": "yes",
          "total_time": "3d9h"
        }
      },
      {
        "number": 28,
        "content": "Teleport to the barbarian outpost with your games necklace. Unlock the minigame teleport (start the teleport animation to confirm it worked, then just click away to cancel it), start Alfred Grimhand’s Barcrawl, go south and do the Waterfall quest until the step where you need the pebble (bring your rope). Buy a greenman’s ale from Rasolo. Start Dwarf Cannon up to the step where you need to find Lollk.",
        "meta": {
          "gp_stack": "8575 gp",
          "items_needed": "9 gp, 1 rope, 6 logs, wind strike, barcrawl card, food",
          "skillsquests_met": "yes",
          "total_time": "3d10h"
        }
      },
      {
        "number": 29,
        "content": "Minigame teleport to Fishing Trawler, complete Fight Arena and enter the Tree Gnome Village maze. Collect Glarial’s pebble along the way (don’t drop it after the quest). Start and complete Tree Gnome village.",
        "meta": {
          "gp_stack": "9570 gp",
          "items_needed": "5 gp, 6 logs, wind strike, barcrawl card, food",
          "skillsquests_met": "yes",
          "total_time": "3d11h"
        }
      },
      {
        "number": 30,
        "content": "Take the spirit tree to the Gnome Stronghold, start the Grand Tree. For the next shopping trip, make sure to leave 2586 GP. Buy dwellberries, 2 buckets of milk, 1 pineapple, 10 potatoes, 3 pots of flour, 4 cheese, 1 orange, 1 gnome spice and 120 produce items (all of onion, potato, cabbage, tomato, cheese, lime, orange, lemon, pineapple and dwellberries work, cheapest in red) and 130 chocolate dust (2 for quests, 128 for energy potions) from the Grand Tree Groceries. Visit Blurberry’s bar for the barcrawl, buy a premade blurb’ sp. Collect two swamp toads and take off their legs. 1. If you have more gp than required at this step, buy premade gnome food (all choc bombs, veg balls, ttl’s, worm holes and all battas) from the gnome waiter, banking the food for quests/generic use. This food only delays your attack by two ticks, as opposed to the 3 ticks delay from most food, so it is superior in many situations despite not healing as much. [OSRSRecklessLadHowDoesFoodWorkV2.png](https://drive.google.com/file/d/1Xn4YfME8C4Gqm5A5qh-T9f0-XHN4_2CQ/view?usp=share_link)",
        "meta": {
          "gp_stack": "9008 gp",
          "items_needed": "562 gp, barcrawl card",
          "skillsquests_met": "yes",
          "total_time": "3d11h"
        }
      },
      {
        "number": 31,
        "content": "Minigame teleport to the barbarian outpost, grab a rope, Glarial’s pebble, some food, water strikes and the runes for Waterfall quest _(optional: already bring your feathers)_. Complete Waterfall quest (you have to juggle some gear at Glarial’s Tomb) and kill a Fire Giant in the west room for the diary. Barb fish to 32 agility, keep your heavy fishing rod. Minigame teleport to Port Khazard, charter a ship to Aldarin, start and complete Death on the Isle. Collect the costume needle and the icon after the quest, using the icon to unlock the teleport on the pendant of ates. Minigame teleport back to Barbarian Assault and resume barbarian fishing to level 50 agility. Also start barbarian farming (if possible). Knife-log teak logs to tick manipulate. 1. It is recommended to cut-eat (or cut-drop) the fish for free cooking xp. If you do not cut the fish for cooking xp you will need to train it at the mess hall (Hosidius) to level 70 later.",
        "meta": {
          "gp_stack": "6708 gp",
          "items_needed": "rope, Glarial’s pebble, trout, water strikes, all your feathers, 6 air runes, 6 earth runes, 6 water runes, 1 knife, 1 teak log",
          "skillsquests_met": "yes",
          "total_time": "4d9h"
        }
      },
      {
        "number": 32,
        "content": "Minigame teleport to Burthorpe, buy 5 Asgarnian ale, 39 Wizard’s mind bombs and 12 Dwarven stouts. Collect the Rogues outfit and crack a wall safe in the main area for the diary. Buy 75 lockpicks and 25 ropes. Cook fish (salmon, trout and all raw fish from tempoross) between the games to replenish run energy (you can 2t cook it), make sure you have at least 10 trout for Death Plateau and 15 salmon for In Aid of the Myreque. Grab your GP, blackjack and a POH tab (equip full rogues), run south and complete Fishing Contest.",
        "meta": {
          "gp_stack": "4162 GP",
          "items_needed": "2546 gp, willow blackjack, POH tab",
          "skillsquests_met": "yes",
          "total_time": "4d13h"
        }
      },
      {
        "number": 33,
        "content": "Break your last POH tab, enter your house for the diary, blackjack to 1.25m GP (level 77 thieving, lower if you did more wintertodt). [OSRS blackjacking (270k xp/h)](https://www.youtube.com/watch?v=6wuG8IvxHbM). At lower thieving level the fail rate is significant, you just have to drink a bunch of wines (bought at the local shop) and power through the early levels. The progression is bearded bandits to level 55, unbearded bandits to level 65 and menaphite thugs at level 65 and up. 1. _Whenever convenient past 750 total level, which will likely happen around this step or soon after (you gain a lot of levels in step 35 as well) depending on how much wintertodt you did, do Last Man Standing for points for a rune pouch (the recommended strategy is to play games for 1 def pures, either outskilling your opponents or bum rushing the closest player with dds specs at the start of the game into manual casting barrage from a distance while wielding a crossbow to confuse bots). Optionally also collect the magic shortbow imbue scroll._ 2. The guide information uses 1.25m instead, which is technically enough but not recommended. Staying for an extra 100k will help speed up buying battlestaves later and is highly recommended. With 371 GP left you should hit 1.25m GP at (approximately) **1,471,755 XP**, which is at level **76\\.** We will now assume that you have **1.25m GP** cash stack as a baseline when moving forward. Regardless of what your cash stack _actually_ was (due to WT variance) at all of the steps listed above, you can stop blackjacking at 1.25m, so that will be your nominal cash stack value for everything in Section 1.3.",
        "meta": {
          "gp_stack": "1,250,091 GP",
          "items_needed": "POH tab, willow blackjack, an initial set of wines (buy in Pollnivneach from Faisal the Barman)",
          "skillsquests_met": "yes",
          "total_time": "5d0h"
        }
      }
    ]
  },
  {
    "id": "1.3",
    "title": "Unlocking bird runs",
    "totalTime": "X hours, Y mins",
    "steps": [
      {
        "number": 34,
        "content": "Clan Wars teleport to Soul Wars to Edgeville, bank your money. Grab a knife and go to the Mage Arena. Buy 1250 nature runes, 700 law runes, 500 chaos runes (100 nats 50 laws 50 chaos per world, stop with chaos after 10 worlds) and all cosmics per world while you’re at it (best case: 20/world with 18 hops).",
        "meta": {
          "gp_stack": "777349 gp",
          "items_needed": "784932 gp, knife",
          "skillsquests_met": "yes",
          "total_time": "5d0h"
        }
      },
      {
        "number": 35,
        "content": "Grab a fly fishing rod, 10 feathers and 10gp. Home teleport to Lumbridge, catch a salmon for the diary, run to the Mage Training Arena. Grab 200 nature runes, 400 water runes, a staff of earth and six food (make sure to have at least 20 empty inventory slots). Collect 211 Graveyard points. An easy way is to grab and drop 4 bones once, then after that repeatedly grab a set of 8 bones (20 bananas) and deposit all, eating your food and later your bananas as needed while moving to stay alive. Go to the bank, grab 1050 nature runes, 500 law runes, 400 cosmic runes, a staff of air, a staff of earth, a staff of fire and 10 wizard mind bombs. Collect 211 telekinetic points, then using low alchemy collect 311 alchemist points (only alch the 30gp items, even if others are free). Optionally use the wizard mind bombs at levels 52-54 to gain access to high alchemy earlier. Collect 2165 enchantment points (lvl-4 enchant in the corner, using a wizard mind bomb as necessary, just drop the shapes after). Buy a mud rune, 10 mist runes, and unlock bones to peaches (this requires boosting to 60 magic with a Wizard’s Mind Bomb). At some point cast Bones to Peaches in the Al Kharid palace for the diary. Runes lost at MTA: 1140 nats, 473 laws, 382 cosmics, 272 waters. Runes gained at MTA: 66 earths/deaths/bloods.",
        "meta": {
          "gp_stack": "777339 gp",
          "items_needed": "10 gp, 1650 nature runes, 600 law runes, 5 cosmic runes, 492 water runes, air staff, earth staff, fire staff, fly fishing rod, 10 feathers",
          "skillsquests_met": "yes",
          "total_time": "5d9h"
        }
      },
      {
        "number": 36,
        "content": "Grab desert clothes, Varrock teleport runes, a small fishing net, coins and the barcrawl card from the bank. Charter a ship to Brimhaven, visit Dead Man’s Chest for the barcrawl, run south and pick up a seaweed and drop it 5 times (west of Jiminua’s shop) for the diary, keep it for later. Do Jungle Potion. During the quest collect 3 extra snake weed, 3 extra ardrigal, 1 extra volencia moss and 1 extra rogue’s purse. 1. Go to the shop and buy 7 charcoal (DT, RFD/Goblins, The Dig Site, Shilo Village, Zogre Flesh Eaters, possible Ft Pt 1 item, used but not used up in Legends’ and Darkness of Hallowvale) and 5 antipoisons. 2. Start Tai Bwo Wannai Trio, run south and fish at least 23 karambwanji (it is recommended to collect several hundred extra for growing cats). 3. Teleport to Varrock and run to the bank, grab coins, home and camelot teleport runes (air, earth, law), fire strikes, a spade, a steel axe and four soft clay (unnoted).",
        "meta": {
          "gp_stack": "775697 gp",
          "items_needed": "4840 gp, desert clothes, air/earth runes, law runes, 4 soft clay, barcrawl card, trout, steel axe, small fishing net, staff of fire, spade",
          "skillsquests_met": "yes",
          "total_time": "5d10h"
        }
      },
      {
        "number": 37,
        "content": "House teleport (spell) to Pollnivneach, run to the ruins of Uzer, start The Golem up to the step where you need to visit the Dig Site. Get 2 black mushrooms as mentioned on wiki. Chop some teak logs for the diary.",
        "meta": {
          "gp_stack": "772499 gp",
          "skillsquests_met": "yes",
          "total_time": "5d10h"
        }
      },
      {
        "number": 38,
        "content": "Teleport to Camelot and continue Merlin's Crystal up to the step where you need to visit the Lady of the Lake (use fire bolt or flinch, see [https://youtu.be/yWmvm8ukssU?t=523](https://youtu.be/yWmvm8ukssU?t=523), Sir Mordred. You cannot flinch with magic), buy two candles from the candle maker, buy a big net and fish two raw cods for RFD/Pirate and a raw mackerel for the diary and a bass when you’re in Catherby (you only need one cod if you’ve collected xp outside this guide and are at least 62 cooking) and cook the bass. Collect all the fish for Caleb and progress Family Crest to the step where you need to visit Avan. Make sure to kill two Giant Bats for their bones and one wing during Merlin’s Crystal. Train herblore in the bank to at least 1,170 xp or more (level 10). Buy a plant pot pack from Vanessa’s farming shop and open it.",
        "meta": {
          "gp_stack": "772373 gp",
          "items_needed": "26 gp, air runes, chaos runes, law runes, fire staff, bucket of wax, barcrawl card",
          "skillsquests_met": "yes",
          "total_time": "5d11h"
        }
      },
      {
        "number": 39,
        "content": "Chronicle teleport to Varrock, buy a rune shortsword, green d’hide chaps, green d’hide vambraces from Scavvo in the Champions’ Guild, if you joined the Black Arm Gang during Shield of Arrav also buy black platelegs and a black full helm from Valaine and start Dragon Slayer I. Visit the Blue Moon Inn for the barcrawl learn how to make a steak sandwich from the cook for Below Ice Mountain. Do a lap of the Varrock Rooftop Course for the diary. Buy priest gown (bottom and top), a brown apron and a pink skirt from Thessalia, a newspaper from Benny, a black platebody from Horvik and a rotten tomato from the chest. Make a steak sandwich for Below Ice Mountain. Steal a cup of tea, bring \\~10 food. Continue The Golem and start The Dig Site (only the very first step where you get the letter), continue Priests in Peril (kill the Temple Guardian with melee, accurate recommended, finish the dialogue at the temple), teleport back to Varrock, speak with King Roald, then visit Curator Haig Halen for both The Dig Site and The Golem, and proceed to complete The Dig Site (if you get polished buttons while digging save them for Animal Magnetism).",
        "meta": {
          "gp_stack": "745173 gp",
          "items_needed": "27313 \\+ 7708 (Black Arm Gang) gp, Chronicle, barcrawl card, air runes, law runes, rune sword, 3 ropes, leather gloves, leather boots (from Step 1\\!), pestle/mortar, vial, charcoal, tinderbox, cup of tea (stolen)",
          "skillsquests_met": "yes",
          "total_time": "5d11h"
        }
      },
      {
        "number": 40,
        "content": "If you still have unclaimed rewards from Wintertodt, open those now to get 8-12 coal. Teleport to Camelot, if necessary run to the Coal Trucks and mine 8 coal (12 if you wish to own your own mind shield). Return to Seers Village and do Elemental Workshop I. Kill one of each elemental for the diary, but 3 earth elementals instead of 1 to save time for Elemental Workshop II later (these are some tough fights \\- take your best food and gear, or flinch the elementals as needed). Make 3 elemental bars, only make one elemental shield to complete the quest. 1. If you don’t want a mind shield you only have to kill 2 earth elementals (and make 2 bars) total.",
        "meta": {
          "gp_stack": "737352 gp",
          "items_needed": "air runes, law runes, rune sword, knife, bronze pickaxe, needle, thread, hammer, 12 coal",
          "skillsquests_met": "yes",
          "total_time": "5d12h"
        }
      },
      {
        "number": 41,
        "content": "Teleport to Varrock and move your POH to Rellekka at the estate agent. Grab chisel, GP, earth runes from the bank along the way. Show your Level 3 certificate to the museum curator and claim ‘something to drink’ (make sure to go through the dialogue carefully\\!), take the museum quiz. Do NOT claim XP lamp from Historian Minas – this is for herblore later but has a level 20 requirement. Clean finds to get the following: 1. 50 (more) kudos 2. The ability to make digsite pendants 3. At least one cut jade (chance of breaking an uncut jade is around 45-50% at this crafting level, keep crushed gems in case you need one for Ft Pt 1). You may already have plenty of these from Tempoross.",
        "meta": {
          "gp_stack": "707352 gp",
          "items_needed": "10000 gp, fire staff, air runes, earth runes, law runes, chisel",
          "skillsquests_met": "yes",
          "total_time": "5d12h"
        }
      },
      {
        "number": 42,
        "content": "Teleport to Lumbridge, make a necklace of passage and two rings of dueling at the furnace. If you have extra gold/silver bars and the corresponding gems (from Tempoross), make as many more as you want (focus on rings of dueling and a few necklaces of passage). Hop to PVP world to rebank for all items while standing in the middle of the castle courtyard, then hop back (or just go to the top of the castle). **\\*From now on you are always assumed to wear a ring of dueling. Whenever you teleport, if you are low on run energy instead teleport to Ferox Enclave, restore your run energy, then teleport where you were going.** If you run out of gold bars before you complete Forgettable Tale…, tough luck.* Start and complete Cook’s Assistant, then start and complete RFD/Cook. Start RFD/Goblin, RFD/Dwarf and RFD/Pirate (talk to the cook again after starting this last one to learn the recipe\\!). Buy two spice, three pots of flour, two buckets of milk, two eggs from the chest. Prepare two uncooked redberry pies (buy ingredients in the Culinaromancer’s Chest if needed) and a bread dough. Cook the bread for the diary and the redberry pies on the range, add both nettles to two bowl of water and cook it to make two nettle tea. Make sure at least one redberry pie doesn’t burn (if you were not unlucky earlier in Step 20 you may have spare redberries/pie ingredients, all you need is one redberry pie). *Leave one redberry in the bank.\\* Run to the Al-Kharid gate and kill 20 goblins for their bones (attack training with your rune shortsword recommended) and the Goblin skull. If you get a bronze spear, keep it. Kill three cows or cow calfs for the bones and cowhides. Bank them at castle wars.",
        "meta": {
          "gp_stack": "726537 gp",
          "items_needed": "815 gp, air runes, earth runes, law runes, silver bar, 2 gold bars (Digsite reward), eye of newt, greenman’s ale, rotten tomato, fruit blast, ashes, rune sword",
          "skillsquests_met": "yes",
          "total_time": "5d13h"
        }
      },
      {
        "number": 43,
        "content": "House teleport, fill a bucket at the well, start The Fremennik Trials with Manni, start working on getting his vote, continue with Olaf and get sent to collect a lyre \\- this is the **wiki order**, not the RuneLite plugin order. Regrettably these are not the same. Continue questing for Olaf’s vote up to the step where you cut a branch from the swaying tree (**YOU DO NOT NEED 40 CRAFTING**). Chop some oak logs and burn them for the diary and kill the unicorn for the unicorn bone and horn as you pass it, start and continue Mountain Daughter until you have spoken to Svidi, house teleport and speak to Askeladden (Fremmy Trials) and Brundt (Mountain Daughter), get the golden fleece (Fremmy Trials) and get half a rock (Mountain Daughter), continue Mountain Daughter until you need to get the white pearl seed, run back out of the camp and do The Giant Dwarf (right-click open the Stonemason’s shop at the start for the diary) to the step where you need to visit Thurgo. Steal from the crafting or baker’s stall, and then from the gem stall, for the diary. While in Keldagrim, buy a rune pickaxe from the store in the eastern section. 1. Optional: also buy an adamant pickaxe if you are not planning on tick manipulating your sandstone mining, or if you want to f2p 2t Shooting Stars.",
        "meta": {
          "gp_stack": "675321 gp",
          "items_needed": "51012 gp, air runes, earth staff, law runes, 1 coal, 1 log, tinderbox, steel axe, 3 cut sapphires, rope, 1 plank, bronze pickaxe, empty bucket, beer, knife, rune sword, leather gloves, staff of fire, mind runes",
          "skillsquests_met": "yes",
          "total_time": "5d14h"
        }
      },
      {
        "number": 44,
        "content": "Teleport to Falador and pay Emily in the Rising Sun Inn to progress RFD/Dwarf, continue the barcrawl and speak to Burntof for Below Ice Mountain while you’re here. Pickpocket a guard for the diary. Move your POH to Taverley at the estate agent. Buy 8 woad leaves from Wyson the gardener (offer to pay 20gp to get two at a time). You should have at least 3,170 Herblore experience by now (level 17\\) – if not bankstand some herblore with Wintertodt herbs. Complete a lap of the Falador rooftop course for the diary. Make sure you are wearing leather gloves and collect all items in advance for the next steps, and that you have at least 12 empty inventory spaces.",
        "meta": {
          "gp_stack": "670171 gp",
          "items_needed": "5334 gp, 4 Asgarnian ales, water staff, air runes, law runes, barcrawl card",
          "skillsquests_met": "yes",
          "total_time": "5d14h"
        }
      },
      {
        "number": 45,
        "content": "Use your necklace of passage to Eagle’s Eyrie, catch a golden warbler (bird snare), get the phoenix feather, mine (and keep, do not drop) six clay and complete The Golem. Make sure to collect the gems as mentioned on the wiki.",
        "meta": {
          "gp_stack": "670171 gp",
          "items_needed": "necklace of passage, bronze/adamant pickaxe, bird snare, statuette, papyrus, strange implement, phoenix feather, chisel, hammer, 1 black mushroom, pestle/mortar, vial (should get your vial back after emptying the chemical compound during Dig Site)",
          "skillsquests_met": "yes",
          "total_time": "5d14h"
        }
      },
      {
        "number": 46,
        "content": "Teleport to your POH (bank in between, for example with Ferox minigame teleport or games necklace, if you don’t have enough inv space/don’t have all the items on you), collect the white pear for Mountain Daughter, teleport again, enter the dwarven tunnel under White Wolf Mountain, collect two rock cakes from An old dwarf (Rohak, make sure you complete the dialogue or you’ll have to get new asgoldian ales). Teleport a third time, speak with the Lady of the Lake for Merlin’s Crystal, chop and burn some willow logs for the diary, go to Doric and smith Blurite limbs on his anvil, run north and telegrab a wine of zamorak for the diary, run to the Goblin Village and continue RFD/Goblin to get a Slop of compromise.",
        "meta": {
          "gp_stack": "670151 gp",
          "items_needed": "air runes, earth staff, law runes, 2 eggs, 2 pots of flour, 2 buckets of milk, 2 bowls of water, steel axe, tinderbox, hammer, bread, 1 orange, knife, purple dye, spice, 1 bucket of water, charcoal, 1 fishing bait (from Step 9\\!), 1 blurite bar, 4 asgoldian ales, 200 gp",
          "skillsquests_met": "yes",
          "total_time": "5d15h"
        }
      },
      {
        "number": 47,
        "content": "Teleport to Ferox Enclave with a ring of dueling (already equipped), make 6 soft clay in the bank (leave in bank), grab a necklace of passage (equip), research notes (Rune Mysteries), a steel axe, a rune shortsword (equip) and fill your inventory with bones (make sure to leave one in the bank). Use your necklace of passage to teleport to the Wizards’ Tower. Give the bones to Wizard Traiborn, kill the chicken in the basement for the rest of the bones (if needed) and obtain the key for Demon Slayer. Complete Rune Mysteries, have Wizard Sedridor teleport you to the rune essence mine. Run to Draynor Village, start the Lost City quest (until you have to go to Entrana) and continue Prince Ali Rescue until you have the key imprint (rebank at Draynor). Have Aggie make you four blue dyes (you can use the woad leaves on Aggie to skip the dialogue). Pickpocket Martin the Master Gardener for the diary.",
        "meta": {
          "gp_stack": "670151 gp",
          "items_needed": "ring of dueling, necklace of passage, notes, adamant/bronze pickaxe, 25 bones, steel axe, 3 balls of wool, 1 rope, 1 yellow dye, 1 redberries, 1 ashes, 1 bucket of water, 1 soft clay, 8 woad leaves, steel axe",
          "skillsquests_met": "yes",
          "total_time": "5d15h"
        }
      },
      {
        "number": 48,
        "content": "Grab 15 compostable items, fill the bin at the Falador patch. Run to Port Sarim, claim your previously destroyed XP lamps from Veos (one in Port Sarim, one in Piscarillius\\!) and put them all on Herblore (level 20). Give the bread to the beggar at the jewellery shop (Merlin’s Crystal). Visit Thurgo and complete The Giant Dwarf (if you get a bars task you can’t do you can refuse it by clicking out of the dialogue and logging out and back in, at the risk of having to go back to the secretary. You can join any consortium you prefer though the Purple Pewter is more efficient if you have full HAM robes \\- the ones on the east side tend to be fastest to buy ores at the blast furnace). Use the Blast Furnace (costs 2500 gp per 10 minutes) or Superheat Item to make the bars where needed. It is probably best to use the Blast furnace for larger tasks and Superheat for smaller tasks. Start Forgettable Tale… and get a kelda seed from the drunken dwarf. Find out what random item is required for another one (Rowdy Dwarf in the Laughing Miner pub). Figure out how to obtain the item and weave it into the steps below if you wish. Take the train cart to the pub under the White Wolf Mountain and get (the second) kelda seed from Khorvak. 1. All items should be easy to obtain, although it may be smart to reroll the item (by going through the dialogue again after a few minutes) if you roll a steel dart, anchovy pizza or vampyre dust. 2. If you wear full HAM robes and join the Purple Pewter you get to skip one task, making this the most efficient consortium to join. Furthermore, if you complete three ore tasks and then ask for another one you will get a bars task, but if you prefer you can instead go for another ores task by unequipping the outfit.",
        "meta": {
          "gp_stack": "645048 gp",
          "items_needed": "25103 gp, dwarven battleaxe, exquisite clothes, exquisite boots, 1 bread, various ores/bars (bought with the gp), 1 redberry pie, 1 iron bar, 2 beers (buy), dwarven stout. _If you get asked for a bar that you cannot smith you can reset them. If you do this too often you will be sent back for more ore tasks, but it is still the fastest way of progressing this quest._",
          "skillsquests_met": "yes",
          "total_time": "5d16h"
        }
      },
      {
        "number": 49,
        "content": "Teleport to the Ferox Enclave (minigame teleport), run south to the Mage of Zamorak and start Enter the Abyss. Teleport to Varrock, complete Demon Slayer (you can use magic for the fight as long as you equip silverlight as a weapon, but melee is fine as well). Give a dog a bone. Speak with the Mage of Zamorak to obtain the scrying orb and progress Enter the Abyss. Have Aubury teleport you to the Rune Essence mine with your scrying orb (first scrying orb charge), check the Zamorakian temple’s altar for the inscription (Merlin’s Crystal). Buy a studded body, studded chaps, iron chainbody, two steel chainbodies, a steel platebody and a mithril platebody from Horvik, make 7 bronze wires at Horvik’s anvils, buy an oak longbow and a willow shortbow from Lowe (optionally also buy 200 mithril arrows), move your POH to Pollnivneach at the estate agent, visit the museum and collect the XP lamp from Historian Minas, put them on herblore. You now have 103 kudos. Grab the information clerk xp bonuses, start Bone Voyage.",
        "meta": {
          "gp_stack": "615270 gp",
          "items_needed": "17010 gp, Demon Slayer keys, scrying orb, 7 bronze bars, hammer",
          "skillsquests_met": "yes",
          "total_time": "5d16h"
        }
      },
      {
        "number": 50,
        "content": "Use your ring of dueling to teleport to Al-Kharid, speak with the gem trader and Avan for Family Crest, mine iron ore in the Al-kharid mine for the diary , get the key for Prince Ali Rescue from Osman. Do a lap of the agility course, rebank to grab quest items, then run south and fish some anchovies south of the bank for the diary, then start The Shadow of the Storm until you have the sigil mould and tome (take the carpet to Uzer the first time for a diary step) using your necklace of passage when convenient.",
        "meta": {
          "gp_stack": "615070 gp",
          "items_needed": "200 gp, addy pickaxe, bronze bar, small fishing net, Silverlight, 1 black mushroom, empty vial, pestle and mortar, black wizard hat, black priest gown top/bottom, necklace of passage, key print",
          "skillsquests_met": "yes",
          "total_time": "5d17h"
        }
      },
      {
        "number": 51,
        "content": "You should have level 46 fletching by now from your steel arrows. Use your dueling ring to bank in Ferox (keep equipped), grab your desert clothes, pickaxe, teak logs, knife, house teleport runes, GP, 1600 noted buckets and 5 waterskins. Teleport to your house, run to the quarry, deposit your buckets and mine sandstone to level 43 mining. Buy 1600 buckets of sand (but not the rest) from the grinder. 1. [Setting up gravestone with waterskins for low-level sandstone mining](https://www.youtube.com/watch?v=rb5BKbVXuBo) shows how to use a gravestone method to have access to more waterskins during mining. By keeping the gravestone interface open the timer doesn’t run down. This method shouldn’t be necessary for just 1600 sand though. 2. [3 tick sandstone mining at new spot (easier method)](https://www.youtube.com/watch?v=hPQ-6aZdydI)this is the modern spot for sandstone mining, [Lazy 3t4s test](https://www.youtube.com/watch?v=ezql5TmeCCg)shows an example.",
        "meta": {
          "gp_stack": "535070 gp",
          "items_needed": "80000 gp, 1 air/earth rune, 1 law rune, 1 knife, 1 teak log, addy/bronze pickaxe, desert clothes",
          "skillsquests_met": "yes",
          "total_time": "5d18h"
        }
      },
      {
        "number": 52,
        "content": "Dueling ring teleport to Ferox, take the portal to Soul Wars, then to Edgeville. Give the steak sandwich to Marley to progress Below Ice Mountain. Speak with Oziach to progress Dragon Slayer I. Make 1600 molten glass at the furnace. Cut all your sapphires, emeralds and rubies. Make all minus one of your gold bars into digsite pendants. Make two fishbowls. 1. Some quests further down the line require molten glass or glassblowing items, so don’t turn all 1600 glass into orbs even if a future step mistakenly says so. Just keep \\~20 glass in the back pocket just in case and ignore the differences.",
        "meta": {
          "gp_stack": "535070 gp",
          "items_needed": "1600 soda ash, 1600 buckets of sand, chisel, uncut sapphires/emeralds/rubies, matching gold bars for the gems, glassblowing pipe",
          "skillsquests_met": "yes",
          "total_time": "5d20h"
        }
      },
      {
        "number": 53,
        "content": "Grab a digsite pendant (equip), rune sword (equip), a staff of air, chaos runes, a bucket and an inventory of pure essence. Use the digsite pendant to teleport to the digsite, run to the Paterdomus Temple and continue Priest in Peril until you are asked to hand over the pure essence. Teleport to the digsite, run south and start Elemental Workshop II. Teleport with the pendant again, continue Bone Voyage to the step where you need to visit the Woodcutting guild. Teleport to Ferox, bank (bank chaos runes, rune sword, food, grab ghostspeak amulet, spade, law runes), grab 25 pure essence and return to Drezel, repeat this for a second inventory to complete Priest in Peril. Start the Nature Spirit quest.",
        "meta": {
          "gp_stack": "535070 gp",
          "items_needed": "1 digsite pendant, air staff, empty bucket, chaos runes, 50 pure essence, ghostspeak amulet, spade, law runes",
          "skillsquests_met": "yes",
          "total_time": "5d20h"
        }
      },
      {
        "number": 54,
        "content": "Enter Morytania. Do the Creature of Fenkenstrain up to the step where you need to visit a furnace, chopping a hollow tree for bark along the way. Grab 15 compostable items, fill the bin at the Morytania patch along the way. Buy 7 raw chickens and a raw shark. Rebank. Do the Nature Spirit and Shades of Mort’ton (when you need to make the oil hop the official world, 377\\. It is recommended to do the rest of the quest on other worlds to avoid raggers) quests (make sure you have all the items on you for the last two before heading into the swamp, and take your best food in the rest of your inventory) and restoring your prayer at the end of Nature Spirit for the diary. Buy 13 planks from Razmire.",
        "meta": {
          "gp_stack": "529829 gp",
          "items_needed": "5241 gp (set aside 5k for Shades of Mort’ton materials, let’s say), ghostspeak amulet, spade, law runes (telegrab), needle, 5 thread, silver bar, hammer, rune sword, druid pouch, 2 vials of water, steel axe, tinderbox, 2 ashes, 3 bronze wires, salmon",
          "skillsquests_met": "yes",
          "total_time": "5d21h"
        }
      },
      {
        "number": 55,
        "content": "Teleport to Camelot, complete Merlin’s Crystal (black candle, bat bones, Excalibur) and start Holy Grail up to the step you need to visit Entrana. Run to Seers, play the church organ (diary), spin your golden fleece on the spinning wheel, pay the estate agent to move your POH to Kourend, do the Elemental Workshop II quest, make a mind helmet for the diary, talk to the Poison Salesman to continue Fremmy Trials. Buy 10 stews for later (also completes a diary task), speak with the bartender to progress the barcrawl. 1. Optional: make a mind shield if you want one (clue item).",
        "meta": {
          "gp_stack": "520861 gp",
          "items_needed": "8968 gp, black candle, bat bones, Excalibur, golden fleece, rune pickaxe, hammer, 8(/12) coal, battered key, slashed book (for mind shield), 2/3 elemental bars (from Step 40), barcrawl card",
          "skillsquests_met": "yes",
          "total_time": "5d22h"
        }
      },
      {
        "number": 56,
        "content": "Teleport to your POH, enter your house for the diary step. Start The Depths of Despair to the step where you are sent to Galana. Grab 20 mahogany logs. Run to the Woodcutting Guild, continue Bone Voyage. Use your Digsite pendant to teleport to the digsite, continue Bone Voyage until you need to go to Port Sarim. Make all mahogany logs into planks at once for the diary.",
        "meta": {
          "gp_stack": "490861 gp",
          "items_needed": "30000 gp, air runes, earth staff, law runes, digsite pendant, sawmill agreement, 20 mahogany logs",
          "skillsquests_met": "yes",
          "total_time": "5d22h"
        }
      },
      {
        "number": 57,
        "content": "Fishing Trawler minigame teleport to Port Khazard and make a fishcake for RFD/Pirate (take food with you underwater). Grab a knife, charter a ship to Musa Point, visit the Karamja Spirits Bar for the barcrawl. Then take the ship to Port Sarim, speak with Jack Seagull in the Rusty Anchor Inn to progress Bone Voyage. Continue the barcrawl as well. Take the boat to Entrana (bank everything besides runes/knife at Port Sarim), speak with the High Priest to progress Holy Grail, enter the tunnel and collect several dramen branches for Lost City. As many as can fit in your inventory; do NOT convert them just yet. 1. Optional: grab a banana from the bank before going to Musa Point, buy a karamjan rum, slice the banana and use the slices on the rum. Then minigame teleport to Pest Control or Port Khazard to bank the karamjan rum (sliced banana) instead of taking the ship to Port Sarim, then take a ship and resume the step as stated.",
        "meta": {
          "gp_stack": "489246 gp",
          "items_needed": "1615 gp, barcrawl card, 2 raw cods, pestle/mortar, bread, knife, empty fishbowl, 3 bronze wires, needle, chaos runes (for Crumble Undead), earth runes, air runes, trout/salmon",
          "skillsquests_met": "yes",
          "total_time": "5d22h"
        }
      }
    ]
  },
  {
    "id": "2.1",
    "title": "Quests and combat, unlock Miscellania",
    "totalTime": "9d9h",
    "steps": [
      {
        "number": 1,
        "content": "Bring orbs with you to the Wizards’ Guild in Yanille, buy, make, and alch the staves in the shop while hopping and buying nature runes (50 per world until you have 500). Boost with a Wizard’s mind bomb to get in. Use your mushroom pies for this as needed for the first levels. Buy another inv of staves and make and alch them in the bank. Repeat the whole process a second time. This brings the cash stack up to \\~162k (bring \\~24 orbs, buy+alch everything slowly, then buy out another 26 staves and attach+alch in bank, repeat). After this buy staves with your entire cash stack, banking them.",
        "meta": {
          "gp_stack": "162k gp",
          "items_needed": "cash stack, 100 earth orbs,",
          "skillsquests_met": "yes",
          "total_time": "9d10h"
        }
      },
      {
        "number": 2,
        "content": "Run artefacts in Piscarillius while attaching the staves to the orbs and alching them while running, using your Kharedst’s memoirs for transportation and dueling rings to Ferox Enclave to bank and/or restore run energy as needed. Repeat this process of buying staves in Yanille, attaching and alching orbs while running artefacts until all 1590 have been processed. Also buy 500 law runes and 500 soul runes (50 per world) in Yanille in between buying battlestaves. Grab coins, a rope, antipoison, barcrawl card, 15 oak logs, digsite teleport and run to the sawmill, make them into planks and buy 1 iron and 300 steel nails (if you have spares from Tempoross you can skip those items) as well as five bolts of cloth. Head to the Jolly Boar Inn, complete the barcrawl and speak with the third brother for Family Crest. Games’ necklace teleport to the barbarian outpost, show the barcrawl card to the Barbarian Guard to complete the barcrawl. Toggle vial smashing. Teleport to your POH and buy two bedrooms, then build a bed in each (Oak or Wooden is fine). Next buy a dining room and build a rope bell-pull. Teleport to Ardougne, pay the estate agent to swap your POH location to Rimmington, then hire the highest tier servant possible at the Servant’s Guild \\- Cook for levels 39 and below, Butler for levels 40 and up (you shouldn’t be level 50+ construction yet but if you are: good for you, and hire the Demon Butler). 1. _You will need a grown cat at a future point, so if you do not have one make sure to grow one during this step and the following ones._",
        "meta": {
          "gp_stack": "3m gp",
          "items_needed": "Kharedst’s memoirs, 300k gp (obtained during the step), rings of dueling, earth orbs, battlestaves (obtained during the step), rope, antipoison, barcrawl card, 15 oak logs, digsite pendant, games necklace",
          "skillsquests_met": "yes",
          "total_time": "9d17h"
        }
      },
      {
        "number": 3,
        "content": "Train construction to level 50 using oak logs at the Rimmington portal. Method: [https://www.youtube.com/watch?v=GFH6-oJrJ0o](https://www.youtube.com/watch?v=GFH6-oJrJ0o) should be \\~1200 oak planks for 38-50 Construction, 60 xp per plank. Don’t wait for the servant to come back, this method will bank the planks (if your POH instance is closed while your servant returns the planks will go straight to your bank) and you can use them from the bank later (have the servant grab the planks from the bank for you while you stay in the POH), for example with oak larders. Buy a study and swap your servant for the Demon Butler (in Ardougne). If you started below level 40 it is worth upgrading the Cook to the Butler at level 40 (by revisiting the Servant’s Guild in Ardougne). Buy a Menagerie and build a house (oak or teak) so you can keep a cat for questing in your POH while raising kittens without worry. 1. Leave the final set of larders in the house. Also build a fancy range, oak shelves 2 and a pump and drain (requires 13 steel bars, 3 oak planks and 6 soft clay).",
        "meta": {
          "gp_stack": "2.66m gp",
          "items_needed": "cash stack, knife, teak log, rune axe, saw, hammer, forestry kit",
          "skillsquests_met": "yes",
          "total_time": "9d17h"
        }
      },
      {
        "number": 4,
        "content": "If you have (at least) two grown teak trees on Fossil Island, use the butler method to chop and make 1100 teak planks (example video of 2 tick teaks with butler plankmake: [https://www.youtube.com/watch?v=GA987x97AKQ](https://www.youtube.com/watch?v=GA987x97AKQ)) using digsite pendants instead of a mounted digsite and dueling rings to bank for more necklaces and/or run energy as necessary (alternatively you can grab a necklace from the museum camp bank chest on Fossil Island after it breaks). Note that you have to take the long way (east) instead of the shortcut to the trees. 1. If your teak trees haven’t grown yet keep going with the guide and do this step and the next one when they are fully grown. 2. In case the video is confusing: after teleporting to your POH you send the butler to the sawmill with your logs, then teleport to the digsite using a digsite pendant (it is better to use a mounted digsite pendant but you don’t have one) and run back to the trees. 3. You can use 1.5t teaks instead, a faster alternative: [1.5 t teak planks](https://youtu.be/A2dgu4ThJbE). 4. After this step it is recommended to have the teak trees cut down (200gp each) and use the patches for farming xp, growing mahogany/teak trees on cooldown. This is the best farming xp in the game.",
        "meta": {
          "gp_stack": "2.05m gp",
          "items_needed": "cash stack, knife, teak log, rune axe, saw, hammer",
          "skillsquests_met": "yes",
          "total_time": "9d20h"
        }
      },
      {
        "number": 5,
        "content": "Teleport to Camelot, collect the Kandarin easy diary and put the lamp on herblore. Teleport to Lumbridge, collect the Lumbridge & Draynor easy diary and put the lamp on herblore. Run to Draynor, recruit Ned for Dragon Slayer I, buy 100 chronicle teleport cards, bring a (any for 1.5t, adamant for 2t, rune if lazy) pickaxe and continue Dragon Slayer I to get to Crandor. Kill Moss Giants for Rag and Bone Man II. While on Crandor, make sure to go back up the rope to Crandor, kill Elvarg, and unlock the hidden wall door and for two Karamja medium diary steps. Keep running and enter the Fight Cave, then leave immediately. Head to Oziach in Edgeville with the standard Clan Wars minigame teleport method and complete Dragon Slayer I. Buy a green d’hide body.",
        "meta": {
          "gp_stack": "2.01m gp",
          "items_needed": "cash stack, Crandor map, rune sword, anti-dragon shield, swordfish, prayer potions (make at bank if you haven’t already), ring of recoil (optional), teak logs \\+ knife (optional)",
          "skillsquests_met": "yes",
          "total_time": "9d21h"
        }
      },
      {
        "number": 6,
        "content": "Teleport to Falador, pay the estate agent to move your POH to Hosidius. Use Teak Homes (Mahogany Homes with Teak planks, Adept tier contracts only) for 352 carpenter points (88 completed contracts) while on the regular spellbook for transportation. Accept the cups of tea after contracts to restore run energy as necessary. Buy the plank sack. If you have excess logs (from wintertodt) cut them into arrow shafts as you run and make headless arrows (purchase feathers as necessary, you should have plenty from bird runs).",
        "meta": {
          "gp_stack": "2.0m gp",
          "skillsquests_met": "yes",
          "total_time": "9d23h"
        }
      },
      {
        "number": 7,
        "content": "Teleport to Ardougne, pay the estate agent to move your POH to Rellekka. Do Underground Pass, upgrade your Iban’s staff at the Dark Mage in West Ardougne. After the quest grab a ring of visibility and ghostspeak amulet 1. At this point you only need a mithril grapple for completing the Ardougne medium diary (along with several other diaries down the road). If you want to finish these to get access to the perks you can kill barbarian spirits for one, although it is not recommended. We smith grapples naturally on step 73 of this chapter.",
        "meta": {
          "gp_stack": "1.8m gp",
          "items_needed": "200k gp, 2 ropes, yew longbow, 10 steel arrows, spade, food (swordfish?), rune sword, energy pots if you have them, wind strike/bolt runes, prayer potion",
          "skillsquests_met": "yes",
          "total_time": "10d1h"
        }
      },
      {
        "number": 8,
        "content": "POH teleport and exit the house, head east and enter the Keldagrim mine and start Between a Rock… at Dondakan (bring gp for the ferry). Continue until the step where you talk to Rolad, buy a gold leaf at the stonemason. Buy 5 silk at the clothes stall.",
        "meta": {
          "gp_stack": "1.7m gp",
          "skillsquests_met": "yes",
          "total_time": "10d1h"
        }
      },
      {
        "number": 9,
        "content": "Mine 112 soft clay in the Varrock West mine, using the chronicle to get there, rings of dueling to bank and bracelets of clay. Teleport to your POH and make tea in a porcelain cup for a \\+2 construction boost, use the boost and crystal saw to build a Mahogany eagle lectern in your POH. Make up to 106 teleport to house tablets, having your butler bring you soft clay from the bank while you stand at the lectern. Make sure to leave two soft clay in the bank. 1. From now on you have access to POH tabs for (Arceuus) herb and tree runs. If you ever run out you can repeat this step to make more (although it is slightly better to use the humidify spell rather than soft clay bracelets, mining regular clay instead). 2. Redirection scrolls add a lot of utility to POH tabs, we will collect a number of these on a future step.",
        "meta": {
          "gp_stack": "1.7m gp",
          "skillsquests_met": "yes",
          "total_time": "10d1h"
        }
      },
      {
        "number": 10,
        "content": "Take a damaging spell (staff \\+ runes, fire bolt works great) from the bank, along with your trollweiss (flower), trollheim teleport runes, food, prayer potions, a rune sword, any pickaxe and a games necklace. Teleport to Trollheim, complete Troll Romance. Chronicle teleport, run to Rolad at the dwarf camp at Ice Mountain and progress Between a Rock… until you have read Dwarven lore, buy an ammo mould.",
        "meta": {
          "gp_stack": "1.7m gp",
          "items_needed": "cash stack, chaos runes, air runes, law runes, fire staff, trollweis, rune sword, rune pickaxe, games necklace, law runes, swordfish, prayer potions",
          "skillsquests_met": "yes",
          "total_time": "10d1h"
        }
      },
      {
        "number": 11,
        "content": "Go to Burthorpe and start Heroes’ Quest, collect the ice gloves by killing the Ice Queen under White Wolf Mountain, killing Ice Giants along the way for Rag and Bone Man II.",
        "meta": {
          "gp_stack": "1.7m gp",
          "items_needed": "chaos runes, air runes, water staff, law runes, swordfish, prayer potions, games necklace",
          "skillsquests_met": "yes",
          "total_time": "10d2h"
        }
      },
      {
        "number": 12,
        "content": "Teleport to Falador, deposit everything in the bank, and complete Black Knights’ Fortress (only cashing the reward left), do all of Recruitment Drive, set your spawn point to Falador, rebank, buy full initiate. Also buy your celestial ring now. Start Wanted\\! and continue it until you have to go to Taverley dungeon.",
        "meta": {
          "gp_stack": "1.6m gp",
          "items_needed": "cash stack, air runes, water staff, law runes, 2k stardust, full initiate, 1 molten glass, 1 enchanted gem",
          "skillsquests_met": "yes",
          "total_time": "10d2h"
        }
      },
      {
        "number": 13,
        "content": "Do Shilo Village (if you have rogue kits they can help save inventory space during this quest). While in Shilo Village mine (and successfully cut) a jade and three red topazes (you can tick manipulate this to speed it up), plus enough gems (including to sell) to exchange for a machete at Safta Doc (300 trading sticks \\+ 3 opals). It’s worth considering getting a few extra in case all your gems for One Small Favour break. Buy four inventories of cooked karambwans from Alfonse the waiter in The Shrimp and Parrot (Brimhaven restaurant), banking in Shilo using the Hajedy & Vigroy cart system (right click to travel, going through dialogue is cheaper but not worth the time). 1. Optional: if you want you can also buy lobsters and swordfish for some low level food, since most of the time is spent hopping anyway. This will double/triple the number of inventories of food you’re grabbing. Buying tuna and lower tier fish is not worth it \\- premade gnome food is better in every way.",
        "meta": {
          "gp_stack": "1.6m gp",
          "items_needed": "spade, lit candle, rope, bronze wire, chisel, rune sword, swordfish, prayer potions, energy potions, dramen staff, Crumble Undead runes, 4 rogue kits (optional), rune pickaxe, gout tuber",
          "skillsquests_met": "yes",
          "total_time": "10d3h"
        }
      },
      {
        "number": 14,
        "content": "Start One Small Favour and continue it up to the step with Captain Shanks. Next, to get to Brian, take the Lady of the Waves to Port Khazard (for a diary task) then charter to Port Sarim and speak with Brian, completing that step of the quest. Go to Entrana, grab the fire feather, return to Port Sarim and collect the snail oil for Heroes’ Quest.",
        "meta": {
          "gp_stack": "1.6m gp",
          "items_needed": "1330 gp, ice gloves",
          "skillsquests_met": "yes",
          "total_time": "10d3h"
        }
      },
      {
        "number": 15,
        "content": "Go to Draynor to rebank, grab a harralander and turn the blamish snail slime into blamish snail oil, add it to a fishing rod to make an oily rod. Speak with Aggie to continue One Small Favour. Enter the HAM hideout, speak with Johannes Ulsbrecht to continue One Small favour, then pickpocket HAM members until you have two sets of HAM robes (you may already have some in the bank) and polished buttons (if you got polished buttons earlier you don’t need another one). Speak with Fred the Farmer for One Small Favour, use a sack on the hay to get a sack of hay, make a necklace of passage, then *s*peak with Seth Groats to continue One Small Favour.",
        "meta": {
          "gp_stack": "1.6m gp",
          "items_needed": "blamish snail slime, harralander, vial of water, fishing rod, lockpick, jade, necklace mould, silver bar, air runes, cosmic rune, swordfish/cake/wines, pure essence, empty sack",
          "skillsquests_met": "yes",
          "total_time": "10d4h"
        }
      },
      {
        "number": 16,
        "content": "Run (or teleport) to Lumbridge. Start RFD/Evil Dave. Buy six buckets of milk, a pot of cream, two eggs, two pots of flour, five cheese, make two bowls of water and continue and complete Death to the Dorgeshuun (and light your mining helmet in the cellar for the diary along the way). Get a bullseye lantern (Dorgesh-kaan average chest), pickpocket a Dorgesh-kaan rich chest for the diary. _Note: this requires 78 thieving._",
        "meta": {
          "gp_stack": "1.6m gp",
          "items_needed": "both HAM robe sets, games necklace, lockpick, light source, rune sword, swordfish, tinderbox, mining helmet",
          "skillsquests_met": "yes",
          "total_time": "10d5h"
        }
      },
      {
        "number": 17,
        "content": "Do Another Slice of H.A.M., doing the Tears of Guthix quest (don’t participate in the minigame yet) while in the Lumbridge Swamp Cave. Buy two moving-over-distance spheres from Oldak (2 noted molten glass and 4 law runes). Kill Cave Goblins for Rag and Bone Man II. Take the train to Keldagrim for the diary. Use a gold bar (or ore) on Dondakan to progress Between a Rock.…",
        "meta": {
          "gp_stack": "1.6m gp",
          "items_needed": "cash stack, bullseye lantern, lantern lens, cut sapphire, chisel, tinderbox, rune pickaxe, wind bolt spells (wind staff, chaos runes), molten glass, law runes, gold bar, swordfish, energy potions, prayer potions, dueling ring, dwarven lore",
          "skillsquests_met": "yes",
          "total_time": "10d5h"
        }
      },
      {
        "number": 18,
        "content": "Teleport to Varrock, ask the Apothecary to make you a strength potion for the diary (requires a limpwurt root, red spider’s eggs and 5gp). Collect the Varrock easy and medium diary rewards, putting the lamps on herblore. Go to the Mage of Zamorak, show him the eye amulet and continue Temple of the Eye until you have the abyssal incantation. Dueling ring to Al-Kharid, give the incantation to Persten and resume and complete the Temple of the Eye. Games necklace teleport to Tears of Guthix, complete the minigame. From now on visit the minigame weekly, the XP isn’t too important but it’s efficient to grab it for slayer or herblore (either is fine). Make sure to get at least 100 tears in one go at a certain point for the diary. Dueling ring to Al-Kharid, buy two steel platelegs, smith a golden cannonball and two topaz rings in the furnace and enchant them into Efaritay’s aid rings at your convenience. Buy a kebab if you don’t have any, take the boat to the Ruins of Unkah. Mine sandstone, ideally with 4s,[3 tick sandstone mining at new spot (easier method)](https://www.youtube.com/watch?v=hPQ-6aZdydI), the modern method [Binxy4SandstoneSpot.png](https://drive.google.com/file/d/1En18zEdCPsmMSDFu70dPfa8TMR6X2hYd/view?usp=sharing) at this south spot shown by Binxy, until you are 10k xp away from level 60 mining (you don’t have to buy any sand for this. Feel free to get the level instead, if you want). Buy the ancient staff from Eblis. Once done, head south (rebank at the Ruins of Unkah if needed), kill Jackals and Vultures for Rag and Bone Man II and desert diary. Do Enakhra’s Lament. 1. [https://www.youtube.com/watch?v=KwLJm_Zu0ro](https://www.youtube.com/watch?v=KwLJm_Zu0ro) by **5th hcim LUL** shows how to do 3s1g \\- an older high xp tick manipulation sandstone mining method that does not require stamina potions, increasing mining xp/hr but getting less sand. 2. You can also do Enakhra’s Lament _before_ mining the sandstone, so you can refill your pouches at the fountain inside the temple (camulet teleport). This is faster and also gives you a good opportunity to do hourlies. Keep in mind you now have to go to 3k xp from level 60 with mining sandstone. 3. [https://www.youtube.com/watch?v=rb5BKbVXuBo](https://www.youtube.com/watch?v=rb5BKbVXuBo) shows how to use a gravestone method to have access to more waterskins during mining. By keeping the gravestone interface open the timer doesn’t run down. 4. [3 tick sandstone mining at new spot (easier method)](https://www.youtube.com/watch?v=hPQ-6aZdydI)shows the 3t4s method (also linked above). 5. Optional and recommended (but not assumed in the detailed XP sheet): mine 25k sand total for good low level mining xp, leaving the sand in the grinder. This gets you well past 60 mining. 6. Now that you are level 60 mining you can solo the lowest level shooting stars that fell. One option to find one is to hop worlds, especially f2p worlds, on a location where the stars might fall. [20220129_09-16-40CrandorTilesSeeingBothFallenStars.png](https://drive.google.com/file/d/1cWWMwFOprdByinP_a_6JsqkTinnhtv_D/view)on Crandor is such a spot. Alternatively, use [https://osrsportal.com/shooting-stars-tracker](https://osrsportal.com/shooting-stars-tracker) to find a convenient one. The celestial ring is worth collecting. You can 1.5t or 2t the stars, use an adamant pickaxe for convenience.",
        "meta": {
          "gp_stack": "1.5m gp",
          "items_needed": "cash stack, gold bar, ammo mould, rune sword, swordfish, waterskins, rune pickaxe, chisel, bread/cake, tinderbox, candle, regular log, oak log, willow log, maple log, soft clay, coal, Crumble Undead runes, air staff, fire runes, chaos runes, energy potions, bucket of water, celestial ring, varrock body 2",
          "skillsquests_met": "yes",
          "total_time": "10d9h"
        }
      },
      {
        "number": 19,
        "content": "Run into Nardah, kill a goat northwest of the town for the horn (and grind it to dust), burn some yew logs on the mayor’s balcony for the diary, have Zahur clean a herb for you, buy rune platelegs (or a plateskirt) at Seddu’s Adventurer’s Store. Bank, do Spirits of the Elid (use your necklace of passage to Eagle’s Eyrie to save some time). On the run back south to Nardah catch an orange salamander, make a combat potion and cut open a cactus to fill a waterskin. Visit the genie and pray at the statue after the quest for the diary.",
        "meta": {
          "gp_stack": "1.5m gp",
          "items_needed": "cash stack, rune sword, swordfish, waterskins, grimy harralander, vial of water, pestle+mortar, necklace of passage, small fishing net, rope, law runes, air staff, light source, knife, rune pickaxe, yew longbow, steel arrows, needle, 2 thread, desert clothing, prayer potions",
          "skillsquests_met": "yes",
          "total_time": "10d10h"
        }
      },
      {
        "number": 20,
        "content": "Start and complete Icthlarin’s Little Helper, taking a light source, antipoison and tinderbox with you as well as all Icthlarin’s quest items. After completing the quest enter Pyramid Plunder for the diary and collect at least one artefact (any will do, e.g. stone scarab), then open a sarcophagus. Do Contact\\! up to the step you need to visit Osman. Make sure to carry some teleport jewellery. Teleport to Thormac in the Sorcerer’s Tower (fairy ring BLR is nearby, or run down from Camelot), start Scorpion Catcher. Teleport to Seers’ Village and speak with a seer to continue the quest.",
        "meta": {
          "gp_stack": "1.5m gp",
          "items_needed": "cash stack, kitten/cat, light source, tinderbox, bag of salt, willow log, bucket of sap, waterskins, energy potions, prayer potions, rune sword, swordfish, games necklace, antipoison, digsite pendant, barcrawl card, 10 oak logs, digsite teleport, 3500 gp.",
          "skillsquests_met": "yes",
          "total_time": "10d11h"
        }
      },
      {
        "number": 21,
        "content": "Go to Burthorpe and start A Tail of Two Cats to get the enchanted catspeak amulet. Rebank in Rogues’ Den, then pray at the Altar of Guthix (Taverley) while wearing full initiate, then multiquest Taverley Dungeon (lava eel for Heroes’ Quest, grab a scorpion for Scorpion Catcher, progress Wanted\\!, grab a dusty key and the damaged soulbearer, kill baby blue dragons for Rag and Bone Man II while inside, bank at least one set of bones, run on to Cerberus’ Lair to complete the Bear Your Soul miniquest). Kharedst’s teleport out to Lovakengj, run to the Castle and collect the Kourend Easy diary reward (lamp on herblore). Swap to the Arceuus spellbook and do hourlies if you haven’t recently. Salve teleport and complete Olaf’s Quest (fairy ring DKS). 1. While on the Arceuus spellbook make sure to maintain contracts, also grow cats if convenient. Also maintain bird runs, if you haven’t run out of decent logs yet. Only use **maple+** logs for bird runs (if you have the level, of course) 1. Make sure to preserve the following logs: one oak, two willow, one maple, one yew. 2. As mentioned in the [20220622FarmingGuide](https://docs.google.com/document/d/1rAnKmezSQmnqFOCti4RWze-kvMoW8i4Kyk5xswJ-9Qc/edit?usp=sharing), at some point fletch underwater to get seaweed spores, and it is highly recommended to have an Attas anima plant (boostable 76 farming requirement) up before starting seaweed runs. If you have this level start doing seaweed runs as an hourly as well. Doing a few for fun/casual runs is always fine, of course. You will only need up to 12.5k seaweed in total, although you may choose to deviate and collect more.",
        "meta": {
          "gp_stack": "1.5m gp",
          "items_needed": "kitten/cat, full initiate, catspeak amulet, 5 death runes, oily fishing rod, fishing bait, ice gloves, scorpion cage, rune sword, anti-dragon shield, swordfish, energy potions, prayer potions, Commorb, chronicle, dramen staff, necklace of passage, damaged soulbearer",
          "skillsquests_met": "yes",
          "total_time": "10d12h"
        }
      },
      {
        "number": 22,
        "content": "Chronicle teleport to Varrock, world hop at the anvils south of Varrock West bank to find Bob for A Tail of Two Cats. Go to Gertrude, continue A Tail of Two Cats and start Ratcatchers. Visit Reldo for A Tail of Two Cats, return to Bob for A Tail of Two Cats, go back to the castle and chop some yew logs behind the castle and burn them at the top of the church for the diary, then head into the sewers and continue Ratcatchers until you need to visit Jimmy Dazzler, also kill rats for Rag and Bone Man II.",
        "meta": {
          "gp_stack": "1.5m gp",
          "items_needed": "cat, catspeak amulet, rune axe, tinderbox, rune sword",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 23,
        "content": "Continue One Small Favour and Wanted\\! in Varrock. _Speak with your gang leader (Straven for Phoenix, Katrine for Black Arm) for Heroes quest._ Buy 11 furs from Baraek. Return to the west anvils and smith a steel longsword, 2 shortswords, 1 mace, 1 warhammer, 1 dagger, 2 med helms and 1 full helm. World hop to find Bob for A Tail of Two Cats.",
        "meta": {
          "gp_stack": "1.5m gp",
          "items_needed": "16 steel bars, hammer, Commorb, 20 pure essence, catspeak amulet, cat",
          "skillsquests_met": "yes",
          "total_time": "10d13h"
        }
      },
      {
        "number": 24,
        "content": "Complete Wanted\\! (this involves random transportation, good luck. Rebank as needed, e.g. at Canifis. Use the sphere for Dorgesh-Kaan, complete a lap of the Canifis Rooftop course, kill a werewolf in human form with the wolfbane dagger and several in wolf form (any weapon, you may choose to safespot them on a table in the pub) for Rag and Bone Man II, tan some green dragonhide at Sbott, kill a Banshee in the slayer tower and get a slayer task from Mazchna along the way, use the Respawn Point teleport to get back to Falador). Grab your ring of charos (a) along with the items for the quests below, teleport to Draynor Manor and do Ernest the Chicken. Start Animal Magnetism.",
        "meta": {
          "gp_stack": "1.5m gp",
          "items_needed": "cash stack, law runes, soul runes, earth runes, water runes, chronicle, commorb, Dorgesh-Kaan spheres, green dhide leather, rune sword, earmuffs, light source",
          "skillsquests_met": "yes",
          "total_time": "10d14h"
        }
      },
      {
        "number": 25,
        "content": "Fenkenstrain teleport, visit Alice and her husband for Animal Magnetism. Kill an experiment for Rag and Bone Man II, undead cows for Rag and Bone Man II, then undead chickens to get 8 bones total. When you need to visit the Old Crone, enter Port Phasmatys instead (grind 8 bones at the Ectofuntus grinder to get 40 ecto-tokens, also grind a silver bar) and start and continue Ghosts Ahoy until you need to visit the Old Crone. Teleport to salve, take the fairy ring to the desert (DLQ) and kill a Desert Lizard (level 24\\) for the diary and Desert Lizards (level 42\\) for Rag and Bone Man II.",
        "meta": {
          "gp_stack": "1.5m gp",
          "items_needed": "law runes, soul runes, earth staff, ghostspeak amulet, 8 empty pots, 8 buckets of slime, 8 bones, silver bar, ice coolers, dramen staff, plank sack",
          "skillsquests_met": "yes",
          "total_time": "10d15h"
        }
      },
      {
        "number": 26,
        "content": "Salve teleport, kill ghouls for Rag and Bone Man II and the diary and bats for Rag and Bone Man II. Note: bank your cat/kitten before doing the rest of this step as you can’t have one on you during Temple Trekking. Do In Search of the Myreque in its entirety, catching a swamp lizard along the way and buying 18 planks from Razmire while in Mort’ton (and completing the swamp boaty diary task along the way), and start In Aid of the Myreque (buy 11 more planks from Razmire before first entering Burgh de Rott, leave midway to collect the raw snails or raw mackerel (can be bought in Piscarilius), use your Wolfbane for fighting vampyres \\[sic\\]) up to the step where you have the rod mould (make a Guthix balance potion for the diary along the way). You need to rebank in Canifis before starting In Aid of the Myreque and do the entire section until you unlock the Burgh de Rott bank in one go.",
        "meta": {
          "gp_stack": "1.5m gp",
          "items_needed": "cash stack, all steel items from Step 20 and steel platelegs from Step 15, 263 steel nails, druid pouch, hammer, 17 planks, ring of charos(a), blessed silver sickle, rune sword, wolfsbane, swordfish, prayer potions, law runes, soul runes, bucket, spade, rune pickaxe, swamp paste, 10 bronze axes, 4 tinderboxes, 2 steel bars, coal, 15 salmon, dramen staff, garlic, silver dust, harralander, red spider eggs, vial of water, small fishing net, rope",
          "skillsquests_met": "yes",
          "total_time": "10d16h"
        }
      },
      {
        "number": 27,
        "content": "Visit the Old Crone to progress Animal Magnetism and Ghosts Ahoy (Salve teleport to get there, and rebank in Canifis if needed). Fenkenstrain teleport, colour the repaired model ship and progress Ghosts Ahoy until you have the treasure map. Continue Animal Magnetism until you have bought the undead chickens.",
        "meta": {
          "gp_stack": "1.5m gp",
          "items_needed": "cash stack, law runes, soul runes, earth staff, 3 of each red/blue/yellow dye, ghostspeak amulet, Ecto-tokens, nettle tea, bucket of milk, silk, needle, thread, knife, spade, swordfish, rune sword",
          "skillsquests_met": "yes",
          "total_time": "10d16h"
        }
      },
      {
        "number": 28,
        "content": "Continue and complete Ghosts Ahoy. While inside Port Phasmatys cook a thin snail on the Port Phasmatys range, smelt some cannonballs at the Port Phasmatys furnace. Draynor Manor teleport and complete Animal Magnetism (you can use the Pest Control minigame teleport to get to the Rimmington mine).",
        "meta": {
          "gp_stack": "1.5m gp",
          "items_needed": "cash stack, oak longbow, ghostspeak amulet, bucket of slime, thin snail, law runes, earth staff, water runes 5 iron bars, hammer, 2 undead chickens, mithril axe, holy symbol, hard leather, polished buttons, games necklace",
          "skillsquests_met": "yes",
          "total_time": "10d17h"
        }
      },
      {
        "number": 29,
        "content": "Swap to the normal spellbook and take the fairy ring/standard Clan Wars teleport to Edgeville (DKR) (and rebank, cook your lava eel). Run to the monastery and catch the scorpion for Scorpion Catcher. Defeat Chronozon for Family Crest. Teleport to Varrock and complete Family Crest (start the miniquest after), collect goldsmithing gauntlets (dueling ring teleport to Al Kharid).",
        "meta": {
          "gp_stack": "1.5m gp",
          "skillsquests_met": "yes",
          "total_time": "10d18h"
        }
      },
      {
        "number": 30,
        "content": "Continue and complete Monkey Madness I (catch a bass and chop and burn some teak logs on Ape Atoll for the diary along the way, follow the wiki steps to pre-bank RFD/MM2 greegree materials). Buy 20 potatoes, 10 cabbages and 10 onions at the Grand Tree Groceries and put them in your sacks for Dream Mentor and Mourning’s End Part II. Buy an inventory of premade choc bombs/tangled toad’s legs and one premade t’d crunch from Gianne. Make a chocolate bomb for the diary. Go to Daero and pick attack and defence (35k). Fletch an oak shortbow in the Gnome Stronghold (rebank if needed) for the diary \\- bank it if you want to woo/befriend the princess during Throne of Miscellania later. Mine a gold ore underneath the Grand Tree. Score a goal in Gnome Ball, complete a lap of the Gnome Agility Course, kill terrorbirds for Rag and Bone Man II. Take a delivery order for the gnome restaurant. Take the agility shortcut to Otto’s Grotto for the diary. Complete the delivery order for the diary.",
        "meta": {
          "gp_stack": "1.5m gp",
          "items_needed": "swordfish, prayer potions, (4+) energy potions, antipoisons, gold bar, ball of wool, lockpick, wind staff, chaos runes, law runes, water runes, rune axe, tinderbox, knife, oak log, big fishing net, bow string",
          "skillsquests_met": "yes",
          "total_time": "10d21h"
        }
      },
      {
        "number": 31,
        "content": "Minigame teleport to Shades of Mort’ton, buy a limestone (if you already have this from wintertodt skip it), a plank and 8 limestone bricks from Razmire (or do this after the quest), do Haunted Mine. Collect (one inventory of) spare salve crystals.",
        "meta": {
          "gp_stack": "1.5m gp",
          "items_needed": "Iban staff, death runes, fire runes, ball of wool, chisel, energy potions, prayer potions, swordfish, premade choc bombs",
          "skillsquests_met": "yes",
          "total_time": "10d21h"
        }
      },
      {
        "number": 32,
        "content": "Get to Brimhaven and continue Heroes’ Quest (“osrs soa” clan chat can help). Chronicle teleport to Varrock and get the Thieves’ armband. Games necklace teleport to Burthorpe, complete Heroes’ Quest. Kill the blue dragon for the diary.",
        "meta": {
          "gp_stack": "1.5m gp",
          "items_needed": "cash stack, Iban staff, death runes, fire runes, games neck, fire feather, cooked lava eel, black platebody, black full helm, black platelegs (Black Arm Gang), chronicle",
          "skillsquests_met": "yes",
          "total_time": "10d22h"
        }
      },
      {
        "number": 33,
        "content": "Buy 300 law runes, 1100 nature runes, top up your death rune stack to 3k (Watchtower teleport and buy in Yanille)_. If you do not have a Rune Pouch yet, use the minigames teleport to Clan Wars and do Last Man Standing to obtain both a rune pouch and a magic shortbow scroll._ Buy and smelt 1100 gold ore (or exactly as many as it takes to get to level 50\\) and make a(n inventory of) mithril bar(s), buying the ore if needed. Save a few hundred gold bars for jewellery, the rest are to be alched. This uses a significant amount of energy pots, if you have/had any. Make sure to equip your ring of charos (a) to reduce the foreman cost. 1. If you decide to go for more smithing, and also happen to have a higher fletching level than the guide assumes, you might be able to make a mithril grapple (59 fletching and smithing, boostable) earlier than the guide assumes. These mithril grapples are needed for the Ardougne medium diary, the Falador medium diary, the Kandarin medium diary, the Karamja hard diary and the Lumbridge & Draynor medium diary, and it is worth knocking out all these steps (and with it the diaries) as soon as you have access to mithril grapples. Just keep in mind that **they can break**, so if you had to boost to make one it would be nice to first head off to the God Wars dungeon (requires 70 ranging, unboostable) and use a droptrick to grab 5 or so in the Armadyl camp (don’t forget your god protection items\\!). Alternatively you can make several yourself.",
        "meta": {
          "gp_stack": "720k gp",
          "items_needed": "780k gp, energy potions, gold gauntlets, ring of charos (a)",
          "skillsquests_met": "yes",
          "total_time": "11d9h"
        }
      },
      {
        "number": 34,
        "content": "Go to Rellekka (house teleport). Grab the Fremennik Easy diary, putting the lamp on Herblore. Collect a few pet rocks. Put at least one in your POH menagerie and collect it again for the diary. Buy a berserker helmet. _Your attack should be at least level 50 by now, if it is not do a bit of slayer (see below in this same step)_ first. Train slayer to get to level 50 defence, using your ancient staff as a melee weapon. Alch gold bars while doing this (you’ll get plenty of time to alch during Rex later too). 1. Optional: do the next step first to use a fighter torso for your training.",
        "meta": {
          "gp_stack": "640k gp",
          "items_needed": "cash stack, dramen staff, nature runes, fire runes, gold bars, rune sword, amulet of strength, berserker helm, etc.",
          "skillsquests_met": "yes",
          "total_time": "11d10h"
        }
      },
      {
        "number": 35,
        "content": "Teleport to Barbarian Assault, do at least one full queen run in any role and buy a granite platebody. _Recommended: continue Barbarian Assault to obtain a Fighter Torso._ 1. Using ranging is generally recommended as Attacker in barbarian assault, even with low ranged level and trash tier shortbows. For all other roles wear flex or defensive gear.",
        "meta": {
          "gp_stack": "545k gp",
          "items_needed": "rune sword, amulet of strength, berserker helm, etc. (henceforth ‘melee gear’)",
          "skillsquests_met": "yes",
          "total_time": "11d12h"
        }
      },
      {
        "number": 36,
        "content": "Continue Scorpion Catcher (catch the scorpion inside the Barbarian Outpost agility course), do a lap of the agility course for the diary. Do Horror from the Deep, kill the Dagannoth Mother w/ magic, like on the wiki. Collect a berserker ring from Dagannoth Rex _(optional: stay for a dragon axe)_. Bring your remaining gold bars and nature runes to alch between kills (and between hits). Leave the long way to the Lighthouse for the diary, kill dagannoths on your way out for Rag and Bone Man II. 1. If you get a fremennik shield, keep it for The Fremennik Exiles later (in Chapter 3, Step 21). 2. The easiest way to get to Rex safespot solo is called ‘xlogging’. This works as follows: 1. You pray mage when entering the room. If Prime is on you, go back up. If Prime is not on you, regardless of whether Supreme is on you, run south immediately and swap to pray range. Run along the south edge with protect range up until you're all the way east Then, once east (pray range still up), trap Rex in the safespot, sip a prayer potion so you're at least 40 prayer points or so, and click x to close the client. Wait up to a minute for Supreme to walk away, log back on (or try a different world but there's a risk you're crashing someone). You're now on the east side and can deal with Rex only, you're out of range of Prime and Supreme 3. You can find [an example setup here](https://drive.google.com/file/d/1y1-CsDFmapBr_hFAMVeBYcIpFEPnj_OE/view?usp=drive_link) 1. The tome, cape and helm can be downgraded without issue. Use steel gloves over mystic gloves. 4. If your Iban’s staff runs out of charges in this grind you have to trek through the Underground Pass to recharge it. 5. If you run out of death runes during this grind buy more as needed. If you go significantly dry on the berserker ring you will not have enough GP to continue the guide, and will instead have to make more battlestaves from scratch. Alternatively you can start barbarian fishing for xp and growing cats in the meantime for death runes.",
        "meta": {
          "gp_stack": "790k gp",
          "items_needed": "1.1k gold bars, nature runes, granite body, rune platelegs, Iban staff, death runes, fire runes, berserker helm, amulet of magic, antipoisons, premade chocolate bombs(/other high healing food, if you have any), etc. (standard Rex gear), air staff, earth runes, water runes, fire runes, chaos runes, bronze sword, steel arrow, molten glass, tinderbox, hammer, 60 steel nails, 1 swamp tar, scorpion cage",
          "skillsquests_met": "yes",
          "total_time": "11d20h"
        }
      },
      {
        "number": 37,
        "content": "Optional and recommended: go to the PVP Arena and imbue your berserker ring. The PVP Arena method involves either an alt/friend to boost points (go at off-peak hours, hope to get matched with each other, quickly die to the other/kill the other for points, repeat) or just suiciding to randoms for quick points [imbue scroll via pvp arena - losing method](https://www.youtube.com/watch?v=OORAXLhdZAg). Next, alch your granite body. Train slayer to level 40 with shit tier tasks with your ancient staff (you might barely cross 70 combat near the end of this training, so get a Chaeldar task for the diary step if so), training melee on accurate to 60 attack. Buy a dragon scimitar and dragon dagger if you hit level 60 attack. You can use smoke burst (on accurate/magic) on jellies and ankou tasks. Make sure to complete your final task at the end. _NOTE: it is difficult for us to keep track of all small amounts of combat xp obtained so far, so all combat levels and experience trackers in BRUHsailer are estimates. Do not worry if you are several levels off in either direction._ Get on normal spellbook, go to Falador and start The Slug Menace. Pay the estate agent to move your POH to Kourend. Teleport to Ardougne with the cloak, start Eagles’ Peak in the Ardougne Zoo. Continue The Slug Menace in Witchhaven. Necklace of passage to Jorral, start Making History. Run to Eagles’ Peak, collect two dashing kebbit fur for Varrock Hard diary (if you have the hunter level, it’s fine if you do not), catch a copper longtail for the diary, mine some iron ore, and continue the quest until you have to make the disguise, make sure to collect the feathers. Teleport to Ardougne, resume The Slug Menace until you have chiselled the five special runestones.",
        "meta": {
          "gp_stack": "650k gp",
          "items_needed": "cash stack, melee gear (incl. torso/ring now), Commorb, swamp paste, 20 pure essence, chisel, necklace of passage, law runes, water runes, air runes, ardougne cloak 1, bird snare, rune pickaxe",
          "skillsquests_met": "yes",
          "total_time": "12d9h"
        }
      },
      {
        "number": 38,
        "content": "Do Throne of Miscellania and Royal Trouble (fairy ring CIP to get there), obtain 100% support (buying flowers from [the flower girl](https://oldschool.runescape.wiki/w/Flower_Girl) or chopping Etceteria teak logs), kill Rabbits for Rag and Bone Man II, deposit 600k gp (or: your entire cash stack) in Misc and set it to 10 mahogany 5 maple. The mahogany logs are for bird runs (levels 49-80), the maples for arrow shafts for fletching. Also visit at least once/twice a week to restore the support to 100% (buying flowers from [the flower girl](https://oldschool.runescape.wiki/w/Flower_Girl) or raking the herb patch). 1. The gp will sit below 675k constantly, so your kingdom will not produce the maximum amount of resources possible per day. This is fine since we have enough time, we are only interested in getting the maximum amount of resources for our money. We will leave Misc running for up to 11 days and then collect the money that remains (you may choose to leave it running for shorter, once the gp stack gets low it really doesn’t matter much. **Make sure not to exceed 11 days though\\!**). 2. If you are running low on digsite pendants buy 80 rubies in Ardougne and make new digsites. Make sure to keep doing bird runs always. If your hunter is at least level 65 always chase magpie implings, along with the Taverley crystal chest they are the best way to get a runite bar for Song of the Elves.",
        "meta": {
          "gp_stack": "80k",
          "items_needed": "cash stack, dramen staff, iron bar, rune pickaxe, rune axe, gold ring (BH runs), cake or oak shortbow (your choice), energy potions, melee gear, prayer potions, swordfish",
          "skillsquests_met": "yes",
          "total_time": "12d10h"
        }
      },
      {
        "number": 39,
        "content": "Shades of Mort’ton minigame teleport, go to the Haunted Mine. Mine a mithril ore for the diary (take the mine key for fast access). Visit the Lair of Tarn Razorlor, start and complete the miniquest (and kill a terror dog in the process).",
        "meta": {
          "gp_stack": "600k",
          "items_needed": "cash stack, melee gear, swordfish, prayer potions, energy potions, rune pickaxe, mine key",
          "skillsquests_met": "yes",
          "total_time": "12d11h"
        }
      }
    ]
  },
  {
    "id": "2.2",
    "title": "Barbarian fishing, Green dragons and the Hallowed Sepulchre",
    "totalTime": "Unknown",
    "steps": [
      {
        "number": 40,
        "content": "Do barbarian fishing to 65 agility (\\~88 fishing) at CoX (buy as many feathers as needed), make sure to do Barblore as much as possible. Cut-eat the fish for cooking xp, you will need at least level 70 cooking for RFD/Awowogei. 1. You can get to the fishing spot by using the Arceuus Library teleport (the Arceuus spell, not the Kharedst’s) into the minecart to get back. This is faster than the Kharedst’s to Lovakengj. [Example setup here](https://drive.google.com/file/d/1bvkdM4qzBPOepvDghnhVV3koP_qa8w8M/view?usp=drive_link) \\- the gp predates the Zeah favour rework and is not necessary. 2. Cut-eat the fish for cooking xp, you will need at least level 70 cooking later. _If you decide not to, then you’ll have to do Mess Hall, which is slower._ 3. For an explanation on the Mount Quidamortem barblore (can be afked, just bank the sturgeons), see[20230127LowLevelBarblore](https://docs.google.com/document/d/157zVUeEu4fkuJxjWfhTjNajR39478bBoUVRVVDeAm-w/edit?usp=sharing). Warning: this document is several years out of date, and just covers the basic idea. 4. Maintain cats, bird runs, contracts and (hardwood and fruit) tree runs, and optionally also include herb runs. Collect misc for mahogany logs for bird runs whenever necessary. If you run out of/low on digsite pendants go buy \\~80 more rubies in a gem shop (Ardougne/Kourend). 5. If you prefer to do this as a low effort/afk activity you may instead choose to weave the fishing in during other steps (instead of grinding this all at once). The levels are not needed until step 64 of this chapter. 6. Depending on your fishing rate your 2 weeks of Misc could be over during this step, make sure to take out the remaining GP at that point (or on some future step, whenever it happens). 7. If you run out of soul runes go buy 200 more for teleports(/hourlies).",
        "meta": {
          "gp_stack": "0 gp",
          "skillsquests_met": "yes",
          "total_time": "15d10h"
        }
      },
      {
        "number": 41,
        "content": "Swap to the standard spellbook. Use your Fremennik boots to get to Rellekka. Do The Fremennik Isles (make a Fremennik shield, ‘Neitiznot shield’, along the way for the diary), putting the XP on attack _(or defence if you are already level 60\\)_. Make a silvthrill rod at the Neitiznot furnace. Enchant your silvthrill rod. Sell your berserker helm back to Skulgrimen after you’ve obtained the Helm of Neitiznot*.*",
        "meta": {
          "gp_stack": "42k gp",
          "items_needed": "cash stack, Fremennik boots 1, 7 coal, 9 ropes, knife, rune axe, hammer, bronze nail, needle, 2 thread, melee gear, swordfish/premade choc bombs, prayer potions, cut sapphire, mithril bar, silver bar, rod mould, cosmic rune, water runes",
          "skillsquests_met": "yes",
          "total_time": "15d10h"
        }
      },
      {
        "number": 42,
        "content": "Start Lunar Diplomacy and continue the quest until you have to use your dramen staff on the elemental altars to make a lunar staff (optional: make more than one lunar staff for cosmetic purposes). Remember to do your hourlies and grow cats whenever convenient.",
        "meta": {
          "gp_stack": "42k gp",
          "items_needed": "tinderbox, bullseye lantern (might still be a sapphire lantern from Tears of Guthix, just swap it out), melee gear, swordfish, energy potions, prayer potions, clean guam, clean marrentill, pestle and mortar, dramen staff",
          "skillsquests_met": "yes",
          "total_time": "15d11h"
        }
      },
      {
        "number": 43,
        "content": "Teleport to the mind altar, create the special runestone for The Slug menace and a mind tiara for the diary. Fairy ring DKR to edgeville, continue RFD/Evil Dave. Visit the following four altars through the abyss: air altar, fire altar (carry 10+ pure essence, a full inv is fine, a binding necklace, your earth talisman and a stack of earth runes, then use the earth runes on the altar to make lava runes), water altar and earth altar in that order, creating your lunar staff/staves and the special runestones for The Slug menace.",
        "meta": {
          "gp_stack": "42k gp",
          "items_needed": "cat, 9 stews, tiara, mind talisman, 10 pure essence, binding necklace, earth talisman, earth runes, dramen staff, blank air rune, blank water rune, blank earth rune, blank fire rune, blank mind rune",
          "skillsquests_met": "yes",
          "total_time": "15d12h"
        }
      },
      {
        "number": 44,
        "content": "Teleport to Ardougne (fairy ring BLR), continue The Slug Menace and kill the Slug Prince. Get teleported to Falador and complete The Slug Menace, buy a full set of proselyte (it’s cheaper to buy it as a set than individually). Buy an adamant chainbody at the chainmail shop, then heat a bowl of water in Falador (range on the east side). Teleport to Rellekka (Fremennik boots/fairy ring AJR) and complete all of Lunar Diplomacy. Note: never bank your seal of passage. Wear it to prevent this\\!",
        "meta": {
          "gp_stack": "12k gp",
          "items_needed": "law runes, air runes, earth runes, water runes, seal of passage, cash stack, bowl of water, rune pickaxe, hammer, needle, 2 thread, 4 suqah hide, tinderbox, spade, energy potions, prayer potions, swordfish, small pouch, medium pouch, large pouch, cosmic runes, astral runes, staff of air, chisel, abyssal book.",
          "skillsquests_met": "yes",
          "total_time": "15d13h"
        }
      },
      {
        "number": 45,
        "content": "Chronicle teleport, run east and start What Lies Below. Chronicle teleport again, run northwest and kill 5 outlaw’s for What Lies Below, then run to Barbarian Village. Continue One Small Favour (barbarian village, grab a cooked meat from the longhall, then dwarven mine). Keep going with One Small Favour until you have inspected Petra in the rock, taking any crystal keys and opening them if you happen to have any (you may want to rebank in Falador). Visit Thormac to complete Scorpion Catcher. Run to Wizard Cromperty in Ardougne for One Small Favour. Get 5 pigeon cages while you’re in Ardy.",
        "meta": {
          "gp_stack": "12k gp",
          "items_needed": "bowl of hot water, 1 harralander, 2 guam, 2 marrentill, energy potions, prayer potions, air staff, law runes, water runes, scorpion cage",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 46,
        "content": "You should be at least level 55 hunter by now. Have Barnaby take you to Rimmington, light your bullseye lantern (swap out the emerald for a lantern lens) at the chemist for the diary, return to Ardougne. Go to Jimmy Dazzler and continue Ratcatchers, complete that segment entirely. Start Cold War in the zoo (up to the step where you have to make the penguin suit). Catch a Snowy knight and a Sabre-toothed kyatt along the way for the diary.",
        "meta": {
          "gp_stack": "12k gp",
          "items_needed": "cash stack, emerald lantern, lantern lens, tinderbox, 10 oak planks, 10 steel nails, hammer, spade, dramen staff, butterfly net, butterfly jar, teasing stick, knife, any log, water staff, law runes, cat, ardougne cloak 1",
          "skillsquests_met": "yes",
          "total_time": "15d14h"
        }
      },
      {
        "number": 47,
        "content": "Chronicle teleport, return the folder to Rat Burgiss for What Lies Below, teleport to Varrock and resume that quest until you have to use the wand on the chaos runecrafting altar. Bank, grab Earth Blast runes, an axe, 23 raw karambwanji, coins, anti-dragon shield, the items needed for Tai Bwo Wannai Trio (make sure to save the 2-dose agility pot for Making Friends with My Arm) and some food, head to Brimhaven via Barnaby. If you did not previously make a karamjan rum with sliced banana in it, purchase both components and make it now (requires a knife, use the knife on the banana before adding it to the rum). Speak with Lubufu to continue Tai Bwo Wannai Trio (droptrick to get two karambwan vessels), kill snakes for Rag and Bone Man II, enter the Brimhaven dungeon. In there chop the vines, use the stepping stones, climb the stairs, kill fire giants for Rag and Bone Man II and mage a bronze dragon for diary steps.",
        "meta": {
          "gp_stack": "12k gp",
          "items_needed": "cash stack, rune axe, earth runes (or staff), air runes (or staff), death runes, raw karambwanji, anti-dragon shield, melee gear, swordfish, energy potions, prayer potions, antipoison, steel spear, small fishing net, 4-dose agility potion, tinderbox, necklace of passage (for two sections ahead)",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 48,
        "content": "Then proceed to complete Tai Bwo Wannai Trio, killing Jogres for both the diary and Rag and Bone Man II along the way, catching a karambwan, exploring Cairn Isle and trapping a horned graahk also along the way and buying an opal (or better) machete from Safta Doc after for the diary. Don’t forget to claim the rewards from the three brothers, and buy a bronze spear (and cloth, clean it, for a scarecrow for Morytania easy diary and Falador medium diary, plant it on your next herb run. Leave it in whichever patch is second and plant sweetcorn for RFD/Sir Amik Varze). 1. Once you have planted the scarecrow in the morytania patch you have completed all tasks for the easy diary, collect the rewards at your own convenience and put the xp lamp on Herblore.",
        "meta": {
          "gp_stack": "14k gp",
          "items_needed": "cash stack, karambwan vessel, Iban staff, death runes, fire runes, 2+ logs, tinderbox, noted semi-precious gems (sell to Gabooty for trading sticks), banana-rum, seaweed, monkey skin, jogre bones, raw karambwanji, pestle and mortar, teasing stick, knife, necklace of passage (next)",
          "skillsquests_met": "yes",
          "total_time": "15d16h"
        }
      },
      {
        "number": 49,
        "content": "Run to Brimhaven, do the Agility Arena for one ticket, claim the easy and medium Karamja diaries (lamps on Slayer).",
        "meta": {
          "gp_stack": "14k gp",
          "items_needed": "necklace of passage",
          "skillsquests_met": "yes",
          "total_time": "15d16h"
        }
      },
      {
        "number": 50,
        "content": "Minigame to Port Khazard (and rebank), continue One Small Favour, teleport to the Ardougne market and speak with Erin the silver merchant for Making History. Grab Fire Blast runes for the fight below.",
        "meta": {
          "gp_stack": "14k gp",
          "items_needed": "Dueling ring (next section)",
          "skillsquests_met": "yes",
          "total_time": "15d16h"
        }
      },
      {
        "number": 51,
        "content": "Dueling teleport, speak with Osman for Contact\\!. Camulet teleport to the quarry and head to Sophanem, speak with Simon Templeton, climb the agility pyramid and take the golden pyramid for the diary (hit spacebar after collecting it to complete the diary step, if not you’ll have to climb the pyramid again), sell your Pyramid Plunder artefact and golden pyramid to Simon Templeton, enter Sophanem and finish Contact\\! (pick up the Keris and kill a locust rider for the diary near the end), putting the lamp on Attack (unless you’ve already hit level 60, in which case you should put it on Defence). Speak with the Sphinx to progress A Tail of Two Cats. Games necklace to Burthorpe and progress A Tail of Two Cats, doing Bob’s chores including planting the potatoes (don’t wait for them to grow).",
        "meta": {
          "gp_stack": "14k gp",
          "items_needed": "cash stack, waterskins, dueling ring, Camulet, stone scarab, wind runes (or staff), death runes, fire runes (or staff), swordfish, prayer potions, antipoison, light source, catspeak amulet",
          "skillsquests_met": "yes",
          "total_time": "15d17h"
        }
      },
      {
        "number": 52,
        "content": "Dueling ring to Castle Wars, continue One Small Favour until you have made the gnome glider landing strip (make sure to use the drop trick to buy extra gems of each type – 2 of each of the four types for 2k gp). Do Big Chompy Bird Hunting, save a raw chompy for later. Catch a spined larupia for the diary. Kill wolves for Rag and Bone Man II.",
        "meta": {
          "gp_stack": "12k gp",
          "items_needed": "cash stack, stodgy mattress, semi-precious gems, sapphires, Ardy Cloak 1, dramen staff, teasing stick, knife, regular logs, hammer, chisel, melee gear, dueling ring, energy potions, games necklace (next)",
          "skillsquests_met": "yes (follow wiki steps to obtain the remaining items during the quest)",
          "total_time": "15d18h"
        }
      },
      {
        "number": 53,
        "content": "After completing the Rantz step of OSF, teleport to Burthorpe and progress A Tail of Two Cats (the potatoes should be grown by now), then to Varrock (chronicle). Progress Ratcatchers at Hooknosed Jack, talk to the Apothecary for Ratcatchers and A Tail of Two Cats. Return to Hooknosed Jack to continue Ratcatchers.",
        "meta": {
          "gp_stack": "12k gp",
          "items_needed": "stodgy mattress, games necklace, catspeak amulet, hellcat, 4 cheese, empty vial, 2 red spider’s eggs, kwuarm, marrentill, unicorn horn dust, bucket of milk, karambwanji or other fish (for cat), limpwurt root, law runes, air runes, fire runes",
          "skillsquests_met": "yes",
          "total_time": "15d18h"
        }
      },
      {
        "number": 54,
        "content": "Make the penguin suit (use an extra steel bar for the clockwork) after upgrading the workbench. Blast furnace minigame teleport and complete the Smokin’ Joe part of Ratcatchers, followed by giving the gold cannonball to Dondakan and collecting three of the four schematics for Between a Rock…",
        "meta": {
          "gp_stack": "12k gp",
          "items_needed": "law runes, earth runes, air runes, two molten glass, plank, silk, steel bar, hellcat, catspeak amulet, pot, weeds, tinderbox, golden cannonball, dwarven lore book (for the third page)",
          "skillsquests_met": "yes",
          "total_time": "15d19h"
        }
      },
      {
        "number": 55,
        "content": "Teleport to Burthorpe to progress A Tail of Two Cats, then minigame teleport to Port Khazard, continue OSF, when in Ardougne rebank and start Legends’ Quest, grind your sweetcorn into a pot of cornflour if you have the sweetcorn (if not you can just grind it later). Continue OSF then continue Cold War until after the raw cod/ring of charos(a) step (so next up you have to collect the ‘Intelligence’.). Make sure to pick up 5 papyrus during Legends’ Quest start",
        "meta": {
          "gp_stack": "12k gp",
          "items_needed": "doctor’s hat, desert shirt/robe, vial of water, law runes, water staff, melee gear \\+ rune pickaxe, prayer potions, hammer, ring of charos(a), Ardy Cloak 1, penguin suit",
          "skillsquests_met": "yes",
          "total_time": "15d19h"
        }
      },
      {
        "number": 56,
        "content": "Continue One Small Favour, all the way from Seers’ Village to Horvik in Varrock. When at the White Wolf Mountain take the gnome glider to Feldip Hills and back for the diary, speak with Khorvak under White Wolf Mountain for Between a Rock…, when in Barbarian Village make a second pot lid for Swan Song, enter the Stronghold of Security and collect an imbued skull sceptre and spend one charge to teleport for the diary, then run north and take the abyss to the chaos runecrafting altar with the wand and 15 chaos runes for What Lies Below. When at Horvik continue and complete What Lies Below. Collect (keep) the Dragon’hai history book for 5 kudos at the Varrock Museum at your own convenience.",
        "meta": {
          "gp_stack": "12k gp",
          "items_needed": "law runes, air staff, hammer, dueling ring, melee gear, swordfish, prayer potions, energy potions, dwarven stout (on table), 2 soft clay, fire runes, herbal tincture (reclaim from Apothecary instead), 5 pigeon cages, fancy/fighter boots (to imbue the sceptre).",
          "skillsquests_met": "yes (listen to the wiki when it tells you to pick up items to save time later)",
          "total_time": "15d20h"
        }
      },
      {
        "number": 57,
        "content": "After solving Horvik’s problem go to the southeast corner of Varrock, make two eagle disguises for Eagles’ Peak (and the spottier cape if you had the hunter level). Next world hop at the west bank anvils until you find Bob again and complete A Tail of Two Cats (lamp on slayer).",
        "meta": {
          "gp_stack": "12k gp",
          "items_needed": "catspeak amulet, law runes, air staff, earth runes (all for next section)",
          "skillsquests_met": "yes",
          "total_time": "15d20h"
        }
      },
      {
        "number": 58,
        "content": "Get to Lumbridge, continue Cold War, complete RFD/Evil Dave, start RFD/Awowogei, RFD/Sir Amik Varze (speak with the cook to learn the recipe), RFD/Lumbridge Guide and RFD/Skrach. Buy black gloves. 1. Note: do NOT let Larry teleport you to the iceberg\\! You will be stuck there with no easy way back.",
        "meta": {
          "gp_stack": "11k gp",
          "items_needed": "penguin suit, evil stew, air runes, water rune, law rune",
          "skillsquests_met": "yes (listen to the wiki when it tells you to steal a bell and grab items)",
          "total_time": "15d20h"
        }
      },
      {
        "number": 59,
        "content": "Continue OSF (Misthalin steps), when in Draynor speak with the Wise Old Man for RFD/Varze then run to the Wizards’ Tower and speak with Wizard Traiborn for RFD/Lumbridge Guide. Run back, continue OSF. When in Port Sarim kill seagulls for Rag and Bone Man II then speak with The Face and Felkrash for Ratcatchers (until you need to go to the snake charmer).",
        "meta": {
          "gp_stack": "11k gp",
          "items_needed": "cash stack, chicken cages, blunt axe, hellcat, catspeak amulet, snake charm, charos(a)",
          "skillsquests_met": "yes",
          "total_time": "15d20h"
        }
      },
      {
        "number": 60,
        "content": "Complete One Small Favour (charter to Brimhaven into the cart to Shilo Village, then leave the city, lamps on slayer). Complete Cold War. Complete Making History (teleport around a bit). _If you don’t have a spare purple dye, pick one up while in Ardougne for Making History._",
        "meta": {
          "gp_stack": "12k gp",
          "items_needed": "cash stack, ring of charos(a), sharpened axe, penguin suit, swamp tar, 5 feathers, mission report, mahogany plank, soft leather, cowbell (stolen in Step 57\\), swordfish, melee gear, prayer potions, spade, Ectophial, ghostspeak amulet, sapphire amulet, Fremennik boots 1, necklace of passage, law runes, water staff, enchanted key, dueling ring (to get to Castle Wars for the first step in Making History, but also rebank at Ferox), air runes, earth rune",
          "skillsquests_met": "no (earlier items only)",
          "total_time": "15d21h"
        }
      },
      {
        "number": 61,
        "content": "Go to fairy ring BIQ, enter the Kalphite hive and collect 5 potato cacti for the diary, then return to the Shantay pass and collect the easy Desert diary (lamp on Slayer). Bank, grab your cat and quest items. Run/carpet to Pollnivneach and continue Ratcatchers. _On any herb run complete Ratcatchers in Port Sarim, entering the rat pits for the diary._",
        "meta": {
          "gp_stack": "12k gp",
          "items_needed": "Law runes, water runes, peste and mortar, vial, black mushroom, toadflax, vial of water, pharmakos berries, Ardy Cloak 1, dramen staff, energy pots, rope, waterskins, Camulet, hellcat, catspeak amulet",
          "skillsquests_met": "yes",
          "total_time": "15d21h"
        }
      },
      {
        "number": 62,
        "content": "After this step, continue and complete Between a Rock…, smithing the gold helmet in the Wilderness resource arena. While in the wilderness for that step run to the Demonic Ruins and restore a prayer point for the diary, then run to the Fountain of Rune to cast low alchemy on any junk (explorer’s ring alch works on any spellbook). Alch the rune pickaxe that you get as a reward at some point.",
        "meta": {
          "gp_stack": "31k gp",
          "items_needed": "cash stack (only take 7.5k into Wildy), 3 gold bars, slash item/weapon, hammer, pickaxe (for Wildy med diary, so addy instead of rune for example), melee gear, prayer pots, swordfish",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 63,
        "content": "MLM for coal and gem bag (repair the strut along the way for the diary). Do low level **group** Volcanic Mine (this is a bit of a trek) for the prospector hat, and optionally for the rest of the gear as well. Check out [https://discord.gg/FXPUrUp](https://discord.gg/FXPUrUp) for finding teams. Complete the Falador hard diary step. Complete the Falador easy diary, putting the lamp on slayer. 1. At MLM after hourlies you can run back from the Falador patch after a herb run, or use the Arceuus Spawn Point teleport to get back to Falador. 2. Similar to the barbarian fishing you can choose to spread this out over multiple steps, although this time you need at least 72 mining by step 64 and you need to have completed MLM by step 73\\. 3. If you think the coal and gem bag are not useful enough you can instead opt to first get \\~68-70 mining through other means (in particular, sandstone or blast mining). This option will mean you will be short on gp and have to make a set of air staves from scratch to adjust. 4. There is a tick manipulation method to significantly increase the speed of Motherload Mine (credit to Port Khazard and Drøgøn for discovering this). You can find a short example clip of this here: [https://imgur.com/a/UkY7Ytj](https://imgur.com/a/UkY7Ytj) (the clip has a metronome sound for timing). The method works as follows: 1. You need an **adamant** pickaxe, other tiers don’t work. 2. The method, explained below in more detail, works the same way you would 3t mine (e.g. 3s1g, or granite) but _on a successful mine, click the next ore again on the xp drop, so that the total cycle is 4t_ on a success and 3t on a failure. Note that ‘click’ here means ‘click processed on this tick’, so you have to give the input 1t earlier. 1. tick 1: herb tar rock 1t away 2. tick 2: interact 3. tick 3: still interacting 4. tick 4: herb tar rock 1t away (does nothing if succeeded) \\- this is the tick 1 of the next cycle if you failed 5. tick 5: click same rock u did in tick 4 (incase you succeeded) \\- this is the tick 1 of the next cycle if you succeeded 3. Theoretically this represents an increase of approximately 40% in xp/hr at level 70 mining, though realistically the gains will be lower due to having to move to a new spot more often. 4. [OSRSMLMMotherlodeMineSpot.png](https://drive.google.com/file/d/1MKP4-fvu9jv6iEeMSC36stdk96Gwj3tA/view?usp=share_link)shows a recommended location (in the southwest corner) for having multiple veins close to one another. Alternatively you can pick a closer spot to the deposit chute but have to adapt more to veins depleting. 5. [3t/4t (3.5t?) double roll motherlode mine example](https://www.youtube.com/watch?v=2WiU4Z40CN0) shows the method in full, with an explanation in the description of the video. 6. [Tick manip Motherlode Mine example](https://www.youtube.com/watch?v=y6oxLDGAkkY) shows a non-optimised example clip, slightly north of the recommended spot. 5. Your \\~11 days of Misc should be more than over by now (they probably were a long time ago), make sure to take out the remaining GP (fill up the cash stack to at least 200k total) if you haven’t already even if the time hasn’t passed.",
        "meta": {
          "gp_stack": "200k gp",
          "skillsquests_met": "yes",
          "total_time": "16d22h"
        }
      },
      {
        "number": 64,
        "content": "Start Swan Song, continue Eagles’ Peak until you need to report back to Larry (last step). Visit the Wise Old Man in Draynor Village. Visit Charlie to complete Eagles’ Peak, use a necklace of passage to Eagles Eyrie and take multiple eagle rides (back and forth to each location, finishing in the desert) to progress three diaries. Run to the Shantay Pass to collect the Desert medium diary reward and put the lamp on Slayer. Take the fairy ring to the Piscatoris hunter area (AKQ), optional: when in the Piscatoris region box trap a ferret and then rabbit snare \\+ ferret to catch a rabbit for a rabbit’s foot, then string it for extra eggs on future bird runs, run to Piscatoris and continue Swan Song. Complete Swan Song. Start and complete Making Friends with My Arm, boosting your agility level with an agility potion if necessary. **_Good herb runs start here._** 1. Make the Fire of Nourishment (three Fires of Eternal Light optional), grab an iron pickaxe, mine all the basalt (using your rune pickaxe) and salts for all the fires, make 100 Stony basalt and 100 Icy basalt. In total this requires 200 basalt, 1050 Efh, 1000 Urt and 1300 Te salt. 1. Optional: also make the Fire of Dehumidification and the Fire of Unseasonal Warmth \\+(350 Efh, 150 Te and 400 Urt salt).",
        "meta": {
          "gp_stack": "225k gp",
          "items_needed": "cash stack, 10 mist runes, 10 lava runes, 5 blood runes, airtight pot, rune pickaxe, rune axe, tinderbox, hammer, ring of charos(a), dramen staff, Ardy Cloak 1, melee gear, prayer pots, swordfish, yellow dye, swamp tar, necklace of passage, rope, energy pots, teasing stick, box trap, rabbit snare, law runes, soul runes",
          "skillsquests_met": "yes",
          "total_time": "17d17h"
        }
      },
      {
        "number": 65,
        "content": "Do barbarian fishing to 99 fishing at CoX (buy as many feathers as needed), make sure to do Barblore as much as possible. Cut-eat the fish for cooking xp, you will need at least level 70 cooking for RFD/Awowogei. 1. **NOTE: if you are not aiming to max in the future you can skip this step, and instead train agility to level 72 manually (at Seers rooftops).** 2. You can get to the fishing spot by using the Arceuus Library teleport (the Arceuus spell, not the Kharedst’s) into the minecart to get back. This is faster than the Kharedst’s to Lovakengj. [Example setup here](https://drive.google.com/file/d/1bvkdM4qzBPOepvDghnhVV3koP_qa8w8M/view?usp=drive_link) \\- the gp predates the Zeah favour rework and is not necessary. 3. Cut-eat the fish for cooking xp, you will need at least level 70 cooking later. _If you decide not to, then you’ll have to do Mess Hall, which is slower._ 4. For an explanation on the Mount Quidamortem barblore (can be afked, just bank the sturgeons), see[20230127LowLevelBarblore](https://docs.google.com/document/d/157zVUeEu4fkuJxjWfhTjNajR39478bBoUVRVVDeAm-w/edit?usp=sharing). Warning: this document is several years out of date, and just covers the basic idea. 5. When you hit 66 herblore make a super defence potion in the Fremennik province for the Fremennik hard diary. 6. Maintain hourlies (contracts, bird runs, hardwood and fruit tree runs, herb runs, optionally seaweed \\- you will never need more than 12.5k seaweed). You can stop growing cats if you want though it’s still good to continue, after all you’re fishing for cat food nonstop. 7. _Optional alternative: use the firefighter method[Tempoross - 80+ Permits/Hour - Solo Firefight Method](https://www.youtube.com/watch?v=lg4tNw3ZjeI) at Tempoross for high points/hr to get a fishing barrel, then resume the barbarian fishing grind._",
        "meta": {
          "gp_stack": "225k",
          "items_needed": "knife, teak log, barbarian rod, feathers, 2-dose potions",
          "skillsquests_met": "yes",
          "total_time": "22d4h"
        }
      },
      {
        "number": 66,
        "content": "Swap to the regular spellbook. Complete Recipe for Disaster by following the steps below: 1. Dueling ring to Al Kharid, take the gnome glider to the Feldip Hills. Speak with Rantz to progress RFD/Skrach until you are asked to meet him on Karamja. 2. (redirected) POH tab to Brimhaven, take the travel cart to Shilo village. Resume Legends’ Quest all the way to the final step (have obtained the totem pole). While in the jungle chop a teak and mahogany log, collect a palm leaf (chop a palm tree) five times (drop and pick up), make and eat an oomlie wrap (kill an oomlie for food, use palm leaf, cook and eat), collect a vanilla pod along the way for RFD/Sir Amik Varze and kill a deathwing inside the Viyeldi caves for the diary. Head west and light a fire on the coast for RFD/Skrach, take the boat back to Rantz and prepare a cooked jubbly. 3. Ardougne Cloak into a fairy ring to the Legends’ Guild (BLR), go inside and complete the quest, putting the lamps on herblore. Go back outside, take the fairy ring to Zanaris. Grind a sweetcorn into flour if you haven’t yet, then go into the Evil Chicken’s Lair and resume RFD/Varze until you have the brulee. 4. Take the fairy ring CLR to Ape Atoll, do all of RFD/Awowogei up to and including the step where you have the cooked stuffed snake. 5. Teleport to Lumbridge. Complete RFD (including the Culinaromancer fight), lamping Herblore. Buy barrows gloves. **GP stack:** **Items needed:**",
        "meta": {
          "skillsquests_met": "yes",
          "total_time": "22d9h"
        }
      },
      {
        "number": 67,
        "content": "If you cannot yet enter the Warriors’ Guild (130 combined attack and strength), train your attack/strength with slayer tasks until you can (your goal is 60 atk 70 str). Enter the Warriors’ Guild, kill cyclopes to get a dragon defender (bank some black knives along the way). Your attack and defence should both be at least level 60, if they are not train attack to 60 first, then defence to 60\\. After this train defence as high as it will go during the defender grind. 1. If you do not get to level 60 defence from the dragon defender grind, train your defence to 60 with slayer tasks or sand crabs. 2. Cheese potatoes are a reasonable food source for many situations (though worse than 15-healing premade gnome food). Buy 1000 of either of them. You may mix and match. 3. Buy a defence potion. 4. If you haven’t already, go to either the PVP Arena or to NMZ and imbue your berserker ring and salve amulet. 1. The PVP Arena method involves either an alt/friend to boost points (go at off-peak hours, hope to get matched with each other, quickly die to the other/kill the other for points, repeat) or just suiciding to randoms for quick points [imbue scroll via pvp arena - losing method](https://www.youtube.com/watch?v=OORAXLhdZAg). 2. For a guide on NMZ, see [OSRSNMZGuide.txt](https://drive.google.com/file/d/1Rg9o4JvmpqZZrBRPD53jlF-AM0-dE-XM/view?usp=share_link) or [I figured out how Nightmare Zone points are calculated. New meta for AFKing with absorption pots to get good XP/hr and decent points/hr\\! : r/2007scape](https://www.reddit.com/r/2007scape/comments/k6n3gg/i_figured_out_how_nightmare_zone_points_are/). Briefly, there are four main methods: 1. Afk easy rumble: pick 5 high xp bosses, afk in easy rumble with absorption potions. 20 minute afk, medium xp, almost no points. 2. Afk hard rumble: pick 5 high xp bosses, rock cake down to 1hp, absorption potions. \\~8 minute afk (after that point your 1k charges are out and you have to cake back down and refill your absorptions), high xp, medium points. 3. Hybrid hard rumble: following the reddit link, pick a mixture of bosses that give good points and are afk, then copy the method for afk hard rumble. \\~8 minute afk, medium xp, good points. 4. Active (‘points’) nmz: only disable the bosses in the list below. fight them actively. When annoying bosses pop up, ignore them until you roll ultimate power. Not afk, high xp, very high points. 1. Corrupted Lizardman 2. Elvarg 3. Dad 4. Glod 5. The Recipe for Disaster bosses 6. Giant Roc 7. Barrelchest 8. Elven traitor 9. Essyllt 10. Corsair Traitor 5. Go to NMZ and collect enough points (using the above guide) for redirection scrolls. From here on you have redirected POH tabs for herb runs, tree runs and general use.",
        "meta": {
          "gp_stack": "215k gp",
          "items_needed": "cash stack, cut diamond, melee gear (now incl. dscim/DDS), mithril armour set, prayer potions, stat-boosting potions, cheese potatoes (buy in guild)",
          "skillsquests_met": "yes",
          "total_time": "22d17h"
        }
      },
      {
        "number": 68,
        "content": "Tackle organised crime for intelligence along the way and hand it in at Captain Ginea for the diary. Catch a chinchompa in the Kourend Woodland. Collect T5 Shayzien outfit from the combat ring. Collect the medium Kourend & Kebos diary. Put the XP lamps on slayer. Do A Kingdom Divided (need to be on the normal spellbook, lamps on Slayer), using melee for the fights. Grab the skull near the Shayzien graveyard dungeon entrance and buy redberries in Kenelme’s Wares (Piscarilius) along the way. Minigame teleport to Mort’ton, start and complete His Faithful Servants miniquest, which includes doing a complete barrows run (all six brothers). It is recommended to complete the [Defence? What Defence?](https://oldschool.runescape.wiki/w/Defence%3F_What_Defence%3F), [Can't Touch Me](https://oldschool.runescape.wiki/w/Can%27t_Touch_Me), [Pray for Success](https://oldschool.runescape.wiki/w/Pray_for_Success) and optionally also [Just Like That](https://oldschool.runescape.wiki/w/Just_Like_That) tasks on this run, dds speccing Karil (and hoping for good hits or resetting on a failure), maging the four melee brothers and meleeing Ahrim.",
        "meta": {
          "gp_stack": "215k",
          "items_needed": "melee gear, cheese potatoes, stat-boosting potions, prayer potions, a defence potion (3 dose), volcanic sulphur, molten glass, dark essence block, an axe, fire bolt runes",
          "skillsquests_met": "yes",
          "total_time": "22d20h"
        }
      },
      {
        "number": 69,
        "content": "Kill green dragons with defensive melee and thralls until you reach level 65 defence. Do King’s Ransom (XP on herblore), then the Knight Waves Training Grounds. Set your spawn point to Camelot. Use the bones at the Chaos Altar to get to 60+ prayer. Return to the green dragons, killing 1.3k total with defensive melee (to 70 defence, swap to accurate, i.e. attack training, after) banking both bones and hides using a looting bag. Along the way kill one mammoth and an ent, chopping some yew logs from the ent for the diary. 1. The standard setup (with or without dragonfire potions) is: Helm of Neitiznot (risked), Dragon Scimitar, Dragon Defender, Amulet of Strength, Barrows gloves (+1), Proselyte top \\+ bottom, Berserker Ring (i), Ardougne Cloak 1, Climbing Boots, Rada’s Blessing 1, Resurrect Superior Skeletal/Ghostly thrall runes (unless you have access to the Greater spell at level 76, boostable from 73 with a Wizard’s Mind Bomb. If so, use that instead) and book. Use a games necklace to Corporeal Beast then run east to get to the dragons (1250 or 1500 total level worlds are usually empty), and dueling rings back to Ferox to bank and restore. 1. The [example setup looks like this](https://drive.google.com/file/d/1zy9vpKCF4NMlpTuRPPE7MxpKcpkMCQxr/view?usp=drive_link), although you may not need as much food. 2. The best strategy for completing the Knight Wave Training Grounds is not flinching or poison, but simply fighting them using food and potions and letting the knights kill you once you run low on supplies. This will let you continue at the knight that killed you, making it very easy. The minigame is safe so HCIM can use this method too. 3. This will get your defence to 70 (and, once you use the bones on the Chaos Altar, also prayer to 70), unlocking Piety.",
        "meta": {
          "gp_stack": "215k gp",
          "items_needed": "melee gear (as mentioned), looting bag, cheese potatoes, stat-boosting pots, runes for thralls",
          "skillsquests_met": "yes",
          "total_time": "23d12h"
        }
      },
      {
        "number": 70,
        "content": "Cash in the prayer xp at the Chaos Altar when convenient (use the suicide method at off-peak hours in random worlds recommended). If you have spare red topazes you can make burning amulets. 1. After one of your inventories, run into the King Black Dragon Lair for the diary. Tele out to Ferox using a dueling ring or suicide. 2. Pest control minigame teleport, do a novice and intermediate game of Pest Control. 3. If you have enough fossils for two display cases: 1. Teleport to Varrock, pray at the altar in the palace with smite active. Build two fossil display cases and speak with the information clerk for xp and Orlando Smith for the diary. Collect the Varrock hard diary reward, putting the lamp on herblore. 2. _If you do not have enough fossils for two display cases postpone this to step 72\\._",
        "meta": {
          "gp_stack": "215k gp",
          "items_needed": "1.4k bones, melee gear (for PC)",
          "skillsquests_met": "yes",
          "total_time": "23d12h"
        }
      },
      {
        "number": 71,
        "content": "Tan your green dragonhides into green dragon leather in Canifis. Craft them all into green d’hide bodies. Alch the bodies (buying nature runes as necessary), e.g. during artefacts, underwater or afk. **Seers bankstand** cut your maple logs into arrow shafts, turning one into a maple shortbow for the diary. Also make a superantipoison potion. Buy feathers (if you don’t have plenty of those already from bird runs) to get to level 60 and make all into headless arrows, ideally while afking underwater to get more seaweed spores.",
        "meta": {
          "gp_stack": "1.9m gp",
          "total_time": "23d16h"
        }
      },
      {
        "number": 72,
        "content": "You should be level 51 (or higher) slayer. Teleport to Varrock, make sure to grab the Dragon’hai history book from the Varrock Palace library if you don’t already have it, pray at the altar in the palace with smite active. Speak with the information clerk for xp and Orlando Smith for the diary. Collect the Varrock hard diary reward, putting the lamp on slayer or herblore as mentioned above. Run east to the quatzel to go to Varlamore and do Twilight’s Promise, Meat and Greet and At First Light (note: the hunter rumours are currently not efficient, but if you want the rewards you can go for them at any time after this quest). During At First Light catch a Sunlight antelope (east end of the island, requires level 72 hunter, a teasing stick, knife and logs \\- grab a Trapper’s tipple or two at the hunter’s guild for a \\+2 boost if needed) and kill a jaguar for their fur. At the hunter’s guild buy two mixed hide bases, and either pay Pellem to have the furs made into mixed hide boots (your best ranged boots for now) and a mixed hide cape (your best melee cape for now) or boost your crafting level if you have a spare mushroom pie to do it yourself. After this start and complete Perilous Moons (for the fights your dragon scimitar is fine, even for ice. Use the swamp lizards and moonlight potions for supplies) and The Heart of Darkness. Slay a Brine rat to complete the Fremennik medium diary, putting the lamp on herblore. Grab a rope, salve teleport, dip your enchanted silvthrill rod in the well to make the Rod of Ivandis and complete In Aid of the Myreque, Darkness of Hallowvale, A Taste of Hope and Sins of the Father (all lamps on herblore). Use the Efaritay’s aid during the Vanstrom Klause fight in Sins of the Father \\- you should only need one ring, the second is spare in case you die or run out of charges. 1. We will continue lamping slayer to level 58 for access to Cave Horrors, and after that put all lamps on herblore instead. You may choose to lamp more/less slayer depending on personal preference. There is more than enough lamp xp. 2. This unlocks Yarnio’s Baked Goods shop, a slightly better shop location for Garden pies than Romily Weaklax.",
        "meta": {
          "gp_stack": "1.9m gp",
          "items_needed": "law runes, soul runes, silvthrill rod, rope, dramen staff, plank, 8 nails, hammer",
          "skillsquests_met": "yes",
          "total_time": "24d3h"
        }
      },
      {
        "number": 73,
        "content": "Catch \\~1.5k grey chins for level 55 ranging (at Soul Wars \\- you can take an axe to chop the nearby teaks in case you mess up your knife-log). Catch **_\\~1.5k red chins_** in the Feldip Hills. Train your ranging in the MM1 tunnels (short fuse) to level 62 (55 with grey, 55-62 with red). Make sure to equip a salve amulet (ei) _(glory is better if you have it)_. 1. _Optional alternative: skip this step and AFK the range training at crabs, you can even go to 70 but it is not really worth going beyond that._ 2. _Second optional alternative: after getting 50 ranging with either method, do A Night at the Theatre to lamp Ranging three times (60k xp total), then use either method to train to level 62 after. You will probably need someone to carry you for A Night at the Theatre, but this is going to be true even if you go at some later point._ 3. Buy an upgraded device from Ava at level 50 (worth leaving for). 4. At level 60 you can equip your mixed hide boots. 5. [Osrs 1 Def Pure Chinning guide and Experience rates](https://www.youtube.com/watch?v=6UuFi3OOQmg) and [OSRS Pure Chinning Guide (Maximizing XP rates)](https://www.youtube.com/watch?v=0kUYAVc4QVg) show the mm1 tunnel method, though it is better to use a spot one curve deeper into the cave. The best location is shown (poorly) in [this image](https://drive.google.com/file/d/1xEUAySR-eE490VBDjNsymEquWXDByJra/view?usp=sharing). 6. Optional: go do the Fight Caves for a fire cape. It will take quite a long time to get one, so we recommend getting one on step 27 of Chapter 3 instead. But if you feel confident and want one soon, this is the best moment.",
        "meta": {
          "gp_stack": "1.9m gp",
          "items_needed": "green/blue d’hides, box traps, knife, teak log, salve amulet(ei), whatever other ranged gear you can scrounge up",
          "skillsquests_met": "yes",
          "total_time": "24d13h"
        }
      },
      {
        "number": 7,
        "content": "You will be doing floor 3 runs until 82 agility. Along the way you want to loot certain coffins for hallowed marks and generic loot. It is optional but recommended to continue all the way to 98 agility instead. The following coffins are recommended: 1. On floor 3, loot the enchantment obstacle (only on the **ONE** side, [20240224_F3_Enchant_West.png](https://drive.google.com/file/d/1-q9jW2J46BBdQ8Qh2f9QRS0AwfoEv9jt/view?usp=drive_link), so on 50% of all runs). With a Hallowed focus (costs 100 hallowed marks) you will never fail the enchant and it will default to the lowest level enchantment spell you have on you. Without one the fail rate depends on the level of the spell and it will default to the highest one you have on you. It is recommended to use lvl-5 enchant before you have the focus, and lvl-3 enchant after. The XP gained for each spell is the same, regardless of level. 2. On floor 3 each side has a grapple ([20240224_F3_Grapple_West.png](https://drive.google.com/file/d/1l38Wk-sdHPmi3ahadbpa511LA6nuMpFH/view?usp=drive_link), [20240224_F3_Grapple_East.png](https://drive.google.com/file/d/1C4mKTsH7Usv8Wtj0y69DXl-boUr215Bo)). You may choose to loot these right from the start, but failing them loses a lot of time. If you collect the Hallowed grapple (costs 100 hallowed marks) it is optional but not recommended to loot these until level 82 to speed up getting other loot. 3. Floors 1-2 are not worth looting, although if you are chasing collection log slots you have to loot these too. [20240224_F2_Grapple_West.png](https://drive.google.com/file/d/1-mHEJrSrEDFlxy26XKRernodWjdk9dQl/view?usp=drive_link)for floor 2 and see below for floor 1\\. 4. If you are using mahogany planks with rune nails (in BRUHsailer you will not be doing this) to build bridges it is efficient construction xp to build the bridge in floor 1 (on two out of four sides, so on 50% of all runs, [20240224_F1_Bridge_Coffin_West.png](https://drive.google.com/file/d/1lQE2JXt08migxFrMjDeey6oySzCA4Lsb/view?usp=drive_link)) but not to cross it. Alternatively this is required if you are hunting the collection log slots. 2. Based on the above, the recommended order for purchasing the Hallowed items is Focus \\> Instances \\> Ring \\> Hammer \\> Grapple. If you have banked vampyre ashes it is worth buying the Hallowed symbol and using them on floor 4 only. It is not efficient to collect vampyre ashes. You may always buy a few Hallowed tokens in case of a terrible run, so that you may finish it in time (and buy new tokens after). 3. You will be doing Fletchp*alch*re (fletching headless arrows and casting high alchemy while moving at sepulchre). Feel free to bring the herb sack and plank sack. Maintain hourlies. It is also possible to blow glass inside the sepulchre, this is even more efficient than other multiskilling options. Most of the time is spent alching, not fletching. 4. Once you have a little bit of cash restart misc to get teak logs for planks for building bridges (2400 total, 8 days). 10 teak 5 herb(/other) at Misc, along with 10 mahog 5 herb(/other) for future bird runs if you run low/out. Keep in mind that changing the Miscellania allocation works retroactively. 1. Keep misc running even if you have enough planks for Sepulchre. Once you have enough planks, swap to 10 mahogany 5 herb(/other) for future construction training. As your cash stack grows just dump 7.5m in there (we will assume this going forward). 2. You will only need these teak planks by the time you hit 82 agility, not before then. 5. After Misc is up and running, buy arrow shafts and headless feathers (in smaller chunks) to get to a total of 1 million headless arrows through fletchpalchre. 6. Alch (all) rune bolts for good magic xp along the way. 7. We recommend buying the initial helpful items first and then spending all further hallowed marks on hallowed crystal shards (the teleports) or saving them in case of a buff/change to the shop. 8. If you want a change of pace you can afk mine daeyalt essence for runecrafting later. There is also a high effort daeyalt (“dae-alch”) method: [https://streamable.com/it7kry](https://streamable.com/it7kry). 9. You can do this grind in smaller parts, or quit entirely at a lower agility level. [Example setup here.](https://drive.google.com/file/d/1TVUPrJca_Wau7msvkiuMtZTvJagXbyRY/view?usp=drive_link)",
        "meta": {
          "gp_stack": "3.6m gp",
          "items_needed": "crossbow, Sara items, hammer, fire staff, nature runes, a lot of money (obtained during the step, spent during the step).",
          "skillsquests_met": "yes",
          "total_time": "25d4h"
        }
      },
      {
        "number": 74,
        "content": "Do Blast Mining [https://streamable.com/l3ylry](https://streamable.com/l3ylry) to get to 330 addy ore total, buying the dynamite from the shop as needed. Hybrid ore uim smelt ([Hybrid ore UIM smelting](https://www.youtube.com/watch?v=wfBdN77X130)) your mithril from MLM. Smelt your gold ore from MLM. Use the UIM gold method ([Lazy UIM Gold](https://www.youtube.com/watch?v=jLtU98HE1bA)) to train your smithing to level 70, getting permission from the foreman to use the blast furnace for free at level 60\\. Turn all your mithril bars into platebodies (Varrock west anvils, make 10 bars into 150 nails, make a mithril 2h sword for Devious Minds and \\~5 bars into grapples along the way), then alch them (similar to before). Hybrid ore uim smelt your addy (buy coal as needed) into bars. Use UIM gold to train your smithing to (15,000 xp away from) level 74\\. Make sure to equip your ring of charos (a) until level 60 for reduced foreman costs. Start and complete Defender of Varrock (there’s a free 5k xp lamp after the quest at Historian Minas in the Varrock Museum, put it on slayer if you aren’t level 58 yet and herblore otherwise). Make 4950 adamant nails (make sure to save an adamantite bar) with your bars at Varrock west anvils. 1. Optional: you can go to level 70-73 only and boost for making the nails instead. 2. After this create 5 mithril grapples and complete and collect the rewards for the Ardougne medium diary, the Kandarin medium diary, the Lumbridge & Draynor medium diary (all lamps on slayer) and complete the grapple step for the Falador medium diary. 3. Now that you have a mithril grapple you can do the quests The Curse of Arrav and The Path of Glouphrie. It is recommended to do them now, but you can also leave them for later.",
        "meta": {
          "gp_stack": "1.9m gp",
          "total_time": "25d22h"
        }
      },
      {
        "number": 75,
        "content": "_Note: if you are not planning to max you can reduce this step, although the lack of prayer potions might prove to be an issue for slayer later. You will also need to obtain more planks and train construction at your own convenience if you do not go to at least level 96 agility during this step. That being said, 98 agility at Sepulchre is a loooong grind, so give serious consideration to reducing/splitting it._ **Read this step in its entirety carefully. This step contains a huge Hallowed Sepulchre grind.** 1. After level 82 agility you are good for a while, but there is no real reason not to continue at Sepulchre. It is optional but recommended to continue all the way to 98 agility. The following coffins are recommended: 1. Floor 4 has a bridge (only on **ONE** side, [20240224_F4_Bridge.png](https://drive.google.com/file/d/1mukzsxluTSC_5_WFc5-L-N8cjQ0DtK4L/view?usp=drive_link) so on 50% of all runs). With a Hallowed hammer you will never break nails while attempting to build this bridge, and it is highly recommended to buy this hammer before reaching level 82 agility. 2. Floor 4 has an enchantment obstacle (only on **ONE** side, [20240224_F4_Enchant_and_Bridge.png](https://drive.google.com/file/d/1GAWKq9nYm73goXncshJlDBT658r71Bwd/view?usp=drive_link) so on 50% of all runs). If you have (and continue to be) tick perfect this is not worth looting, as it means you will lose the timing for ‘sword skip’ (and the 1:20-1:23 lap time) on the next section. If you are not tick perfect up to this floor the enchantment obstacle is efficient to loot, and works identically to that on floor 3\\. 3. Floor 5 always has an enchantment obstacle [20240224_F5_Enchant.png](https://drive.google.com/file/d/1-3bo0ZphU2vj83m3LqaO7ucVpUwLuRRv/view?usp=drive_link), a grapple obstacle [20240224_F5_Grapple.png](https://drive.google.com/file/d/1aqPi5c_nvITWZFejwzsVsO7VzE90IUYU/view?usp=drive_link) and a bridge obstacle [20240224_F5_Bridge.png](https://drive.google.com/file/d/1oOIRFIRyMkpPOnYR1sRhgZcwQs8IyANk/view?usp=drive_link), followed by a grand coffin [20240224_F5_Grand_Coffin.png](https://drive.google.com/file/d/1vV-j1q8sf_gpyVn56z8Dr9tb9H9zq5bb/view?usp=drive_link). Every single one of these is efficient to loot. 4. Floors 1-3 are not worth looting anymore, although if you are chasing collection log slots you have to loot these too. If you are using mahogany planks with rune nails (in BRUHsailer you will not be doing this) to build bridges it is efficient construction xp to build the bridge in floor 1 (on two out of four sides, so on 50% of all runs, [20240224_F1_Bridge_Coffin_West.png](https://drive.google.com/file/d/1lQE2JXt08migxFrMjDeey6oySzCA4Lsb/view?usp=drive_link)) but not to cross it. 2. You will be doing Fletchp*alch*re (fletching headless arrows and casting high alchemy while moving at sepulchre) all the way to 98 agility. Feel free to bring the herb sack and plank sack. Maintain hourlies. It is also possible to blow glass inside the sepulchre, this is even more efficient than other multiskilling options. Most of the time is spent alching, not fletching. 3. After Misc is up and running, buy arrow shafts and headless feathers (in smaller chunks) to get to a total of 1 million headless arrows through fletchpalchre. 4. Alch (all) rune bolts for good magic xp along the way. 5. We recommend buying the initial helpful items first and then spending a lot of hallowed marks on hallowed crystal shards (the teleports). Doing this for levels 82-98 will on average grant the following loot and xp: 1. \\~24.5m gp (not including the costs for fletching, nature runes, planks etc) 2. 565k thieving xp, 444k construction xp, \\~600k fletching xp and 3.2m magic xp (primarily through alchs). 3. 6.1k cosmic runes (these are useful for enchanting bracelets for gp and jewellery for general use later) 4. 8.1k death runes 5. 44.7k law runes (these serve no long term purpose but can be used to fill a nexus, for example) 6. 44.7k blood runes (a good initial stack for barraging during slayer) 7. 44.7k soul runes (these have some uses for Arceuus and barrage spells, as well as being required for Tumeken’s Shadow eventually) 8. 12.7k adamant bolts (next to useless) 9. 1100 monkfish 10. 102 prayer potions (4) 11. 336 sanfew serums (4) (useful at DKS and the nightmare) 12. 152 grimy ranarr weeds 13. 336 ranarr seeds (\\~2.0k (4)-dose prayer potions when farmed, a good starting supply for slayer) 14. 72 strange lockpicks (for Barrows later, although the meta is to only do a little bit of barrows, using around 5-10 lockpicks) 15. 2.12 Rings of Endurance (88% chance to get at least one) 16. 16.2k hallowed teleport crystals \\- **this is more teleports than you will likely use for banking on the road of all activities combined to maxing, so instead it is a good idea to partially save the hallowed marks (e.g. for future updates, potentially amylase) or spend it on loot sacks.** 6. If you want a change of pace you can afk mine daeyalt essence for runecrafting later. There is also a high effort daeyalt (“dae-alch”) method: [https://streamable.com/it7kry](https://streamable.com/it7kry). 7. You can do this grind in smaller parts, or quit entirely at a lower agility level. [Example setup here.](https://drive.google.com/file/d/1TVUPrJca_Wau7msvkiuMtZTvJagXbyRY/view?usp=drive_link) 8. You can use Parasailer’s Hallowed Sepulchre calculator: [20240115 Hallowed Sepulchre: Looting](https://docs.google.com/spreadsheets/d/1orNUuGmhMWQamytxwrVyZI_c6fLWZH4J0yJX1nRLgXM/edit?usp=sharing) to check your loot, xp, material requirements etc. and customise your strategy. A few notes: 1. This calculator only works for levels 82+, and does not include f1 bridge building for xp. If you wish to build this bridge adjust the number of bridges per run afterwards manually. 2. The sheet is default set to sell law and soul runes. To fix this go into the ‘High’ tab (bottom left) and uncheck the boxes for selling those runes. 9. The floor 4 brazier, [20240224_F4_Ash_Coffin.png](https://drive.google.com/file/d/1XBB2mAIQwKKakNe62b0fx9gP46q8LGiE/view?usp=drive_link), is not recommended as it is not efficient to collect the ash in the first place. If you already have some this is the best use for it though, after buying the hallowed symbol.",
        "meta": {
          "gp_stack": "22.5m gp",
          "items_needed": "crossbow, Sara items, teak planks, addy nails, hammer, fire staff, nature runes, a lot of money (obtained during the step, spent during the step).",
          "skillsquests_met": "yes",
          "total_time": "34d22h"
        }
      }
    ]
  },
  {
    "id": "2.3",
    "title": "Wait there’s even more quests? And one of them is Song of the Elves?",
    "totalTime": "Unknown",
    "steps": [
      {
        "number": 76,
        "content": "At your own convenience make Catherby POH tabs for your herb runs (at the lectern on Lunar Isle). If you have reached level 70 fletching at Sepulchre (or are close enough you are willing to boost for it), teleport to Seers village and complete the Kandarin Hard diary, doing all remaining steps sequentially and putting the lamp on slayer. Remember that the goal is to lamp to 58 slayer, then go back to lamping herblore. Build the following in your POH, boosting when necessary: 1. Marble lectern 2. Spirit tree 3. Teak armour case 4. Mahogany cape rack 5. Teak fancy dress box 6. Mahogany magic wardrobe 7. Oak toy box 8. Teak treasure chest 9. One or two portal rooms (optional) (2 limestone bricks and 9 teak planks per room, plus 100x the teleport runes cost) 10. **The total item requirements for this are: 1 marble block, 1 magic stone, 1 gold leaf, 1 spirit sapling, 19 oak planks, 17 teak planks, 8 mahogany planks.** 11. If you have a fish barrel, move your POH to Brimhaven (move it back after), then buy a few thousand (between 2,000 and 10,000 recommended) raw karambwans using the barrel method in this video: [https://www.youtube.com/watch?v=zDkz186YgME](https://www.youtube.com/watch?v=zDkz186YgME). Karambwans are the best food at all levels, and give incredible cooking xp (using a method called ‘1t bwan cooking’). See [OSRSRecklessLadHowDoesFoodWorkV2.png](https://drive.google.com/file/d/1Xn4YfME8C4Gqm5A5qh-T9f0-XHN4_2CQ/view?usp=share_link)for information on how food works.",
        "meta": {
          "gp_stack": "20.7m gp",
          "items_needed": "crystal saw, hammer, items mentioned above",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 77,
        "content": "Do the Mage Arena I miniquest, followed by the Mage Arena II miniquest. Pick your favourite god (Zamorak is slightly more useful than the others for protection in the God Wars Dungeon, but any choice is fine). Along the way/after mine a mithril ore at the Pirates’ Hideout mine and complete a lap of the Wilderness Agility course. Kill Chaos dwarves for a muddy key, open the muddy chest in the centre of the Lava Maze. Kill an ankou at the Forgotten Cemetery, then enter the God Wars Dungeon (god wars protection is necessary\\!) and kill a bloodveld 1. Optional: if you want multiple upgraded capes you can kill the bosses of Mage Arena II multiple times to obtain more capes. 2. After completing the minigame you can high alch the staff.",
        "meta": {
          "gp_stack": "20.7m gp",
          "skillsquests_met": "yes",
          "total_time": "35d1h"
        }
      },
      {
        "number": 78,
        "content": "Make sure you have finished the Curse of the Empty Lord miniquest (if you haven’t, do it now, putting the lamp on slayer). (POH) teleport to Rellekka, start The General’s Shadow miniquest. Teleport to Seers and speak with Sin Seer, then teleport to Rellekka and speak with the general again. Make your way to Lunar Isle. Start and complete Dream Mentor (lamp on ranged). Swap to the Lunar spellbook, teleport to Waterbirth, visit Jatizso and mine 5 adamantite ores after this step for two diary steps. POH teleport, make a super defence potion in Rellekka and collect the Fremennik hard diary, putting the lamp on slayer. Swap to Arceuus spellbook. Teleport to Draynor Manor and run out west for a scout for The General’s Shadow.",
        "meta": {
          "gp_stack": "20.7m gp",
          "skillsquests_met": "yes",
          "total_time": "35d2h"
        }
      },
      {
        "number": 79,
        "content": "Do Zogre Flesh Eaters (on Arceuus spellbook, use dueling rings and fairy rings for speeding up the quest), killing Zogres along the way for Rag and Bone Man II. Make sure to unlock Uglug’s Stuffsies. Swap to the normal spellbook for the Slash Bash fight to use Crumble Undead. Make a composite ogre bow (comp ogre bow) and 150 mithril brutal nails, kill 125 chompies for the diary. Speak with Rantz to collect a (handful of) Chompy bird hat(s). 1. Collect the Western Provinces easy and medium diaries at your own convenience, putting the lamps on slayer.",
        "meta": {
          "gp_stack": "20.7m gp",
          "skillsquests_met": "yes",
          "total_time": "35d6h"
        }
      },
      {
        "number": 80,
        "content": "Teleport to Varrock, take the spirit tree to The Grand Tree. Run south and meet the scout outside the gate for The General’s Shadow. POH tab to Brimhaven, run to The General’s Shadow scout north of Shilo village and progress the miniquest.",
        "meta": {
          "gp_stack": "20.7m gp",
          "skillsquests_met": "yes",
          "total_time": "35d6h"
        }
      },
      {
        "number": 81,
        "content": "Fairy ring to Zanaris, resume and complete Fairytale II \\- Cure a Queen (xp on slayer). Take fairy ring BIQ to the desert and meet up with the scout for The General’s Shadow.",
        "meta": {
          "gp_stack": "20.7m gp",
          "skillsquests_met": "yes",
          "total_time": "35d6h"
        }
      },
      {
        "number": 82,
        "content": "Teleport (tab) to Rellekka, speak with General Khazard to give him the message and get a severed leg.",
        "meta": {
          "gp_stack": "20.7m gp",
          "skillsquests_met": "yes",
          "total_time": "35d6h"
        }
      },
      {
        "number": 83,
        "content": "Teleport to Lumbridge. Go into the Dorgeshuun mines and start Land of the Goblins. After being teleported to the goblin caves, finish The General's Shadow, then continue Land of the Goblins and complete it in full (the transportation is awkward, you could swap to the Lunar spellbook but there is no good way to Draynor in that case. There is a crate with an unlimited supply of goblin mails directly east inside the temple, beyond the guards).",
        "meta": {
          "gp_stack": "20.6m gp",
          "skillsquests_met": "yes",
          "total_time": "35d6h"
        }
      },
      {
        "number": 84,
        "content": "Complete the Kourend Medium diary and cash in the reward (lamp on herblore).",
        "meta": {
          "gp_stack": "20.6m",
          "total_time": "35d7h"
        }
      },
      {
        "number": 85,
        "content": "Kill the following for Rag and Bone Man II, then complete the quest: 1. Ogres (fairy ring CIQ). 2. Mogres (fairy ring to AIQ, only spot), complete ‘Skippy and the Mogres’ in full for this. 1. _Optional but recommended: keep killing these to collect flippers for seaweed runs_ 3. Basilisks (fairy ring to AJR, only spot). 4. Trolls (if you didn’t get it along the way during questing).",
        "meta": {
          "gp_stack": "20.6m gp",
          "items_needed": "melee gear, prayer potions, mirror shield, law runes, soul runes, dramen staff, fishing explosives",
          "skillsquests_met": "yes",
          "total_time": "35d7h"
        }
      },
      {
        "number": 86,
        "content": "Go to Edgeville dungeon, run into the wilderness and collect 5 red spider’s eggs (you can drop and pick up the same one five times), cross the handrail and kill an earth warrior. Go back to Edgeville, speak with the Emblem Trader. Collect the easy and medium wilderness diary rewards, putting the easy lamp on slayer (level 58 without the kandarin hard diary\\!) and the medium lamp on herblore.",
        "meta": {
          "gp_stack": "20.6m gp",
          "skillsquests_met": "yes",
          "total_time": "35d7h"
        }
      },
      {
        "number": 87,
        "content": "Do Grim Tales. Use the tool leprechaun to withdraw your watering can/seed dibber mid-quest. After the quest, at some point enter the Falador mines, equip your dwarven helmet for the diary. Alch it after.",
        "meta": {
          "gp_stack": "20.6m gp",
          "items_needed": "2 vials of water, 2 tarromins, leather gloves, rune axe, cheese potatoes, Iban staff, death runes, fire runes, water runes, air staff, law runes, dueling ring, prayer pots, energy pots",
          "skillsquests_met": "yes",
          "total_time": "35d8h"
        }
      },
      {
        "number": 88,
        "content": "Do Rum Deal (return with Ectophial), killing a fever spider along the way for the diary. Do Cabin Fever (speak with Bill Teach after the quest for 10k gp) and complete a game of trouble brewing (recommended: do the watering buckets only strat to get enough points to buy “the stuff” for future brewing).. Do The Great Brain Robbery (put the lamp on Herblore). Complete the Morytania medium diary (and easy if you haven’t yet), putting the lamp(s) on Herblore.",
        "meta": {
          "gp_stack": "20.6m gp",
          "items_needed": "Ectophial, melee gear, cheese potatoes, prayer pots, stat-boosting pots, energy pots, fishbowl helmet \\+ diving apparatus, 18 planks, 10 bear fur, hammer, holy symbol, ring of charos(a), bowl, 15 chaos runes, law runes, fire runes, air staff, rune axe, fremennik boots",
          "skillsquests_met": "yes",
          "total_time": "35d10h"
        }
      },
      {
        "number": 89,
        "content": "Make sure you have a runite bar (if you do not you have three options: 1\\) hunt Magpie implings in Puro Puro; 2\\) kill Vyrewatch Sentinels for 1/46.5; 3\\) trade rune platelegs for one at [Nest (nice) \\- OSRS Wiki](<https://oldschool.runescape.wiki/w/Nest_(nice)>)). Do the entire elf quest line: Regicide, Roving Elves, Mourning’s End Part I, Mourning’s End Part II, Song of the Elves. Pick the crystal bow reward from Roving Elves. You have all but one item on the regular part of the 50 item list for MEPII – you are missing unicorn horn dust (and whiteberries if you didn’t save any). Furthermore you need the randomly chosen ticket, book and key (all are easy to obtain). You may also want a spare hammer and chisel. Also make sure to farm belladonna(/nightshade) in the Draynor patch to collect at least 8 nightshades for the Seren fight (optional: use explosive liquid from the digsite instead), and also buy blood+death runes and make 6-10 phoenix necklaces. 1. _Check out the quest guides for complicated steps, use ancients \\+ phoenix necklaces and nightshade/belladonna for the Seren fight._ 1. **_Rock cake and ds2 orb do work in the Seren fight, contrary to wiki and other sources. However, activating them is negated when there is a ranged projectile incoming (this is normal behaviour for these items). This means you can use them to maintain your hitpoints level, but cannot use them to proc the phoenix necklaces during special attacks._** 2. _Example clip: [OSRS Song of the Elves boss with phoenix necklaces (no brews)](https://www.youtube.com/watch?v=7kccSC5VM8s)_ 3. _If you are really struggling with the Seren fight an alternative option is to make several Guthix Rests which don’t delay your next attack when drunk, and also make it very easy to manage your HP during the fight for phoenix necklace procs._ 4. [Fragment of Seren written guide](https://docs.google.com/document/d/1y4fh4-oWjLiIRKht3mt_MOG5M-GQJiw9RtLEZhwYEjQ/edit#)explains the methods for defeating the Fragment of Seren in detail on a low level ironman. Quests missing for quest cape: Dragon Slayer II Monkey Madness II The Fremennik Exiles A Night at the Theatre Beneath Cursed Sands Devious Minds Secrets of the North Desert Treasure II While Guthix Sleeps Miniquests missing: The Enchanted Key Family Pest The Frozen Door In Search of Knowledge Into the Tombs His Faithful Servants Hopespear’s Will Stats: - Atk: 60, Str: 77 Def: 70, HP: 60, Ranged: 62, Prayer: 70, Magic: 89 - RC: 38 - Cons: 71 - Agil: 98 - Herb: 74 - Thieving: 84 - Crafting: 65 - Fletching: 69 - Slayer: 57 - Hunter: 82 - Mining: 75 - Smithing: 74 - Fishing: 99 - Cooking: 81 - Firemaking: 89 - Woodcutting: 73 - Farming: 94 Overview document: [BRUHsailer](https://docs.google.com/document/d/1CBkFM70SnrW4hJXvHM2F1fYCuBF_fRnEXnTYgRnRkAE/edit?usp=sharing) Chapter 1: [20241231Chapter1](https://docs.google.com/document/d/1gCez5XG5FA1kmmBYydur3RaI_cr-dYNJlnigRrByEX8/edit) Chapter 2: [20241231Chapter2](https://docs.google.com/document/d/1YQiZ6curEYPpgm3DtjZcWHPoEEkGpYdXZ-I0gCM5p10/edit) Chapter 3: [20241231Chapter3](https://docs.google.com/document/d/1O1VeAkwS6VAzGVy0GT205GqiNaOAbw17H5uyuMwz39o/edit?usp=sharing) Detailed math on every single step: [20240110DetailedStepsGuide](https://docs.google.com/spreadsheets/d/1XZ-3Kja7_QS4Rxj4mJXeATXHBP03lrdUSt46gO3pWHk/edit#gid=1506136399) Parasailer’s image folder: [bruhsailer](https://drive.google.com/drive/folders/1mqirlAU0Pk5OGI5V8NN9BhHKIeGwG1Ea) **OLD VERSION:** Chapter 1: [20210715Chapter1](https://docs.google.com/document/d/1W4CiIPnVMDS1eqBOYbMOwViDDlJsZTeMyEl_f-432EM/edit?usp=sharing) Chapter 2: [20210715Chapter2](https://docs.google.com/document/d/1l9fp00nMLOA_eLBrPI7_2dzVW5MsAu8Qahmp7wEBnLw/edit?usp=sharing) Chapter 3: [20210930Chapter3](https://docs.google.com/document/d/19UjEKjUL_7uuEiNAF2hrPIV4vqKb47Fo4rGyMmKKhWI/edit?usp=sharing) Detailed math on every single step: [20210930DetailedStepsGuide](https://docs.google.com/spreadsheets/d/1BfGt4T3T7gKmtpjdLXmjengEpXjtodX0tsrjU4ToTto/edit?usp=sharing) **Beware compatibility issues when hopping over\\!** [20230201BRUHsailerChangeLog.txt](https://drive.google.com/file/d/1QESAPNUXERN-OCo7EMzS5p-5wPMvU0Dy/view?usp=share_link)",
        "meta": {
          "gp_stack": "20.6m gp",
          "items_needed": "follow the wiki; the entire quest line is basically linear (no choice)",
          "skillsquests_met": "yes",
          "total_time": "35d18h"
        }
      }
    ]
  },
  {
    "id": "3.1",
    "title": "Slayer and the red prison",
    "totalTime": "X hours, Y mins",
    "steps": [
      {
        "number": 1,
        "content": "If you are running low on/out of (redirected) POH tabs collect more soft clay using the gravestone method in the prifddinas mine [Gravestone Double Soft Clay (2400/hr)](https://www.youtube.com/watch?v=gEYQuCf56Q0). You will have to make soft clay bracelets first. Go to NMZ (optionally as an afk activity) to collect redirection scrolls as necessary. It is recommended to collect a good stack (i.e. 500 tabs and 250 scrolls). Also make Catherby tabs for herb runs.",
        "meta": {
          "gp_stack": "21m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 2,
        "content": "Optional but recommended: go to the Mage Training Arena and collect the Mage’s book and the infinity boots.",
        "meta": {
          "gp_stack": "21m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 3,
        "content": "Using your mahogany logs from Miscellania, train construction to level 75 (do not go higher for now). Build the following in your POH, boosting when necessary: 1. Dark altar 2. Basic jewellery box 3. Rejuvenation pool (if you somehow have the staminas) 4. Mahogany armour case 5. Mahogany fancy dress box 6. Gilded cape rack 7. Gilded portal nexus (optional but not recommended) 8. **The total item requirements for this are: 1 Arceuus signet, 1 bolt of cloth, 1 steel bar, 3 games necklaces(8), 3 rings of dueling(8), 8 marble blocks (for the gilded portal nexus), 3 gold leaves (of which two are for the gilded portal nexus), 1 magic stone, 15 limestone bricks, 5 buckets of water, 6000 soul runes, 5000 blood runes, 1000 body runes, 10 stamina potions(4), 10 prayer potions(4), 11 mahogany planks.** 9. _Note: if you want to have a rejuvenation pool (or the likes) in your POH feel free to do some rooftops, for example force spawning (see later in the guide for the best method), for marks of grace to get the required items._",
        "meta": {
          "gp_stack": "16m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 4,
        "content": "Now that you have daeyalt mining [https://streamable.com/it7kry](https://streamable.com/it7kry) unlocked, mine 28k daeyalt essence (you can also just afk mine this). Make 275 binding necklaces, 175 rings of dueling, a fire tiara, buy 28k earth runes (if needed). Swap to the Lunar spellbook. Using magic imbue, your binding necklaces and hallowed crystal shards (teleports) for banking, lava runecraft to level 65\\. 1. Complete the Lumbridge Hard diary, putting the lamp on herblore. 2. Complete the Ardougne Hard diary (also requires a shield left half).",
        "meta": {
          "gp_stack": "16m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 5,
        "content": "Camp Cave Horrors off-task for a black mask (protect melee allows an amulet of strength, so use your regular slayer gear, proselyte hauberk versus torso is fine either way, use thralls, take your herb sack). Start and complete the Morytania Hard diary (lamp on herblore). Visit Robin twice a day with 13 bones each time to collect 130 ectotokens for bonecrusher charges (3250 charges per day \\- you will need 24k charges to complete step 10\\) – collect the bones on any slayer task (for example regular/big/baby dragon). Imbue your black mask at the PVP Arena ([imbue scroll via pvp arena - losing method](https://www.youtube.com/watch?v=OORAXLhdZAg)) or nightmare zone. An example setup (except for the black mask and expeditious bracelets, obviously) is[cave-horrors.png](https://drive.google.com/file/d/11QY9VWu3uEXwlBvIVnRpSfQLiKpdiQeZ/view?usp=drive_link). The recommended spot is [cave-horrors.png](https://drive.google.com/file/d/1zlpzRkYsRHNBEEwzd8nMzB5sclLYpNM5/view?usp=drive_link)(northwest from the entrance).",
        "meta": {
          "gp_stack": "16m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 6,
        "content": "Buy 2300 sand (the goal is to get to level 70 crafting, each sand is approximately 88.1 xp) from the grinder (buy bucket packs as needed, e.g. at Alice’s farming shop near the ectofuntus). Superglass Make them into glass (18:3 no pickup). Blow all the glass into unpowered orbs doing artefacts, i.e. doing arteglass, to get to level 70 crafting. Do Pyramid Plunder for one (or two, it is recommended to get the second at/after level 91 thieving) sceptre(s) using the sceptre \\+ xp method \\- all chests, sarcs in level 51+ rooms, urns in the level 81 room optional. Collect gold artefacts along the way \\- just bank them when your inv fills up, you’ll only need \\~200 or so later. 1. [Example setup for xp method pyramid plunder.](https://drive.google.com/file/d/1671P3EZBySXheDDXHdpcaRUS9HDU7RqP/view?usp=drive_link) 2. **Method for efficient pyramid plunder at levels 81-90:** 1. World hop to find a world with a North mummy room. The mummy resets every now and again, hop to find a new world. 2. On all but the last room do chest first then check the doors, ignore the urns. On the last room do urns first, then chest, then leave. 3. Room 1: doesn't matter if you go west or east first, I always went east first. 4. Room 2: just go clockwise (east first) 5. Room 3: east first 6. Room 4: southwest first, then clockwise 7. Room 5: after chest, do northwest door, then southwest, then south, then east 8. Room 6: If you're level 90 or below, do urns counterclockwise (start with the one two tiles north of the sarcophagus). Make sure you go for the chest when the timer hits around 2:20. If you're level 91 or above, open doors counterclockwise (starting southeast) 9. Room 7: loot the urns as you encounter them (south to north, then along the south wall around the chest). Open the doors clockwise starting east. 3. If you haven’t already, it is worth making \\~100 superantipoison potions (kill cows, for example at the crafting guild, to get cowhides, then use the Tower of Life to make unicows for noted unicorn horns, then make superantipoison potions). You can use a gravestone method to transfer the supplies required to the Tower of Life, though this requires a decent (28-42) initial supply of both hides and horns so it is probably not useful for just this step. 4. Use (super) energy potions and/or vile vigour for this. If you want to get full graceful first you could force spawn for it, though it’s not as good without the Ardougne elite diary.",
        "meta": {
          "gp_stack": "16m",
          "items_needed": "Superantipoison potions, any food",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 7,
        "content": "Train slayer to get to 100cb. Your target stats are 78 Attack, 85 Strength, 75(+) Defence and 72(+) prayer, which should probably give you 78(+)Hitpoints and \\~75 Slayer around the time you hit 100cb. 1. Keep Strength around 10-15 levels ahead of Attack until it hits 83\\. At level 75 Attack make Arclight. Generally you only use accurate/aggressive/shared and get your bulk defence xp from defensive cast barrage tasks. Use piety whenever you’re using melee. 2. If you get an amulet of glory from dragon imps along the way use it for magic slayer tasks, not melee ones. 3. Unlock Broader Fletching. If you happen to get to a good slayer point situation, purchase the slayer helmet and complete the Desert Hard diary. 4. At level 90 magic you can use divine magic potions to stay at level 94 for entire (barrage) tasks and use ice barrage, if not you’ll have to use smoke barrage for ankou/dust devils and ice burst for dagannoths. Make sure to cast the spells on defensive. 5. Check out [20241231SlayerGuide](https://docs.google.com/document/d/1kBMW2uRI8b4NBcYn9PmsedTnZ3yW7fuGwdzsRQSCNkk/edit?usp=sharing) for advice on efficient slayer at this point. 6. If you (somehow) do not have runes for thralls or barrage, buy them. 7. Use your Pharaoh’s sceptre to teleport to the ancient magicks pyramid (Jaldraocht) to swap to the ancient spellbook when needed, and your POH Dark altar to swap to Arceuus when needed. When your sceptre is at 1 charge teleport to Pyramid Plunder (Jalsavrah) with 6 gold artefacts to recharge it to 25 charges. 8. At your own convenience, complete the quest While Guthix Sleeps along the way. Grab the 100 magic logs during the quest. Alternatively, postpone the quest until after the Corrupted Gauntlet. 9. Along the way you will hit milestones for the following diaries, complete them at your convenience along the way, putting all lamps on herblore: 1. At any point: save a shield left half (if you get one) for the Ardougne Hard diary 2. 62 slayer \\- Kourend Hard diary 3. 68 slayer \\- Wilderness Hard diary 4. 72 slayer \\- Falador Hard diary 5. Slayer Helmet \\- Desert Hard diary 1. This also requires killing the Kalphite Queen. One of the more efficient ways to do this is by using thralls only, since this also completes the Combat Achievements task of only attacking with a Verac’s Flail. See [0 HP XP Kalphite Queen (Thralls) OSRS](https://www.youtube.com/watch?v=6xWt3ze0SCU)or [OSRS 'Prayer Smasher' Elite Combat Achievement - Without Verac's Flail](https://www.youtube.com/watch?v=OZBA2BEQfTI)for example kills. Keep in mind you need to **splash** all the grasp attacks. 6. 100 combat level \\- Karamja Hard diary 1. After completing the Karamja Hard diary, mine gems in the underground gem mine, cut them in the bank, sell them for trading sticks at Gabooty (10 opal/10 jade/1 red topaz per world, wear your Karamja gloves) to get 100k trading sticks. In total this takes 520 cut opals, 520 cut jades and 52 red topazes (keep additional red topaz and a good amount of opals for slayer bracelets. Buy 10k karambwans at Tiadeche (using a Ring of Endurance, Vile Vigour and three client hopping for the best rates), banking with Rionasta’s parcel service. Video: [Shopscape Karambwans](https://www.youtube.com/watch?v=k76D_ps2ur0). Do the Kourend & Kebos Hard diary (lamp on RC), then cook the karambwans at your convenience (1t cooking at the Hosidius range is best, cooking gauntlets do not work on karambwans). 1. Alternatively, use the (less macroefficient but faster) Yazota/Brimhaven POH portal method for buying bwans [https://www.youtube.com/watch?v=zDkz186YgME](https://www.youtube.com/watch?v=zDkz186YgME)) instead, which requires the fish barrel. 7. 100 combat level \\- Western Provinces Diary (included for completeness, ignore this diary for now). 10. **Along the way complete a long list of Combat Achievement diary tasks, exported to a separate document for readability. [20240131CombatAchievementPointReworkCA](https://docs.google.com/spreadsheets/d/1DYmWr1ka-BLWccgFy6C4zhpDmpuZh_rbCBBmiQq3F9k/edit?usp=sharing) shows a list of all tasks that can be included at or before this step. [CA's during Chapter 3 step 07](https://docs.google.com/document/d/199VVet0wIavN67O5LlTOqyslMVA8q0kuKV2VuXnpD8M/edit?usp=sharing) is an older document going into more detail on the slayer-related tasks (but note that some of these are no longer recommended\\!). If you are missing any of these tasks by the time you reach 100cb, go do them (stew boosting slayer as necessary). Collect the easy and medium Combat Achievement rewards, lamping herblore.** 1. Complete His Faithful Servants along the way.",
        "meta": {
          "gp_stack": "13m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 8,
        "content": "Buy broad arrowhead packs with most of your money (leave \\~500k in reserve, buy the broad arrowtip packs at any slayer master, if you are opening fast enough the stock will slowly deplete. Hop worlds if the stock ever hits 700 or lower). Do Pest Control, veteran i.e. 100+ cb boat, for enough points for full elite void range (other two helmets optional) while fletching – 1250 points for just ranging, 1650 points for a full set, fletching during the games and only contributing as much as necessary to get points. You can optionally get the other two helmets as well, or ignore them(/consider getting them later).",
        "meta": {
          "gp_stack": "500k",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 9,
        "content": "Do the Fremennik Exiles, A Night at the Theatre (lamps on ranging), Hopespear’s Will. Start Monkey Madness II until you have access to Kruk’s Dungeon (with the Maniacal monkeys). 1. If you don’t have the fremennik shield yet, get it from Bardur with a ring of charos (a).",
        "meta": {
          "gp_stack": "500k",
          "items_needed": "tons and tons of items (these are linear quests so just follow the wiki)",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 10,
        "content": "Optional but recommended: with the Karamja Hard diary completed, 3t gem mine to level 97 mining ([gems route](https://www.youtube.com/watch?v=JCD8mwJVygI)), banking the uncut gems using the deposit box. With multiskill cutting the gems (see below) this is more efficient than 3t4g. This requires a charged amulet of glory\\! If you make one here you won’t have to make one next step. _You may skip this step if you don’t value multiskilling or efficiency enough to take such a long detour/don’t feel like it._",
        "meta": {
          "gp_stack": "52m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 11,
        "content": "Go to Guardians of the Rift, participate in the minigame with the multiskilling method until you are completely out of uncut gems. 1. [Guardians of the Rift - multiskilling](https://youtu.be/vAKese2xurs?list=PL1YmaQEbqW1jX9evljFu_CaJ-w-fueXUs) \\- this video shows a simple example of multiskill Guardians of the Rift \\- you still make combination runes, but focus on skilling rather than participating throughout most of the game (in fact, you only enter the west essence mine when it opens and ignore all other opportunities to collect essence). **The best way** to multiskill is by carrying a gem bag full with uncut gems (60 sapphires, emeralds, rubies and diamonds) into the minigame, taking them out of the gem sack, cutting them and depositing them at the Deposit Pool (which acts as a regular deposit box\\!) one inventory at a time. The point and xp rate will be lower than active GotR, but the crafting xp makes it more efficient. 2. Make an amulet of glory when you have the crafting level (75+5) to make one.",
        "meta": {
          "gp_stack": "52m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 12,
        "content": "Catch 20k red chinchompas behind Prif or 16k black chinchompas (for 92 ranged, if you have extras then can consider throwing for more Ranged XP or using them for your first fire cape if you’re good at speed strats) in the wilderness. Throw the chins in the cave to get to 70 ranging, complete the Western Provinces Hard Diary (this involves getting one Zulrah kill), upgrade your void to Elite, (optionally: grab an offtask fire cape at some point along the way), return and throw the chins to get to level 92 ranging. 1. Make sure to use ranging potions and a bonecrusher (with at least 24k charges), your elite void ranged, an amulet of glory, shayzien boots 5, make a red d’hide shield (optional). Use medium fuse. Use protect melee and eagle eye, the regular potion drops will maintain your prayer (but bring a few to be safe, along with a teleport out). If you die your chins will be lost, so be careful and/or only bring a few thousand at a time. 2. [Example setup for catching chins.](https://drive.google.com/file/d/1eSOJso86OOSz9OUz1EX9LN3g7wc3GOHy/view?usp=drive_link) 3. [Example setup for throwing chins.](https://drive.google.com/file/d/12onDZXy9AJmGMmDAim0ttQ_bizlFR8Yo/view?usp=drive_link) Make a blue d’hide shield (optional but recommended). 4. [Example setup for Zulrah diary kill](https://drive.google.com/file/d/1fP7c5bHwjaJkYgOPBoJ9Oa7_EV1HepsU/view?usp=drive_link), using blood barrage(/blitz). [https://streamable.com/l64fsw](https://streamable.com/l64fsw) example kill. 5. [Red chinchompa calculator](https://docs.google.com/spreadsheets/d/122rSf8dpivoZBG5tFNcS7B2DZAdYfi95bt2TJ4N6zPU/edit?usp=sharing)for checking the numbers. 6. If you want to go for a lower ranged level [https://i.imgur.com/j291MJI.png](https://i.imgur.com/j291MJI.png) shows the max hits of the corrupted bow (t3 bow in the corrupted gauntlet) by level with eagle eye, levels 89 and 87 are reasonable alternative stopping points. This will make CG more difficult and slower and also reduce your max hits once you do get the bow though. 7. If you do not want to train with chinchompas (which are best by far) you could alternatively afk it in the nightmare zone. The nightmare zone has super ranging pots, making it the best afk ranged training method by far. The recommended afk range NMZ method is: 1. Wear (elite) void, a magic shortbow (i), rune arrows, amulet of glory, shayzien boots (5). 2. Use the Hawk Eye (10%) prayer, no overhead. 3. Rock cake(/DS2 orb) down to 1hp, use absorption potions, repeat this approximately every 6-9 minutes (it’s fine to go to higher health in between and lose more absorption charges, the goal is to have it afk. Some other guides will recommend resetting every minute or flicking rapid heal, this is a waste of time). 4. Use the super ranging potions (duh), resetting along with the rock cake \\+ absorption pots \\+ prayer pot sips (for hawk eye). 5. Use hard custom rumble (not standard\\!). Bitterkoekje’s [DPS Calculator](https://docs.google.com/spreadsheets/d/1wBXIlvAmqoQpu5u9XBfD4B0PW7D8owyO_CnRDiTHBKQ) has a tab for NMZ DPS on set 1, so verify for yourself. Generally the recommended list of enemies is: 1. Moss Giant 2. Sand Snake 3. Count Draynor 4. King Roald 5. Witch’s Experiment (this choice might depend on level, use the DPS calculator to verify).",
        "meta": {
          "gp_stack": "500k",
          "items_needed": "red/black chins, elite void ranged, ranging pots, glory, shayzien boots 5, red dragonhide shield optional."
        }
      },
      {
        "number": 13,
        "content": "Do Corrupted Gauntlet for 6 armour seeds and one enhanced weapon seed (\\~70 hours) (tip: use longrange on staff hits for defence xp \\- alternatively you can use accurate for \\~0.5% more accuracy, but we think the def xp is more valuable). Maintain hourlies as usual. You should be level 93 ranging after this step. On average, this will also give the following loot: 1. 2,800 crystal shards (it costs 2,300 shards to make a full set of crystal armour and a corrupted Bow of Faerdhinen _\\- train smithing as necessary using GP from CG, see step 17 below \\-_ plus the armour needs charges). On droprate you will get another 580 shards (on top of the 2,800) from trading in excess armour and (regular) weapon seeds (into acorns, grown and chopped down for 14-16 shards each with ultracompost). 2. 51.5m gp profit in gp and assorted alchs (500 battlestaves for which you need to charge orbs, 500 diamonds that need crafting first) \\- it is recommended to make diamond and ruby bracelets but only cut (and then ignore) lower tier gems. 1. _Making ruby bracelets has an effective gp/hr rate of 9m, which is low enough you can consider ignoring them._ 3. 506k crafting xp from cutting and crafting gems and making air battlestaves. 4. 10,6k cosmic runes, 6.9k nature runes, 6.4k law runes, 13.8k chaos runes (sell these for tokkul for future onyxes to make zenytes), 7.5k death runes, 6.3k blood runes 5. 62.5k mithril arrows, 30.6k adamant arrows, 17.5k rune arrows, 3.8k dragon arrows 6. **If you get 6 armour shards and an enhanced weapon seed way earlier, just leave and make up for the lack of gp and resources elsewhere. The Corrupted Gauntlet is only worth for the sake of grinding the Bow of Faerdhinen and its armour.** 7. [How to Farm the Corrupted Gauntlet | Lower your Average Time to 8 Minutes\\!](https://www.youtube.com/watch?v=OxCcXZuwqno)shows a good guide on completing the Corrupted Gauntlet with t1 prep. It is recommended to immediately aim for t1 armour, rather than first learning t2 armour methods and then unlearning those bad habits when settling into the grind later. _Important note: the food advice in this video guide is incorrect, the timing of eating does not matter (with some minor exceptions). It is highly recommended to safe up, i.e. eat every time your HP is 21 or more below your max health at Hunllef._ See also [OSRSRecklessLadHowDoesFoodWorkV2.png](https://drive.google.com/file/d/1Xn4YfME8C4Gqm5A5qh-T9f0-XHN4_2CQ/view?usp=share_link). 8. [McClumpy CG Prep](https://docs.google.com/document/d/12ousKIqC2E7U4bPe6glZH1pkOO1ik52friBPqtIsmws/edit?usp=sharing.) shows an easier approach to t1 prep including prescouting (it is highly recommended to prescout regardless of what else you choose to go for), sacrificing a bit of time per prep to gain lots of consistency. 9. [Corrupted Gauntlet - prepping t1](https://www.youtube.com/watch?v=ylFlK65isQ4) shows a (lousy) example run by the author. 10. During the Hunllef fight focus on positioning \\> overheads \\> eating and drinking egniol \\> attacking \\> offensive prayers. In general you want to be near the middle of the room, so that Hunllef is standing between you and the edge of the room. This gives you maximum flexibility for moving around later.",
        "meta": {
          "gp_stack": "52m gp",
          "items_needed": "none (\\!\\!\\!)",
          "skillsquests_met": "yes"
        }
      }
    ]
  },
  {
    "id": "3.2",
    "title": "Quest cape, quality of life",
    "totalTime": "Unknown",
    "steps": [
      {
        "number": 14,
        "content": "Go to Guardians of the Rift, participate in the minigame until you have the full Raiments of the Eye and the colossal pouch. 1. [Guardians of the Rift - multiskilling](https://youtu.be/vAKese2xurs?list=PL1YmaQEbqW1jX9evljFu_CaJ-w-fueXUs) \\- this video shows a simple example of multiskill Guardians of the Rift \\- you still make combination runes, but focus on skilling rather than participating throughout most of the game (in fact, you only enter the west essence mine when it opens and ignore all other opportunities to collect essence). **The best way** to multiskill is by carrying a gem bag full with uncut gems (60 sapphires, emeralds, rubies and diamonds) into the minigame, taking them out of the gem sack, cutting them and depositing them at the Deposit Pool (which acts as a regular deposit box\\!) one inventory at a time. The point and xp rate will be lower than active GotR, but the crafting xp makes it more efficient. If you are out of/low on uncut gems, instead do: 2. [Guardians of the Rift - mass world, 4 pouches, combination runes](https://www.youtube.com/watch?v=4YT20KdV_mg) (the same method as before). 3. At 65 runecrafting complete the Ardougne Hard diary (also requires a shield left half).",
        "meta": {
          "gp_stack": "52m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 15,
        "content": "Do While Guthix Sleeps if you haven’t already. Start and complete Dragon Slayer II (using your Bow of Faerdhinen to deal with the strong bosses – protect from magic and antifire potions will, when combined, provide decent dragonfire protection except against metal dragons and Galvek where you need the shield plus a rune crossbow), putting Ellen’s XP at the end on Strength. Kill Vorkath up to 50 times to get an Ava’s Assembler. Complete Monkey Madness II (put Duke’s xp on Strength).",
        "meta": {
          "gp_stack": "55m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 16,
        "content": "Do Devious Minds, then Secrets of the North (a bowfa is pretty strong against, well, everything). Do Beneath Cursed Sands (did you know the bowfa works very well against these enemies) and Into the Tombs (don’t make me say it). The best use for the lamp is on strength. Optional but recommended: kill the Phantom Muspah(/Grumbler) for an ancient icon to upgrade your ancient staff (make some mithril sapphire bolts (e) and a rune crossbow for the smite phase). Start and complete Desert Treasure II, putting the xp on prayer. Collect a quest cape. 1. Your best weapons for the four bosses are: 1. Vardorvis: Dragon scimitar (this is going to be rough) 2. Duke Sucellus: Arclight 3. Leviathan: Bow of Faerdhinen 4. Whisperer: Charged god spells (just don’t stand in the wave bro)",
        "meta": {
          "gp_stack": "57m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 17,
        "content": "Use the money from CG to train smithing to level 86 with UIM gold. You’ll need to buy around 42.3k gold ores to get 86 Smithing for all diaries. Convert your cut diamonds and rubies into bracelets (optionally also enchant them, this is technically only worth it if you find a way to ‘0time’ it though) and charge enough unpowered orbs to match your battlestaves, then alch those/cash those in (e.g. at artefacts). Optional: also include ruby bracelets. 1. Optional: you can also train to ‘just’ level 83, so you can \\+5 for the Lumbridge Elite diary. This takes approximately 29.9k gold ores. 2. Optional: complete the Ardougne Elite Diary ‘make a rune crossbow from scratch’ step. If you have the rest of the stats complete the Ardougne Elite diary, this requires doing NMZ for imbuing a salve amulet. 3. Optional but recommended: force spawn some marks of grace, bankstanding processing resources you have (e.g. herbs) to make staminas to help with smithing. Using super energy potions is also fine, and the dropping method of UIM gold doesn’t require any at all.",
        "meta": {
          "gp_stack": "85m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 18,
        "content": "Get a fire cape off task (if you don’t have one yet). 1. _Note: there are many strategies for getting a fire cape. Some suggestions include:_ 1. _Bring blood barrage to heal during the waves, carry your food to the Jad fight._ 2. _Bring vengeance and brews and deliberately tank a mage frog hit regularly to speed up the caves._ 3. _Bring thralls, recasting whenever you move to increase your dps (expensive but fast)._ 4. _Bring spellbook swap, vengeance and thralls to combine 2+3._ 2. [You can find an example setup for the fight caves here.](https://drive.google.com/file/d/1ae7WqLAlL299pVXGPVPk7BwLg7Z3YG6h/view?usp=drive_link) If you have divine ranged potions, use those.",
        "meta": {
          "gp_stack": "85m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 19,
        "content": "Get a dragon pickaxe (if you intend on going for at least partial completion of the Combat Achievements then just hop bosses while going for kc at each of them. At the time of writing it is unclear what the best method is for getting a dragon pickaxe due to the wildy boss update, but the fbow chaos elemental method (thralls, just tank the hits, hop between two worlds) is solid. Alternatively you may wish to postpone it for when you go for the Kq head, hoping to get one along the way. 1. [This is a setup for fbow chaos elemental.](https://drive.google.com/file/d/1py8LgPGPGl_I522ORJqOeoVHubZwO562/view?usp=sharing)",
        "meta": {
          "gp_stack": "85m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 20,
        "content": "Cash your banked herblore XP, using MOGs force spawning at Ardy. Make some staminas for future use. 1. [https://www.youtube.com/watch?v=IuqyCbHuxu8](https://www.youtube.com/watch?v=IuqyCbHuxu8) (newest force spawning marks of grace example video). 2. Older sources: [Force spawning marks of grace on Ardy rooftop](https://youtu.be/3f6agYAVUGY) and [Force Spawning Marks of Grace \\[Explanation + Example\\]](https://youtu.be/1vmsLIOTjc0) show the basics of force spawning marks of grace. However, we have since learned of the exact mechanics of spawning marks ([https://oldschool.runescape.wiki/w/Mark_of_grace\\#Obtaining_marks_of_grace](https://oldschool.runescape.wiki/w/Mark_of_grace#Obtaining_marks_of_grace)), allowing for the best possible method below. The method is stunningly simple: 3. **Every 3 to 9.5 minutes (inclusive, lower is better but don’t be too quick)**, do exactly one lap at Ardougne rooftops, then do other activities at your leisure. A mark of grace will spawn upon finishing the lap (and you will pick it up on your **_next_** lap) 75% of the time. When you are done, do one more lap (so a back to back lap to finish off) to grab the potential final mark. If no mark spawned on a certain lap don’t panic, just keep to the rhythm. Using this strategy you get a mark of grace per 1057.3 xp on average at Ardougne, so that going from level 98 to 99 with this method gives approximately 1160 marks of grace or 2900 (4)-dose staminas **(note: the real number is lower because of agility quest xp rewards collected after level 98\\)**.",
        "meta": {
          "gp_stack": "85m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 21,
        "content": "Complete the remaining tasks for the Falador and Kandarin Elite diaries if you have the herblore level required (boostable 81 and 86 respectively).",
        "meta": {
          "gp_stack": "85m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 22,
        "content": "3s1g mine 30k sand (for level 93 crafting) or 80k sand (for level 99 crafting), buying all the sand (buy bucket packs first to match the amount required). Super glassmake all the sand with previously farmed giant seaweed. Arteglass blow molten glass into light orbs for crafting xp to 91 thieving (this won’t nearly use all your glass). 1. 3s1g mining 80k sand will almost get you to level 99 mining, finish off 99 mining using whatever method you prefer.",
        "meta": {
          "gp_stack": "84m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 23,
        "content": "Optional but recommended: now that you have daeyalt mining [https://streamable.com/it7kry](https://streamable.com/it7kry) unlocked and the full raiments of the eye set, there is almost nothing holding you back from training runecrafting, e.g. with spellbook swap Vile Vigour fletching (multiskill) ZMI runecrafting (or non-spellbook swap stamina potions). It is macroefficient to complete level 95 runecrafting sooner rather than later, to have access to ample wrath runes for offering spells during slayer. Weave in the runecrafting grind at your own convenience, immediately is recommended. Blow glass while ZMI crafting, then when out of glass swap over to fletching instead (buy broad arrowhead packs and arrow shafts as needed). 1. It is meta to sell some of the runes you craft. Sell laws past the first 10,000 and nature runes past the first 30,000 (note: you may wish to keep more runes for your own purposes) to Ali Morissane. Optionally also sell chaos runes for tokkul to TzHaar-Mej-Roh, buying onyx bolt tips and uncut gems with the tokkul (this requires a fire cape).",
        "meta": {
          "gp_stack": "65m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 24,
        "content": "If you only went for one sceptre earlier, do Pyramid Plunder for a second sceptre. Compared to last time the only things that changed are: 1. Use the teleport on your sceptre instead of entering the pyramid. You no longer need to hop for a North mummy. There is/was a bug where you have to leave the previous run instead of teleport out to avoid broken timers. 2. The rooms change little: 1. Room 7: loot the urns as you encounter them (south to north, then along the south wall around the chest). Open the doors clockwise starting east. If you're level 91 or above, make sure to go for chest when the timer hits around 2:10. 2. Room 8: grab the east urns first, then trace back south and go clockwise. Grab the chest before or after the last urn and exit through the northeast open door. 3. The most important trick to getting high xp and sceptre rates is not using the full 5 minutes per pp game \\- most of the time you should be getting laps of 4:40 or faster while opening all 81+ urns (and _skipping urns in the second to last room_ if you can’t keep this pace). This also means you'll run out of synch with other people playing PP, so while you can make use of information from doors others have opened for you (and skip them) while in the same room it's not going to be huge most of the time. 4. Still open chests starting at level 51 room.",
        "meta": {
          "gp_stack": "65m",
          "skillsquests_met": "yes"
        }
      },
      {
        "number": 25,
        "content": "Once you have enough mahogany planks from Misc (or chop teaks at your own convenience), train construction to level 83 with mahogany benches (or tables, slightly lower xp but also lower effort). This takes approximately 10.5k mahogany logs (47 days of Misc at 10 workers). Once done, build/upgrade the following: 1. Ornate rejuvenation pool (requires boostable 87 herblore, along with some Zulrah kills for the scales and antidote++) 2. Ornate jewellery box (if you have the dragonstones) 3. Gilded magic wardrobe (optional) 4. Fairy ring (purchase a second superior garden) 5. Marble cape rack 6. Occult altar 7. Mahogany treasure chest 8. **The total item requirements for this are: 1 Pharaoh’s sceptre, 10000 astral runes, Ancient signet, Lunar signet, 5 limestone bricks, 5 buckets of water, 1000 soul runes, 1000 body runes, 10 stamina potions(4), 10 prayer potions(4), 3 marble blocks, 10 super restores(4), 9 gold leaves, 10 anti-venom(4), 1000 blood runes, 10 mushrooms, 1 Fairy enchantment, 4 mahogany planks, 5 combat bracelets(4), 5 skills necklaces(4), 8 Amulets of glory(4) and 8 Rings of wealth(5).** 9. _Note: this list assumes you didn’t have any pool previously built._",
        "meta": {
          "gp_stack": "46m",
          "skillsquests_met": "yes"
        }
      }
    ]
  },
  {
    "id": "3.3",
    "title": "Beyond BRUHsailer",
    "totalTime": "Unknown",
    "steps": []
  }
]